[
  {
    "title": "GPs, are you okay with pharmacists ringing you up to change the prescription dose/directions?",
    "author": "azureleafe",
    "score": 50,
    "num_comments": 47,
    "created_utc": 1763196018.0,
    "created_date": "2025-11-15 19:40:18",
    "selftext": "I'm a pharmacist who is also a medical student.\n\nI often need to call the GP to get permission to change the dose to a safe, appropriate dose. Most of the time it's clear that the GP accidentally put an increased dose on when they didn't mean to.\n\nThe GPs usually are nice about it and then hang up as soon as I say thank you that's all. Which implies they are very busy.\n\nBut do GPs mind that pharmacists call them up for something seemingly simple like that?\n\nI do feel awkward calling GPs to fix the script.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1oxmpn5/gps_are_you_okay_with_pharmacists_ringing_you_up/",
    "id": "1oxmpn5",
    "link_flair_text": "Support🎗️"
  },
  {
    "title": "Hospital pharmacist",
    "author": "Short_Nobody_4647",
    "score": 9,
    "num_comments": 37,
    "created_utc": 1763087443.0,
    "created_date": "2025-11-14 13:30:43",
    "selftext": "Hey docs, I’m a newly registered hospital pharmacist and wanted to get a better sense of how we can work more effectively with the medical team. From your experience, what can pharmacists do that’s genuinely helpful (if you’ve had any encounters with us) and what things could we improve on to make your jobs easier?",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1owkkre/hospital_pharmacist/",
    "id": "1owkkre",
    "link_flair_text": "other 🤔"
  },
  {
    "title": "How do you feel about this as a GP?",
    "author": "jps848384",
    "score": 92,
    "num_comments": 159,
    "created_utc": 1762995076.0,
    "created_date": "2025-11-13 11:51:16",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1ovn4fz/how_do_you_feel_about_this_as_a_gp/",
    "id": "1ovn4fz",
    "link_flair_text": "General Practice🥼"
  },
  {
    "title": "Pharmacist prescribing letter",
    "author": "Magnusthewellread",
    "score": 42,
    "num_comments": 29,
    "created_utc": 1762557432.0,
    "created_date": "2025-11-08 10:17:12",
    "selftext": "\nI wrote a quick draft letter re pharmacist prescribing below. Feel free to add any suggestions. \n\nI also want to clarify that I think pharmacists are a vital part of our health system and we work together to deliver great outcomes for patients. The complimentary roles we play serve a purpose and have always found benefit from working together in the MDT setting. \n\n\nDear Local Federal Member, \n\nI have greatly benefited from Australia’s world class public heath system throughout my life. I am writing because I am genuinely concerned regarding some of the policies your government has endorsed regarding independent pharmacist prescribing. \n\nI am concerned because, by many metrics, Australia has the best, if not one of the best health systems in the world (see attached letter re adopting policies from the UK which objectively ranks below Aus in measures of health outcomes and equity). However, policies regarding pharmacist prescribing are being rushed through without due consideration or consultation, and risk increasing potential harm to the public in the name of increasing “access”. \n\nWe all have a right to great public healthcare. However, I worry as the public often are not generally aware of the roles of health professionals and can easily be swayed to accept policies that are not in their interest.\n\nPharmacists are not taught diagnosis. Doctors are supervised throughout all of our training and work until we are consultants. Our work is primarily in diagnosis, which involves detailed history taking, examination and investigation with the act of prescribing being merely the last step. The proposed changes to pharmacist prescribing mean that with limited education regarding diagnosis and no ongoing supervision, people who will not be aware of what they do not know regarding diagnosis, have the capacity to not only prescribe a medication but also profit directly from this prescription. This undoes the inherent checking/control mechanisms in our healthcare system that pharmacists usually perform, especially for more highly regulated S4 and S8 medications. \n\nI worry that while seemingly well intentioned, the government is being swayed by the Pharmacy Guild without due consideration for the potential impacts. Pharmacists are a vital part of our multidisciplinary teams. Let’s keep it that way and work together to help all Australians. \n\nI hope you can utilise your position to advocate for us and for all of our futures. ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1or9jf3/pharmacist_prescribing_letter/",
    "id": "1or9jf3",
    "link_flair_text": "Support🎗️"
  },
  {
    "title": "AMA and RACGP joint letter against National Independent Pharmacy Prescribing",
    "author": "Jeefy01",
    "score": 342,
    "num_comments": 82,
    "created_utc": 1762496683.0,
    "created_date": "2025-11-07 17:24:43",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1oqn206/ama_and_racgp_joint_letter_against_national/",
    "id": "1oqn206",
    "link_flair_text": "news🗞️"
  },
  {
    "title": "Let us prescribe S8 and S4 drugs within ‘self-determined’ scope, pharmacists tell board",
    "author": "cr1spystrips",
    "score": 71,
    "num_comments": 62,
    "created_utc": 1761806578.0,
    "created_date": "2025-10-30 17:42:58",
    "selftext": "From https://www.ausdoc.com.au/news/let-us-prescribe-s8-drugs-within-self-determined-scope-pharmacists-tell-board/\n\nThe Pharmacy Board of Australia is being urged to let pharmacists prescribe S4 and S8 drugs independently within their “self-determined” scope of practice without postgraduate training.\n\nThe joint submission from the Pharmacy Guild of Australia, Pharmaceutical Society of Australia and Advanced Pharmacy Australia also calls for pharmacists to prescribe under the PBS and order Medicare-funded pathology tests.\n\nWriting to the board’s consultation on a national pharmacist prescribing standard, the groups called for “autonomous prescribing where a health professional undertakes independent prescribing of any scheduled medicine within their individual self-determined documented scope of practice, which is based on completion of accredited training”.\n\nShort-term, they said they wanted autonomous prescribing available nationwide to pharmacists who have completed a postgraduate course for the various state and territory pharmacy prescribing programs.\n\nBut they also wanted “prescribing competencies” added to the pharmacy undergraduate curriculum “at the earliest possible time” so that “graduates would not be required to undertake additional training”.\n\n“The UK is moving to this model in 2026, with all graduates registering as prescribers, and Australian universities are currently considering options for integration to occur.”\n\nUnder the UK model, pharmacists would be allowed to prescribe after completing a four-year degree plus one “foundation training year”.\n\nThe pharmacy groups added that “funding through the PBS … and through the MBS for pathology services should be enabled for pharmacists to ensure patients can choose their preferred care setting while continuing to benefit from subsidised healthcare, including prescribed medicines counting towards their PBS Safety Net.”\n\nHowever, they said pharmacists should not be allowed to prescribe botox or medicinal cannabis.\n\nWhile state and territory laws govern which medicines pharmacists can prescribe, health ministers have tasked the board with developing a national pharmacist prescribing credential.\n\nIt would mean pharmacists could complete a training course recognised by the Australian Pharmacy Council to have a credential added to their AHPRA listing, qualifying them to prescribe under state and territory programs in any jurisdiction.\n\nThe pharmacy groups said the lack of a national standard meant patients were confused about what pharmacists could prescribe where, especially in border towns.\n\nThey claimed that allowing pharmacists to prescribe for 11 conditions — including uncomplicated UTIs, dyslipidaemia, hypertension, influenza and acute cellulitis — would save the Federal Government $400 million a year.\n\nThis was based on unreleased modelling commissioned by the guild from consultancy firm EY.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1ojslrd/let_us_prescribe_s8_and_s4_drugs_within/",
    "id": "1ojslrd",
    "link_flair_text": "WTF🤬"
  },
  {
    "title": "More conditions that can be diagnosed and treated by pharmacists added to the list:",
    "author": "DojaPat",
    "score": 118,
    "num_comments": 49,
    "created_utc": 1760518464.0,
    "created_date": "2025-10-15 19:54:24",
    "selftext": "\n\n“The Malinauskas Labor Government is providing subsidies of up to $8,500 to support pharmacists undertaking post-graduate training, enabling them to diagnose and manage a wider selection of health issues without the need for a GP appointment.\n\nAmong the new services pharmacists will be qualified to provide are treatments for ear infections, Shingles, school sores, minor wounds, gastro, acne, reflux and muscle or joint pain.”\n\nAt this rate,they’ll be performing neurosurgery by 2028. \n\nMaybe the “joint pain” is due to septic arthritis? Maybe the “gastro” is actually colitis? \nMaybe the “reflux” is actually a STEMI? So irresponsible, but they’ll do anything other than train and fund GPs. ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1o75tgg/more_conditions_that_can_be_diagnosed_and_treated/",
    "id": "1o75tgg",
    "link_flair_text": "General Practice🥼"
  },
  {
    "title": "This is more than just RN prescribing - where we could be headed next",
    "author": "Particular_Number",
    "score": 70,
    "num_comments": 8,
    "created_utc": 1760279391.0,
    "created_date": "2025-10-13 01:29:51",
    "selftext": "A lot has been said of late on this board about RN prescribing, some of which has unncessarily devolved into name calling and vitriol. I am not interested in re-hashing the same arguments here. But I think we need to start calling out the so called 'peak' medical bodies (looing at you AMA and ASMOF), to start running a focused public education campaign-\n\n1. RN prescribing is already here, without a public consultation process and under the guide of 'access', which **AMA has called a 'win' and patted thmselves on the back for winning \"several key safeguards\"** (https://www.ama.com.au/ama-rounds/3-october-2025/articles/securing-safeguards-rn-prescriber-registration-standard)\n\n2. BUT, in the same article, AMA states: \"...*there is ambiguity around the definition of “authorised health practitioner”. While the standard specifies medical and nurse practitioners,* ***recent webinars have suggested this could include other professionals, such as pharmacists***\".\n\n3. Pharmacy board has been pushing for independent prescribing rights (https://www1.racgp.org.au/newsgp/professional/new-step-for-nationally-coordinated-pharmacist-pre)\n\nAnd AMA itself has previously called out adverse patient outcome from the Qld UTI pharmacy prescribing trial (https://www.ama.com.au/gpnn/issue-22-number-18/articles/patient-safety-risk-pharmacy-prescribing-trials): \n\n\"*at least 240 patients treated by pharmacists suffered complications from misdiagnosis – most commonly sexually transmitted infections (STIs), but also cancerous conditions and pregnancies. Patients were also sold antibiotics that were not only inappropriate but dangerous*.\"\n\nSo essentially are now facing the prospect of **a pharmacist, whose own prescribing has been shown to be unsafe, endorsing a nurse to prescribe from a formulary with S8's.** \n\nOnce fiduciary responsibility to patient is replaced with a retail transcation, who here thinks we are not going to see 'affiliated health clinics' promoting discounts on  supplments with every in-house prescription of about-to-expire box of antibiotics  given out for anything for a cough to an acutely painful red eye? Yes I am being a bit hyperbolic but it illustrates the glaring flaw in all this -this is not about 'shared care' or 'better access' -  **if the supervising prescriber is not medically trained in diagnosis and longitudinal risk management, we are substituting roles, not collaborating**.\n\nInstead of groveling for \"urgent clarification from the NMBA\", we need leaders that would  unequivocally retract its support for any form of non-doctor prescribing and take approrirate next steps otherwise we risk creating a two tiered health care system in this country.  If the AMA’s bottom line is medically-led, diagnostically-anchored care, then our public position must say so—clearly, repeatedly, and with red lines that can’t be negotiated away.\n\nEdit: I would encourage everyone to please sign the AMA petition calling for an EGM regarding this: https://www.reddit.com/r/ausjdocs/comments/1o0yc4o/update_call_for_more_ama_members_lets_get_this/",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1o4qiwo/this_is_more_than_just_rn_prescribing_where_we/",
    "id": "1o4qiwo",
    "link_flair_text": "serious🧐"
  },
  {
    "title": "Pharmacists and dangerous medicinal cannabis scripts — when should they just refuse to dispense?",
    "author": "jps848384",
    "score": 13,
    "num_comments": 21,
    "created_utc": 1759970655.0,
    "created_date": "2025-10-09 11:44:15",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1o1sbkb/pharmacists_and_dangerous_medicinal_cannabis/",
    "id": "1o1sbkb",
    "link_flair_text": "news🗞️"
  },
  {
    "title": "Advocacy in the Australian healthcare domain",
    "author": "Secret-Insect6219",
    "score": 8,
    "num_comments": 3,
    "created_utc": 1759892790.0,
    "created_date": "2025-10-08 14:06:30",
    "selftext": "[Transcript source](https://send.bitwarden.com/#DRVFTMwheUOg5bNcADc07A/w5iozPo1ac20yr7tj7dY6g)\n\nSome potential lessons for the medical colleges trying to communicate with MPs, according to the PGA.\n\n# Problems worth solving – Government relations and advocacy to progress your health cause.\n\nFireside chat at Tropical Innovation Festival: Anne Pleash and Trent Twomey\n\n21 June 2025\n\n# Anne Pleash\n\nI might just start with a bit of background, in addition to what Tara has said.\n\nI live here in Cairns, as does Trent - which is probably a bit unusual for the roles that we each have and what we do. I met Trent when I was Bob Katter’s Chief of Staff. I worked for Bob from 2013 to 2019, and in that time we had five Prime Ministers. It was a very interesting time in politics, and Bob was a deciding vote on legislation during about three of those periods.\n\nIt taught me a lot about relationships and stakeholder engagement - and much of what Clinton said earlier really resonates with me.\n\nDuring that time, I met Trent, who was then Chair of Advance Cairns. He was coming down to Canberra a lot and heavily involved in the Pharmacy Guild, where he’s now the National President.\n\nI now run my own business here in Cairns, doing stakeholder relations for a number of clients. I’m also Deputy Chair and Consumer Director of Cancer Council Australia, and on the Board of the North West Hospital and Health Service. So, I definitely have an interest in health.\n\n# Trent Twomey\n\nThanks, and good morning everyone - and thank you to Tara for the invitation.\n\nAs Tara said, we went to high school together at St Mary’s Catholic College in Woree. I was born here - fifth-generation Far North Queensland. All my great-great-great grandparents were born here… I think most of them were probably criminals, but that’s okay.\n\nI was the first in my family not only to go to university but to graduate high school. I’m the eldest of six; my wife and I live here with our two children. All my siblings did trades, so university was quite daunting.\n\nInfluencing decision-makers - people I never thought I’d meet - was exceptionally intimidating. Public speaking used to absolutely petrify me. But if I wanted to create change for my family and my community, I had to understand **power**: what it is, who has it, how it’s wielded, and how to influence it.\n\nThat’s as much a science as it is an art.\n\nNow, as National President of the Pharmacy Guild of Australia - one of the largest advocacy groups in the country, with billions (not millions) in assets - it’s a privilege. But it’s been a long journey.\n\nToday, I want to share what I’ve learned over 20 years about understanding power and influence.\n\nBecause this is an innovation conference - and specifically a health session - I’ll start with this:\n\n&gt;**“Patient-centred care” is an outdated term. “Patient-directed care” is more accurate.**\n\nThere are so many systems and processes in government that claim to protect patients - but really, they protect the power of health professionals.\n\nWhen health professionals say “patient-centred care,” what they often mean is: *“I don’t want to give up my power.”* They’re happy to draw a circle with the patient in the middle so it looks nice - but they don’t want to cede control.\n\nThere is no such thing as a wrong door in care. Whether you choose a state hospital, an Aboriginal community-controlled organisation, a pharmacy, or a GP - that should be your choice.\n\nIf we want innovation, and if we want to close the health gap for First Nations people and regional Australians, then we have to **disrupt**.\n\nDisruption threatens entrenched power dynamics - and that’s why some people find me “provocative.” But they’re really just threatened because they think I’m trying to take their power.\n\nWhat I’m actually saying is: there’s enough sickness to go around. The job of closing the health gap is so massive that pharmacists doing more doesn’t diminish anyone - it just helps close the gap a little.\n\n# Anne Pleash\n\nWhen I first started working in Canberra, I’d never heard of the Pharmacy Guild.\n\nIf you went down to the Esplanade and asked random people - or even tourists - who the Guild is, they’d have no idea. Yet, its influence in Canberra far exceeds what it looks like on paper.\n\nThere are reasons for that. One thing Trent once said to me was that you could give another organisation all the money in the world - and it helps - but **it’s not the reason the Guild succeeds**.\n\nSo, Trent, I’m interested: what’s the difference between **influence** and **access**?\n\n# Trent Twomey\n\nThere’s a very big difference.\n\nMoney helps, sure - it buys access. But **people give you influence**.\n\nI have a very methodical approach to stakeholder engagement. My first stakeholders are my **patients**. My second are my **practitioners**. Then comes the **public**.\n\nIf I’m going to appear on national TV or push for pharmacists to prescribe (which makes doctors go feral), I need my patients and practitioners behind me.\n\nThat doesn’t require money - it requires **time** and **relationships**.\n\nWe structure the Guild to mirror government. Each of our 96 local branch members covers about three state electorates and one federal electorate. Their job is to build relationships - with patients, the public, and elected officials.\n\nSo, when I speak with a Premier or Prime Minister, I know they’ll check back through their caucus - who’ll check with ours - and we’re all aligned.\n\nThat alignment is what gives you influence.\n\n# Anne Pleash\n\nFrom working on the other side - inside a Member of Parliament’s office - I saw that clearly.\n\nBob Katter knows every pharmacy owner in his electorate, which is the fourth-largest in Australia. Every one of them has a personal connection with him.\n\nI often explain relationships like a **bank account** \\- you make daily deposits of goodwill, not expecting anything back. But one day, you might need to make a withdrawal - and you can, because you’ve built that credit.\n\nThat’s what the Guild does so well.\n\nAnd Trent, as you said, **the internal is always harder than the external**. Whether it’s your board, your executive, or your staff - that’s where the legwork happens.\n\nInfluence is built one human relationship at a time.\n\nPoliticians care about three things:\n\n* Getting re-elected\n* Becoming ministers\n* Avoiding bad media\n\nSo, timing matters. Sometimes you hold back; sometimes you go in hard. Always build rapport.\n\nFind a personal link - something memorable. If you’re not asking for money, even better. Tell a good story, say thank you, and share credit.\n\nBecause if you only ever show up to ask for things, you won’t get far.\n\nSo, Trent - when you *do* decide to “pull the hand grenade,” like during the COVID-19 vaccine rollout, how do you make that call?\n\n# Trent Twomey\n\nYeah - that wasn’t fun.\n\nRemember how scary that time was? Supply was short. The AstraZeneca vaccine we could make here, but not Pfizer or Moderna. And at first, pharmacies were excluded.\n\nWe sat through endless meetings where we were literally forgotten:\n\n&gt;“Oh - we forgot pharmacists.”\n\nEvery. Single. Time.\n\nWe stayed patient, but when the government said they’d start exporting surplus vaccines overseas — even though borders were closed and families were still separated - that was it.\n\nI escalated it: first to the Chief Medical Officer, then the Health Minister, then the Prime Minister. They all stood by the decision.\n\nSo I went public. On national television. It was terrifying - I’d been National President for just seven months, 39 years old, from Cairns - and I called out the Department Secretary live on air.\n\nBy the end of the day, **he was stood down**.\n\nWithin 12 weeks, pharmacies were activated, vaccination rates jumped to 80%, and domestic borders reopened.\n\nIt was one of the hardest things I’ve ever done - but it worked.\n\n# Anne Pleash\n\nThere are two lessons there.\n\nFirst: the **“no surprises” approach**. Trent told the Minister what he was going to do before he did it. Even if they didn’t like it, they knew.\n\nSecond: confidence. You never know what’s going on behind the scenes for someone you see on TV. If you find yourself in that situation - **back yourself**. Sometimes you just have to fake it till you make it.\n\n# Trent Twomey\n\nExactly. Most of our wins never make the news - and that’s how it should be.\n\nYou have to understand both your stakeholders and your governments. I literally cross-reference what *my members* want with what *the government* wants.\n\nYou can’t always go after your top priority. Sometimes you target number three, because that’s what aligns with the Premier’s or Prime Minister’s agenda - and that’s where you’ll win.\n\nIt’s not compromise; it’s strategy. And your members need to trust that.\n\n# Anne Pleash\n\nAnd success breeds success.\n\nWhen you get an early win - especially with a new government - it builds trust. That trust lets you move on to bigger, more complex reforms.\n\n# Trent Twomey\n\nExactly. They want you to be a **partner** \\- someone who helps deliver reform, not just asks for it.\n\nA good example is pharmacist prescribing. We started with **uncomplicated urinary tract infections**. Not glamorous, but impactful.\n\nIt reduced preventable hospital presentations, freed up GP appointments, and proved pharmacists could deliver safe, effective care.\n\nThat success opened the door for prescribing in diabetes, asthma, COPD, and more.\n\n# Anne Pleash\n\nBefore we wrap up, I’ll just share something.\n\nOn health boards - and I know many of you serve on them - there’s often nervousness about being “too political.” But really, ministers and MPs are just another stakeholder group.\n\nKeep them informed. Brief them regularly. Because if you don’t, misinformation fills the gap.\n\nIt’s not about politics; it’s about communication.\n\n# Trent Twomey\n\nTotally agree.\n\nIn one of my other roles, I’m Chair of Anglicare North Queensland.\n\nWhen I took over five years ago, we were a $17 million organisation. We were underfunded and running programs below cost.\n\nI flew to Brisbane, tried to see the Director-General, was told “no appointment, go away.” I handed over a termination letter giving 31 days’ notice to hand back all contracts - got back in an Uber to the airport.\n\nPhone rang: “The DG will see you now.”\n\nWe explained the risk we were carrying, the staff burden, and had a plan ready - including the funding figure we needed.\n\nToday, we’re at **$41 million annually**.\n\nWe had the courage to say “no” - and that’s sometimes what advocacy requires.\n\nYou won’t read about that in the paper, nor should you. But it’s the kind of backbone you need.\n\nAnd thank you again, Tara, for having us. Cairns is a small village - we have to look out for each other.\n\nOh - and one thing I kept from COVID:\n\n&gt;Stay a **cassowary apart** from people.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1o0zfu0/advocacy_in_the_australian_healthcare_domain/",
    "id": "1o0zfu0",
    "link_flair_text": "other 🤔"
  },
  {
    "title": "Trent Twomey on Pharmacy Guild lobbying",
    "author": "Secret-Insect6219",
    "score": 18,
    "num_comments": 18,
    "created_utc": 1759892406.0,
    "created_date": "2025-10-08 14:00:06",
    "selftext": "This is a throwaway account.  \n[Transcript source](https://send.bitwarden.com/#DRVFTMwheUOg5bNcADc07A/w5iozPo1ac20yr7tj7dY6g)\n\n# Problems worth solving – Government relations and advocacy to progress your health cause.\n\nFireside chat at Tropical Innovation Festival: Anne Pleash and Trent Twomey\n\n21 June 2025\n\n# Anne Pleash\n\nI might just start with a bit of background, in addition to what Tara has said.\n\nI live here in Cairns, as does Trent - which is probably a bit unusual for the roles that we each have and what we do. I met Trent when I was Bob Katter’s Chief of Staff. I worked for Bob from 2013 to 2019, and in that time we had five Prime Ministers. It was a very interesting time in politics, and Bob was a deciding vote on legislation during about three of those periods.\n\nIt taught me a lot about relationships and stakeholder engagement - and much of what Clinton said earlier really resonates with me.\n\nDuring that time, I met Trent, who was then Chair of Advance Cairns. He was coming down to Canberra a lot and heavily involved in the Pharmacy Guild, where he’s now the National President.\n\nI now run my own business here in Cairns, doing stakeholder relations for a number of clients. I’m also Deputy Chair and Consumer Director of Cancer Council Australia, and on the Board of the North West Hospital and Health Service. So, I definitely have an interest in health.\n\n# Trent Twomey\n\nThanks, and good morning everyone - and thank you to Tara for the invitation.\n\nAs Tara said, we went to high school together at St Mary’s Catholic College in Woree. I was born here - fifth-generation Far North Queensland. All my great-great-great grandparents were born here… I think most of them were probably criminals, but that’s okay.\n\nI was the first in my family not only to go to university but to graduate high school. I’m the eldest of six; my wife and I live here with our two children. All my siblings did trades, so university was quite daunting.\n\nInfluencing decision-makers - people I never thought I’d meet - was exceptionally intimidating. Public speaking used to absolutely petrify me. But if I wanted to create change for my family and my community, I had to understand **power**: what it is, who has it, how it’s wielded, and how to influence it.\n\nThat’s as much a science as it is an art.\n\nNow, as National President of the Pharmacy Guild of Australia - one of the largest advocacy groups in the country, with billions (not millions) in assets - it’s a privilege. But it’s been a long journey.\n\nToday, I want to share what I’ve learned over 20 years about understanding power and influence.\n\nBecause this is an innovation conference - and specifically a health session - I’ll start with this:\n\n&gt;**“Patient-centred care” is an outdated term. “Patient-directed care” is more accurate.**\n\nThere are so many systems and processes in government that claim to protect patients - but really, they protect the power of health professionals.\n\nWhen health professionals say “patient-centred care,” what they often mean is: *“I don’t want to give up my power.”* They’re happy to draw a circle with the patient in the middle so it looks nice - but they don’t want to cede control.\n\nThere is no such thing as a wrong door in care. Whether you choose a state hospital, an Aboriginal community-controlled organisation, a pharmacy, or a GP - that should be your choice.\n\nIf we want innovation, and if we want to close the health gap for First Nations people and regional Australians, then we have to **disrupt**.\n\nDisruption threatens entrenched power dynamics - and that’s why some people find me “provocative.” But they’re really just threatened because they think I’m trying to take their power.\n\nWhat I’m actually saying is: there’s enough sickness to go around. The job of closing the health gap is so massive that pharmacists doing more doesn’t diminish anyone - it just helps close the gap a little.\n\n# Anne Pleash\n\nWhen I first started working in Canberra, I’d never heard of the Pharmacy Guild.\n\nIf you went down to the Esplanade and asked random people - or even tourists - who the Guild is, they’d have no idea. Yet, its influence in Canberra far exceeds what it looks like on paper.\n\nThere are reasons for that. One thing Trent once said to me was that you could give another organisation all the money in the world - and it helps - but **it’s not the reason the Guild succeeds**.\n\nSo, Trent, I’m interested: what’s the difference between **influence** and **access**?\n\n# Trent Twomey\n\nThere’s a very big difference.\n\nMoney helps, sure - it buys access. But **people give you influence**.\n\nI have a very methodical approach to stakeholder engagement. My first stakeholders are my **patients**. My second are my **practitioners**. Then comes the **public**.\n\nIf I’m going to appear on national TV or push for pharmacists to prescribe (which makes doctors go feral), I need my patients and practitioners behind me.\n\nThat doesn’t require money - it requires **time** and **relationships**.\n\nWe structure the Guild to mirror government. Each of our 96 local branch members covers about three state electorates and one federal electorate. Their job is to build relationships - with patients, the public, and elected officials.\n\nSo, when I speak with a Premier or Prime Minister, I know they’ll check back through their caucus - who’ll check with ours - and we’re all aligned.\n\nThat alignment is what gives you influence.\n\n# Anne Pleash\n\nFrom working on the other side - inside a Member of Parliament’s office - I saw that clearly.\n\nBob Katter knows every pharmacy owner in his electorate, which is the fourth-largest in Australia. Every one of them has a personal connection with him.\n\nI often explain relationships like a **bank account** \\- you make daily deposits of goodwill, not expecting anything back. But one day, you might need to make a withdrawal - and you can, because you’ve built that credit.\n\nThat’s what the Guild does so well.\n\nAnd Trent, as you said, **the internal is always harder than the external**. Whether it’s your board, your executive, or your staff - that’s where the legwork happens.\n\nInfluence is built one human relationship at a time.\n\nPoliticians care about three things:\n\n* Getting re-elected\n* Becoming ministers\n* Avoiding bad media\n\nSo, timing matters. Sometimes you hold back; sometimes you go in hard. Always build rapport.\n\nFind a personal link - something memorable. If you’re not asking for money, even better. Tell a good story, say thank you, and share credit.\n\nBecause if you only ever show up to ask for things, you won’t get far.\n\nSo, Trent - when you *do* decide to “pull the hand grenade,” like during the COVID-19 vaccine rollout, how do you make that call?\n\n# Trent Twomey\n\nYeah - that wasn’t fun.\n\nRemember how scary that time was? Supply was short. The AstraZeneca vaccine we could make here, but not Pfizer or Moderna. And at first, pharmacies were excluded.\n\nWe sat through endless meetings where we were literally forgotten:\n\n&gt;“Oh - we forgot pharmacists.”\n\nEvery. Single. Time.\n\nWe stayed patient, but when the government said they’d start exporting surplus vaccines overseas — even though borders were closed and families were still separated - that was it.\n\nI escalated it: first to the Chief Medical Officer, then the Health Minister, then the Prime Minister. They all stood by the decision.\n\nSo I went public. On national television. It was terrifying - I’d been National President for just seven months, 39 years old, from Cairns - and I called out the Department Secretary live on air.\n\nBy the end of the day, **he was stood down**.\n\nWithin 12 weeks, pharmacies were activated, vaccination rates jumped to 80%, and domestic borders reopened.\n\nIt was one of the hardest things I’ve ever done - but it worked.\n\n# Anne Pleash\n\nThere are two lessons there.\n\nFirst: the **“no surprises” approach**. Trent told the Minister what he was going to do before he did it. Even if they didn’t like it, they knew.\n\nSecond: confidence. You never know what’s going on behind the scenes for someone you see on TV. If you find yourself in that situation - **back yourself**. Sometimes you just have to fake it till you make it.\n\n# Trent Twomey\n\nExactly. Most of our wins never make the news - and that’s how it should be.\n\nYou have to understand both your stakeholders and your governments. I literally cross-reference what *my members* want with what *the government* wants.\n\nYou can’t always go after your top priority. Sometimes you target number three, because that’s what aligns with the Premier’s or Prime Minister’s agenda - and that’s where you’ll win.\n\nIt’s not compromise; it’s strategy. And your members need to trust that.\n\n# Anne Pleash\n\nAnd success breeds success.\n\nWhen you get an early win - especially with a new government - it builds trust. That trust lets you move on to bigger, more complex reforms.\n\n# Trent Twomey\n\nExactly. They want you to be a **partner** \\- someone who helps deliver reform, not just asks for it.\n\nA good example is pharmacist prescribing. We started with **uncomplicated urinary tract infections**. Not glamorous, but impactful.\n\nIt reduced preventable hospital presentations, freed up GP appointments, and proved pharmacists could deliver safe, effective care.\n\nThat success opened the door for prescribing in diabetes, asthma, COPD, and more.\n\n# Anne Pleash\n\nBefore we wrap up, I’ll just share something.\n\nOn health boards - and I know many of you serve on them - there’s often nervousness about being “too political.” But really, ministers and MPs are just another stakeholder group.\n\nKeep them informed. Brief them regularly. Because if you don’t, misinformation fills the gap.\n\nIt’s not about politics; it’s about communication.\n\n# Trent Twomey\n\nTotally agree.\n\nIn one of my other roles, I’m Chair of Anglicare North Queensland.\n\nWhen I took over five years ago, we were a $17 million organisation. We were underfunded and running programs below cost.\n\nI flew to Brisbane, tried to see the Director-General, was told “no appointment, go away.” I handed over a termination letter giving 31 days’ notice to hand back all contracts - got back in an Uber to the airport.\n\nPhone rang: “The DG will see you now.”\n\nWe explained the risk we were carrying, the staff burden, and had a plan ready - including the funding figure we needed.\n\nToday, we’re at **$41 million annually**.\n\nWe had the courage to say “no” - and that’s sometimes what advocacy requires.\n\nYou won’t read about that in the paper, nor should you. But it’s the kind of backbone you need.\n\nAnd thank you again, Tara, for having us. Cairns is a small village - we have to look out for each other.\n\nOh - and one thing I kept from COVID:\n\n&gt;Stay a **cassowary apart** from people.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1o0zb6j/trent_twomey_on_pharmacy_guild_lobbying/",
    "id": "1o0zb6j",
    "link_flair_text": "Opinion📣"
  },
  {
    "title": "Call to all AMA Members – Extraordinary General Meeting",
    "author": "Prior-Lawful",
    "score": 178,
    "num_comments": 24,
    "created_utc": 1759566122.0,
    "created_date": "2025-10-04 18:22:02",
    "selftext": "My fellow Doctors,\nAs state AMA members, we are automatically members of the Federal AMA. Under the AMA constitution, members have the right to requisition an Extraordinary General Meeting (EGM).\n\nI am calling for such a meeting to seek clarity and accountability on how the AMA has arrived at its current position - appearing to support (or at the very least, tacitly permit) the ongoing scope creep into core areas of medical practice.\n\nWhy this matters:\n- Nurses and pharmacists are now prescribing. Prescribing is not just a technical task, it is one of the core fundamentals of medical practice, underpinned by years of rigorous training, examinations, and clinical judgment.\n\n- Roles matter. Training matters. Pharmacists are highly trained - but for their role. Nurses are highly trained - but for their role. Doctors undertake prolonged and extensive training to safely and appropriately prescribe treatment. \n\n- Mutual respect. We value and respect the contributions of our nursing and pharmacy colleagues. But blurring of roles without equivalent training standards risks patient safety and undermines the integrity of the medical profession.\n\nObjectives of the EGM:\n1. Obtain transparency on federal AMA decision-making, consultation, and representation regarding scope creep.\n2. Debate and, if appropriate, pass motions to protect the role of doctors in prescribing.\n3. Reaffirm the AMA’s advocacy for safe, role-appropriate models of care.\n\nWe must ask: What is the point of endless exams, countless hours of study, and all those years of training if the very fundamentals of medical practice can be simply handed away without so much as a public protest?\n\nThis is not about turf. This is about patient safety, professional integrity, and the future of medicine in Australia.\n\nPlease - if you support the motion join here: \nhttps://forms.office.com/r/n24552FGBq",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1nxofpu/call_to_all_ama_members_extraordinary_general/",
    "id": "1nxofpu",
    "link_flair_text": "serious🧐"
  },
  {
    "title": "Pharmacists prescribing? Junior docs need to show up to these “consultations”",
    "author": "FieldThis6703",
    "score": 78,
    "num_comments": 35,
    "created_utc": 1759425776.0,
    "created_date": "2025-10-03 03:22:56",
    "selftext": "Our hospital is running “consultations” on Collaborative Pharmacist Medication Prescribing (CPMP). Translation: pharmacists prescribing meds under the banner of “collaboration.” Junior doctors have been tacked onto the invite list, but it’s obvious this is already being pushed through with minimal genuine input from us.\n\nThis is yet another example of scope creep - decisions being made about clinical responsibility without properly engaging the group most likely to carry the fallout when things inevitably go wrong: junior doctors.\n\nIf you’re at a hospital where these sessions are happening, go. Sit in, ask hard questions, make it clear what’s at stake. Otherwise, we’ll be left with pharmacists prescribing, blurred accountability, and us doing the grunt work to clean it up while they claim it’s all “collaborative.”\n\nHas anyone actually worked under this system? Did it help, or was it just another bureaucratic mess?",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1nwa0in/pharmacists_prescribing_junior_docs_need_to_show/",
    "id": "1nwa0in",
    "link_flair_text": "WTF🤬"
  },
  {
    "title": "Pharmacists aspiring to take some current roles of GPs and hospitals?",
    "author": "Substantial-Rich3265",
    "score": 26,
    "num_comments": 42,
    "created_utc": 1758798404.0,
    "created_date": "2025-09-25 21:06:44",
    "selftext": "Good evening to all my fellow marshmallows, I hope everyone is well.   \nI’m just a bit curious as to what everyone elses opinion is on this new development in healthcare?\n\n[https://www.youtube.com/watch?v=6gGvDZuD1T4](https://www.youtube.com/watch?v=6gGvDZuD1T4)\n\nShould pharmacists be endowed this responsibility to look over minor cases? ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1nq3t71/pharmacists_aspiring_to_take_some_current_roles/",
    "id": "1nq3t71",
    "link_flair_text": "Opinion📣"
  },
  {
    "title": "Everyone is coming for the role doctors do, how can we take back out profession?",
    "author": "meaningof42is",
    "score": 55,
    "num_comments": 123,
    "created_utc": 1757761960.0,
    "created_date": "2025-09-13 21:12:40",
    "selftext": "So, we all know pharmacy is gunning for broader scope. And then nurses will be too.\n\nWhat can we do about this?\n\nPerhaps if all GPs had a notice in their office something to the effect of \"all patients with treatment initiated by pharmacist/nurse/not doctor will invite a $30 adminstration fee to compensate for time taken to check how treatment was arrived at\" or something to that effect. I actually see this as legitimate as it would require a reasonable amount of time to confirm what happened from what I consider a medically untrustworthy source.\nI'm not sure, but I assume this could be verified through the MyEHR etc?\n\nThoughts?\n",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1nfuuh8/everyone_is_coming_for_the_role_doctors_do_how/",
    "id": "1nfuuh8",
    "link_flair_text": "Opinion📣"
  },
  {
    "title": "The Pharmacy Guild needs to be destroyed. (Pharmacy Guild delenda est)",
    "author": "DojaPat",
    "score": 284,
    "num_comments": 107,
    "created_utc": 1757580806.0,
    "created_date": "2025-09-11 18:53:26",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1ne3pua/the_pharmacy_guild_needs_to_be_destroyed_pharmacy/",
    "id": "1ne3pua",
    "link_flair_text": "General Practice🥼"
  },
  {
    "title": "Day in the life of a doctor - ABC News/News Corp/Herald edition",
    "author": "PseudoscientificBook",
    "score": 673,
    "num_comments": 29,
    "created_utc": 1756782268.0,
    "created_date": "2025-09-02 13:04:28",
    "selftext": "I wake up at 9am and enjoy my breakfast in bed prepared by minimum wage nursing servants. I drive my sedan - well, my chauffeured Rolls Royce - to my clinic an hour late. I hit a few pharmacists and allied health people on the way but the magistrate writes these off for me as my indemnity policy is murderproof. \n\nThe patients have been waiting for 13 hours (I chose to leave early halfway through my shift yesterday to ensure this). \n\nI have a long and tiring day of dismissing women's pain (despite the fact that statistically speaking I am more likely to be a woman than a man). \n\nMy receptionist does the billings - I charge patients several thousand dollars per seven minute consult on top of the Medicare rebate (Albanese transfers the deeds for several entire Sydney Eastern suburbs straight to my bank account), and gives me a passionate kiss before sending me home to my wife and children. \n\nBefore bed, I fraudulently bill a few hip replacements to the taxpayer to settle my nerves after a busy workday. I dream of money. ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1n68ktv/day_in_the_life_of_a_doctor_abc_newsnews/",
    "id": "1n68ktv",
    "link_flair_text": "sh8t post :doge:"
  },
  {
    "title": "Why are we diluting expertise",
    "author": "Towering_insight",
    "score": 52,
    "num_comments": 9,
    "created_utc": 1756469376.0,
    "created_date": "2025-08-29 22:09:36",
    "selftext": "[https://asmofq.org.au/news%2Fupdates/f/pharmacist-prescribing-in-qh](https://asmofq.org.au/news%2Fupdates/f/pharmacist-prescribing-in-qh)\n\nThe expertise of medical practitioner are being constantly diluted with a broadening scope of practice of no medical professional. Specialisation is the bed rock of quality, health outcomes and economic efficiency  Yet the solution from government is to let everyone and their dog put their hand up and have ago. This end in a race to the bottom RIP medicine. ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1n35ofb/why_are_we_diluting_expertise/",
    "id": "1n35ofb",
    "link_flair_text": "WTF🤬"
  },
  {
    "title": "He was fit and full of life’: Did pharmacist’s errors lead to man’s death?",
    "author": "bxholland",
    "score": 108,
    "num_comments": 63,
    "created_utc": 1756092141.0,
    "created_date": "2025-08-25 13:22:21",
    "selftext": "  \n“\\[The pharmacist\\] took it upon himself to provide advice based on his own judgement and, in doing so, stepped outside his scope as a pharmacist working under a standing order,” Cooper concluded.\"\n\n  \nYikes. This is why scope of practice matters. \n\n[https://www.stuff.co.nz/nz-news/360799162/he-was-fit-and-full-life-did-pharmacists-errors-lead-mans-death](https://www.stuff.co.nz/nz-news/360799162/he-was-fit-and-full-life-did-pharmacists-errors-lead-mans-death)  \n",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1mzftuo/he_was_fit_and_full_of_life_did_pharmacists/",
    "id": "1mzftuo",
    "link_flair_text": "news🗞️"
  },
  {
    "title": "A call for common sense",
    "author": "Arbitrary-Nonsense-",
    "score": 0,
    "num_comments": 25,
    "created_utc": 1755242613.0,
    "created_date": "2025-08-15 17:23:33",
    "selftext": "I’d like to preface this with the acknowledgment that I am a community pharmacist and I am aware that I have a very limited understanding of the pressures you operate under as you develop your practice.\n\nI simply want to ask that as you train you hone not only your clinical skills but your common sense and your vision of patients as people. The reason I’m asking this is that over my 15 years in practice I’m seeing a really troubling trend towards prescribers feeling hamstrung by policies put out by bureaucrats not clinicians. The example I would like to present is semaglutide. \n\n As this medicine entered into “blockbuster” territory, I started to read everything I could about. I am certainly not claiming to be an expert but I brought what limited skills I had to bear and it I have the *tentative* view that it is a wonder drug. The side effects for most patients are mild and easily managed. While it can have serious side effects these are mostly rare. Despite this I see a serious reluctance to prescribe it to patients that would benefit. Not just diabetics but patients with CKD, cardiovascular disease or even just people struggling with obesity. It is this last group that get the shortest shrift. They are still prescribed diet and exercise when the evidence is clear that this dose not work. I still regularly see new scripts for Phentermine. Phentermine! For people who have never used it before. Why would you ever prescribe this medication if you didn’t have to!? \n\nI completely understand the need to be cautious and to monitor your patients and to slowly increase their dose but the policing that goes on is strange. \n\nSpeaking of policing, this takes me to the aspect of this point that I want to convey the most. When the company was conveniently unable to manufacturer Ozempic but somehow had no problem creating Wegovy, an incredible feet of marketing occurred. The company in concert with the TGA manage to spin the idea that poor, innocent type two diabetics were deserving of the cheap and subsidised Ozempic and the lazy fatties should pay about double the price for the Wegovy. A brief lesson on how medications are subsidised under the PBS, if you’ll allow me. There is a government body called the PBAC which is very practised at negotiating with drug companies, because Ozempic is PBS subsidised the price the company can charge the Pharmacy for the medication has a negotiated upper limit. It’s about $110, if this is prescribed to a diabetic the PBS pay the difference but if it is on a private prescription the pharmacy will charge its usual margin and so the price comes out to around $150. With Wegovy, no such limit exists. So the company charge almost double the price. I don’t need to tell you that Type 2 diabetes is almost exclusively a consequence of obesity, so what a feat by this company to influence prescribing and dispensing practices. And this is not exclusively at your feet, Pharmacist were just as bad, I know colleagues who would refuse to dispenses Ozempic for patients that weren’t diabetic. But I can understand this from my profession, we exist as an extension of guidelines and rules, but doctors have to be free of this, not bound by anything other than concern for their patients and their medical training.\n\nThis could be completely something that only happens in my little corner of the world but I think the point still stands. You have powers to help people that no one else does, if you choose not to they are fire reaching consequences. I hope, as you move through your training and become the leaders of your profession you temper guidelines with bravery and common sense.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1mqqm7o/a_call_for_common_sense/",
    "id": "1mqqm7o",
    "link_flair_text": "Gen Med🩺"
  },
  {
    "title": "The push for more pharmacists to diagnose health conditions",
    "author": "dayumsonlookatthat",
    "score": 135,
    "num_comments": 105,
    "created_utc": 1755182543.0,
    "created_date": "2025-08-15 00:42:23",
    "selftext": "I see Australia is copying UK healthcare with noctorisation. Please nip this in the bud if you guys can. ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1mq2lvg/the_push_for_more_pharmacists_to_diagnose_health/",
    "id": "1mq2lvg",
    "link_flair_text": "WTF🤬"
  },
  {
    "title": "Scope Creep Phase 2.0 : GP Requiem (Pharmacy Guild unveils 10-year plan)",
    "author": "Laddaroni",
    "score": 158,
    "num_comments": 88,
    "created_utc": 1754636397.0,
    "created_date": "2025-08-08 16:59:57",
    "selftext": "I am beyond exhausted watching this bipartisan push from the powers that be (because let's be honest, there's no chance this hasn't been planned, preordained and coordinated), as they systemically dismantle and erode everything that comes with our profession in the false virtue signalling name of \"patient care\".\n\n\n\n\n\nFirst it was weaponizing AHPRA to keep us leashed and taciturn.\n\n\n\n\n\nThen it was screwing over the myriad of unaccredited registrars begging for a spot into their chosen specialty program.\n\n\n\n\n\nThen it was the advent of scope creep heralded from the NP apocalypse and the utter waste of money Urgent Care has already proven itself to be. \n\n\n\n\n\nThen it was PsychGate, the Marshmellow saga and the NSW Gambit.\n\n\n\n \n\nAnd now they're going straight for the jugulars of GPs.\n\n\n\n\n\nWho will be next?\n\n\n\n\n\nFundamentally, their goals are to make \"the numbers\" look better, to dilute our power and prestige as Doctors, and to finally CORRUPT our healthcare system and EVERYTHING we stand for into a God forsaken Chimera alchemized from the poisonous guts of the NHS and the American system. \n\n \n\nMake no mistake folks; the Pharmacist Guild has revealed these plans to us because they have friends in VERY high places and they KNOW they're going to succeed and get away with it. They're laughing at us behind our backs because they KNOW we aren't going to do ANYTHING about it.\n\n\n\nI know this because the Medical Schools selected us for our agreeableness and our self sacrificial propensities. \n\n\n\nI know this because we are kept divided and exhausted. \n\n\n\nI know this because they make us pay fees to colleges and organizations we are told are looking after our interests. \n\nBut it's all an illusion. \n\nDon't let your intelligence be insulted; at their highest levels these organizations are clearly in on this whole thing.\n\n\n\n\n\nThe uncomfortable truth is that we started by dissecting frogs and now we find ourselves boiling among them. \n\n\n\n\n\nIt's all by design folks. \n\n\n\n\n\nIt's a big club, and we ain't in it. \n\n",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1mkocdr/scope_creep_phase_20_gp_requiem_pharmacy_guild/",
    "id": "1mkocdr",
    "link_flair_text": "General Practice🥼"
  },
  {
    "title": "Extended scope pharmacists?",
    "author": "baddie_in_a_benz",
    "score": 22,
    "num_comments": 23,
    "created_utc": 1754223129.0,
    "created_date": "2025-08-03 22:12:09",
    "selftext": "thoughts on the extended scope pharmacy scheme? \n\nDiagnosing and treating conditions like nausea/ vomiting, dermatitis and GORD etc can potentially lead to misdiagnosis of more serious things pharmacists don’t have the training to recognise the red flags of i.e. acute surgical abdomen, serious drug reasons or even upper GI malignancy (respectively) and much more. \n\nSure on paper it sounds good to ease pressure off of GPs but I feel increasing funding and fixing the GP system should be the focus, so patients receive appropriate medical care\n",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1mghpnm/extended_scope_pharmacists/",
    "id": "1mghpnm",
    "link_flair_text": "General Practice🥼"
  },
  {
    "title": "Any JP doctors here?",
    "author": "Dangerous-Hour6062",
    "score": 8,
    "num_comments": 8,
    "created_utc": 1752822862.0,
    "created_date": "2025-07-18 17:14:22",
    "selftext": "I’ve met a lot of pharmacists, lawyers and nurses who are JPs but only one doctor. \n\nAre there any JPs amongst us here? What was the course like? Would you recommend it to other doctors? ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1m2vpxg/any_jp_doctors_here/",
    "id": "1m2vpxg",
    "link_flair_text": "Career✊"
  },
  {
    "title": "QLD pharmacist prescribing guideline is out",
    "author": "Selvarian",
    "score": 15,
    "num_comments": 9,
    "created_utc": 1752279119.0,
    "created_date": "2025-07-12 10:11:59",
    "selftext": "[https://www.health.qld.gov.au/\\_\\_data/assets/pdf\\_file/0034/1450987/guide-medicines-management.pdf](https://www.health.qld.gov.au/__data/assets/pdf_file/0034/1450987/guide-medicines-management.pdf)\n\n",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1lxmmfl/qld_pharmacist_prescribing_guideline_is_out/",
    "id": "1lxmmfl",
    "link_flair_text": "QLD"
  },
  {
    "title": "News- Nurses will need 5000 hours’ experience, postgraduate training and six months of mentoring to prescribe S8 drugs",
    "author": "MuAntagoniser",
    "score": 98,
    "num_comments": 92,
    "created_utc": 1749029430.0,
    "created_date": "2025-06-04 19:30:30",
    "selftext": "Now this is a controversial one. Certainly interesting to see the comparison between pharmacist and nurse prescribing made by the AMA president.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1l3176h/news_nurses_will_need_5000_hours_experience/",
    "id": "1l3176h",
    "link_flair_text": "news🗞️"
  },
  {
    "title": "Australia's first batch of Doctor of Pharmacy students has graduated",
    "author": "CarpetLate5443",
    "score": 0,
    "num_comments": 13,
    "created_utc": 1748526953.0,
    "created_date": "2025-05-29 23:55:53",
    "selftext": "Charles Darwin University (CDU) has achieved a significant milestone by graduating Australia's first cohort of Doctor of Pharmacy (PharmD) students, marking a transformative moment for the pharmacy profession nationwide  .\n\nA Historic First for Australian Pharmacy\n\nSix students from CDU have become the first in the country to earn the PharmD title under newly implemented accreditation reforms.  These changes, introduced in 2025, allow graduates of extended master's programs in pharmacy to use the title \"Doctor,\" aligning the profession with other health fields such as medicine, dentistry, and physiotherapy  .\n\nThe program at CDU is designed to meet rigorous national standards set by the Pharmacy Board of Australia and the Australian Health Practitioner Regulation Agency (AHPRA).  It includes work-integrated learning, ensuring that students gain practical experience in various healthcare settings  .\n\nPersonal Triumph: Mahsa Mosalla's Journey\n\nAmong the graduates is 26-year-old Mahsa Mosalla, an Iranian migrant who moved to Australia in 2018.  Inspired by her siblings and driven by her late father's emphasis on education, Mahsa pursued pharmacy to honor her family's values.  She hopes that the Doctor of Pharmacy title will elevate the perception of pharmacists in Australia, highlighting their critical role in patient care beyond dispensing medications  .\n\nExpanding Opportunities and Access\n\nCDU's PharmD program is offered both on-campus and online, reflecting the university's commitment to providing greater access to education, especially in rural and remote areas.  This flexibility allows students from diverse backgrounds to pursue advanced pharmacy education without geographical constraints  .\n\nThe introduction of the Doctor of Pharmacy award signifies a pivotal advancement in acknowledging the evolving clinical responsibilities of pharmacists.  It opens doors for expanded roles, including prescribing rights and enhanced clinical services, positioning pharmacists as integral members of the healthcare team.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1kybfg2/australias_first_batch_of_doctor_of_pharmacy/",
    "id": "1kybfg2",
    "link_flair_text": "news🗞️"
  },
  {
    "title": "Medical certificates: sold to the lowest bidder?",
    "author": "Key-Computer3379",
    "score": 48,
    "num_comments": 53,
    "created_utc": 1748503166.0,
    "created_date": "2025-05-29 17:19:26",
    "selftext": "New app ‘Sicky’: $20 Med Certs from pharmacists\nhttps://sicky.com.au\n\nBUT\n\nWhat’s the *REAL* cost of a medical certificate?\n\nOur credibility? \nOur monopoly? \nOur collective sanity?\n\nKeen to hear your thoughts.\n",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1ky4jeh/medical_certificates_sold_to_the_lowest_bidder/",
    "id": "1ky4jeh",
    "link_flair_text": "Opinion📣"
  },
  {
    "title": "Pharmacists will become ‘doctors’ with a one-year online master’s degree — this is how",
    "author": "Astronomicology",
    "score": 74,
    "num_comments": 88,
    "created_utc": 1747909899.0,
    "created_date": "2025-05-22 20:31:39",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1ksndf8/pharmacists_will_become_doctors_with_a_oneyear/",
    "id": "1ksndf8",
    "link_flair_text": "news🗞️"
  },
  {
    "title": "Victoria funds free Pharmacist consultations",
    "author": "Embarrassed_Value_94",
    "score": 18,
    "num_comments": 10,
    "created_utc": 1747855599.0,
    "created_date": "2025-05-22 05:26:39",
    "selftext": "And free prescriptions for those consultations too apparently, according to one of the comments in the article\n\nWhy are govts so in cahoots with the pharmacy guilds?\n\nhttps://www.ausdoc.com.au/news/victoria-funds-pharmacist-consults-for-20-conditions-including-type-2-diabetes-and-hypertension/?fbclid=IwZXh0bgNhZW0CMTEAAR4hjiYE5UkWPVY2qejnvu4jp0HjLkzsf3-g_8f7x-hgXn60bKHrgkV7ymHLSg_aem_EYuVcRsvg_Ed3iOSBJmNyQ&amp;utm_content=buffer46c9e&amp;utm_medium=social&amp;utm_source=twitter.com&amp;utm_campaign=buffer",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1ks6ov6/victoria_funds_free_pharmacist_consultations/",
    "id": "1ks6ov6",
    "link_flair_text": "news🗞️"
  },
  {
    "title": "Honest thoughts on a pharmacist-led model focused on advice, not retail?",
    "author": "Ok_Tip_3583",
    "score": 0,
    "num_comments": 30,
    "created_utc": 1746350596.0,
    "created_date": "2025-05-04 19:23:16",
    "selftext": "Hi all,\nI'm not a doctor—sorry for the intrusion into your subreddit—but I'm genuinely looking for critical, honest feedback.\n\nAfter years as an employee manager in community pharmacy, I’m considering ownership—but with a different model. The idea is to move away from retail-focused pharmacy and towards a more clinical, service-based model.\n\nI’m calling it True Dose Pharmacy. No retail markups on OTCs or supplements. No upselling, no product-push incentives. Instead, patients pay a $10 walk-in fee for a consult with a pharmacist. Any recommended products are provided at cost price, or they’re free to take the advice and buy elsewhere. The aim is to provide paid, unbiased clinical advice.\n\nExample: A patient presents with mild contact dermatitis. Instead of walking out with a steroid cream, two moisturisers, new gentle body wash and a “skin-specific” probiotic (yes this happens in some pharmacies), they get a short structured consult: history, red flag check, appropriate product advice, counselling, and safety netting. If treatment is appropriate, it’s offered at cost.\n\nI’m not trying to replace GPs—just offer structured support in low-acuity spaces where pharmacists already give informal advice, but usually under a commercial lens.\n\nTraditional income streams (PBS dispensing, vaccinations, DAAs, MedsChecks, ORT, etc.) would remain—but you won’t find scented candles, lipstick, oral phenylephrine or toilet paper on the shelves. The focus is purely clinical.\n\nDoes this sound like a step in the right direction—or is it still too close to the line?\n\nThanks in advance for any input.\n\n",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1kefrjm/honest_thoughts_on_a_pharmacistled_model_focused/",
    "id": "1kefrjm",
    "link_flair_text": "other 🤔"
  },
  {
    "title": "Consultant pharmacist?",
    "author": "jps848384",
    "score": 40,
    "num_comments": 46,
    "created_utc": 1746310303.0,
    "created_date": "2025-05-04 08:11:43",
    "selftext": "This is just bunch of pharmacists into consulting right??",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1ke4krj/consultant_pharmacist/",
    "id": "1ke4krj",
    "link_flair_text": "Support🎗️"
  },
  {
    "title": "Asking out other hospital staff - yay or nay?",
    "author": "EconomicsOk3531",
    "score": 41,
    "num_comments": 40,
    "created_utc": 1745580563.0,
    "created_date": "2025-04-25 21:29:23",
    "selftext": "What’s the consensus on asking out other hospital staff on the same team?\n\n- other docs, nurses, pharmacists, physios… \n\nThere’s someone I want to ask out but I’m thinking of waiting for the end of my rotation, right before I leave so that if she says no, it won’t make working together awkward ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1k7ilqw/asking_out_other_hospital_staff_yay_or_nay/",
    "id": "1k7ilqw",
    "link_flair_text": "Opinion📣"
  },
  {
    "title": "Pharmacist prescribing foolery",
    "author": "wintersux_summer4eva",
    "score": 201,
    "num_comments": 3,
    "created_utc": 1744715609.0,
    "created_date": "2025-04-15 21:13:29",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1jzp7gp/pharmacist_prescribing_foolery/",
    "id": "1jzp7gp",
    "link_flair_text": "sh8t post :doge:"
  },
  {
    "title": "Concerns",
    "author": "Adventurous_Tart_403",
    "score": 45,
    "num_comments": 19,
    "created_utc": 1744235238.0,
    "created_date": "2025-04-10 07:47:18",
    "selftext": "Hey fellow Aus Docs,\n\nSomething has been on my mind about these strikes and their current policy context.\n\nIn recent times we have seen numerous attacks from policy makers and health bodies in Australia on the job security, income and working conditions of Australian trained doctors. These include streamlining pathways for import of foreign docs, supporting expanded scope for NPs/pharmacists, resistance to reasonable adjustments to awards and MBS rebates, and others which don’t come to mind immediately as I cradle my vomit-stained newborn.\n\nOur current strikes in NSW are just, safe, and reasonable. The messaging, however… is possibly “off.”\n\nASMOF’s campaign has a significant focus on how it’s hard to see a doctor due to our doctors migrating to other states. By highlighting a NSW doctor shortage in the public eye, we actually indirectly support the government’s messaging and master plan to use a (perceived or real) lack of doctor availability to justify scope creep and foreign doc importation.\n\nThe average person doesn’t really care how much we’re paid, at least not to the extent that they’ll part with extra taxes to support it. But they do care that doctors are available and motivated to do the job. If we spread a message about critical doctor shortages in NSW, the public’s preferred option will actually be the same as the government’s: import cheaper doctors and let NPs/pharmacists do more of our work. ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1jvhr97/concerns/",
    "id": "1jvhr97",
    "link_flair_text": "Opinion📣"
  },
  {
    "title": "Interesting/terrifying insight into what the pharmacy guild thinks “top of scope” pharmacist practice will look like",
    "author": "Xxjdueudbwjaowiwh",
    "score": 58,
    "num_comments": 65,
    "created_utc": 1744190751.0,
    "created_date": "2025-04-09 19:25:51",
    "selftext": "\nCurious to hear what the brains trust thinks this could mean for the next generation of GPs coming through and ultimately, what this will mean for patient outcomes in primary care??\n\n\n",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1jv1l8s/interestingterrifying_insight_into_what_the/",
    "id": "1jv1l8s",
    "link_flair_text": "serious🧐"
  },
  {
    "title": "Typical",
    "author": "Doctroyer",
    "score": 74,
    "num_comments": 30,
    "created_utc": 1744104221.0,
    "created_date": "2025-04-08 19:23:41",
    "selftext": "NSW Health at it again oppressing the public’s opinion with a silly excuse.\n\nFirst the Psychiatrists, now this.\n\nTypical lol\n\nThey know what sort of comments they’ll receive.\n\nIt’s also laughable that ASMOF’s comment on the Premier’s post regarding the Industrial Action has more reactions than the post itself.\n\nLet’s push on everybody. What we are doing is definitely working. Overwhelming support from the public. \n\n✊✊✊\n\n",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1ju9des/typical/",
    "id": "1ju9des",
    "link_flair_text": "Vent😤"
  },
  {
    "title": "Scope Creep Front and Centre of Australian Pharmacy Conference",
    "author": "Slow-Row-7087",
    "score": 51,
    "num_comments": 21,
    "created_utc": 1743829583.0,
    "created_date": "2025-04-05 16:06:23",
    "selftext": "They've got the IG influencer pharmacists spruiking the future at APP 2025... is it over? \n\nhttps://www.instagram.com/reel/DH-hmaypK6r\n\nEdit: grammar ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1jrvyzr/scope_creep_front_and_centre_of_australian/",
    "id": "1jrvyzr",
    "link_flair_text": "Opinion📣"
  },
  {
    "title": "What do clinical pharmacologists do?",
    "author": "AcrobaticBanana5898",
    "score": 30,
    "num_comments": 27,
    "created_utc": 1743223570.0,
    "created_date": "2025-03-29 15:46:10",
    "selftext": "Note: not talking about pharmacists, but clinical pharmacologists. \n\nWhat role do they play in the clinical setting? ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1jmeqpy/what_do_clinical_pharmacologists_do/",
    "id": "1jmeqpy",
    "link_flair_text": "other 🤔"
  },
  {
    "title": "You’re doing great! Don’t be so hard on yourself if you can’t remember every detail about every patient.",
    "author": "Odd_Apple_8488",
    "score": 59,
    "num_comments": 8,
    "created_utc": 1740540490.0,
    "created_date": "2025-02-26 14:28:10",
    "selftext": "I’m a pharmacist. I go on rounds, I talk to medical staff of all levels from PGY1 to consultants, from all specialties. \n\nI see doctors of all levels refer to a handover sheet or their written notes to give an update on their patients or to answer a question I, or the team I’m rounding with might have. \n\nI have NEVER known a colleague to make a negative comment on a fellow medical professional for having to refer to their notes. \n\n\nDon’t be so hard on yourself if you can’t remember all the details. Even those who are very experienced need to refer to notes at times. \n\nIt’s more important to provide the correct information. It doesn’t matter if you can recall it perfectly or if you need to refer to your notes. ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1iye4hq/youre_doing_great_dont_be_so_hard_on_yourself_if/",
    "id": "1iye4hq",
    "link_flair_text": "Support🎗️"
  },
  {
    "title": "Why the hate for Pharmacists?",
    "author": "Silly_Shoe_8303",
    "score": 28,
    "num_comments": 46,
    "created_utc": 1738841087.0,
    "created_date": "2025-02-06 22:24:47",
    "selftext": "Edit - Thank you all kind Doctors! This has made me realise we’re both in the same boat in what we disagree with in the pharmacy world. And imo you’re not marshmallows! But if you were you’d be the best marshmallows money can buy! \n\n\nWhy is it that a lot of this sub hates Pharmacists? I’m not looking for an argument I’m seeing if there is something we’re personally doing that makes the professional relationships worse, I’m personally a pharmacist and have fantastic relationships with all my local GPs. I no longer work in community pharmacy but am still registered I’ve never experienced a doctor who has hatred for us like in here. Feel like a lot of flack is passed to us when the guild or board makes shitty decisions we have no choice in. \n\n\nI have enormous respect for your profession as I wouldn’t have mine if it weren’t for you, and I do understand there’s a lot of pharmacists that do not practice in a safe manner but on the contrary my whole job was making sure people take your scripts safely and that you prescribe in an appropriate and safe manner. Just like how the government cut Medicare rebates for GPs which forced a lot to go solely private we also are getting fucked too, but it feels like it doesn’t matter 50% of our claiming was cut, we would of had no problem with 60dd if it was made and managed fairly but it wasn’t. If you fuck up it’s usually on us to catch it and if we don’t we’re the ones in trouble. Obviously there’s always going to be shit pharmacists like there’s shit doctors, but I feel like we’re very unfairly vilified for wanting fair wages and fair treatment as educated health professionals. Most pharmacists start out at 35ph and held at high standards while getting treated like we’re scammers and everything is our fault, we’re treated like we have no education or knowledge in the field while getting paid the same as a maccas night shift worker. \n\n\nSo please be kind, please don’t blame us personally for the shitty decisions that the board and guild make, just like you were incredibly overworked and underpaid. I really hope one day we can bridge this gap and fix the problems that are causing this division. \n\n- Love your friendly local pharmacist 🩵 ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1ij0d5y/why_the_hate_for_pharmacists/",
    "id": "1ij0d5y",
    "link_flair_text": "serious🧐"
  },
  {
    "title": "Noice",
    "author": "Astronomicology",
    "score": 58,
    "num_comments": 67,
    "created_utc": 1738130319.0,
    "created_date": "2025-01-29 16:58:39",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1icn7n2/noice/",
    "id": "1icn7n2",
    "link_flair_text": "WTF🤬"
  },
  {
    "title": "NSW Psych patients told to see their pharmacists /s",
    "author": "DoctorSpaceStuff",
    "score": 67,
    "num_comments": 20,
    "created_utc": 1737535494.0,
    "created_date": "2025-01-22 19:44:54",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1i76szj/nsw_psych_patients_told_to_see_their_pharmacists_s/",
    "id": "1i76szj",
    "link_flair_text": "Psych"
  },
  {
    "title": "WA Bulk-billing slump, one solution “expanded roles for nurses and pharmacists”",
    "author": "Hollowpoint20",
    "score": 30,
    "num_comments": 8,
    "created_utc": 1736737089.0,
    "created_date": "2025-01-13 13:58:09",
    "selftext": "Saw this in the West Australian today. Bulk-billing GP clinics down to about 1 per 46000 people in WA (down 20% since 2023). Australian Patients Association CEO Lisa Robbins says “we urgently need solutions like higher Medicare rebates, expanded roles for nurses and pharmacists, and innovative funding models for primary care.” \n\nHard agree with rebates (feels like kicking a dead horse though at this point), and improved funding models. But we already have pharmacists giving antibiotics for UTI’s, which already was a step too far. It doesn’t look like it will stop there. \n\nThe solution is not to cheaply employ more professionals without the qualification to undertake the task they are employed for. Nurses, Pharmacists and Doctors all provide a hugely necessary component of healthcare, but obviously the content and focus of their respective educations is vastly different. \n\nWA and Australia needs cheap healthcare, but not at the expense of quality. To the nurses and pharmacists reading, this is not intended to offend. You are invaluable members of the team, but we all are trained for different roles. If the role of nurses and pharmacists will broaden as proposed, I wonder what the cost to the government would be to up/re-skill these jobs to take on the pseudo-GP role that is being insinuated in this article. If it costs more, then why not save by increasing rebates instead and having GP’s be more accessible? If it’s cheaper, then I wonder what that says about the quality of such re-skilling programs. \n\nThere *are* re-skilling programs, aren’t there? We’re not just talking about changing their job description and carrying on like that? ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1i04cfg/wa_bulkbilling_slump_one_solution_expanded_roles/",
    "id": "1i04cfg",
    "link_flair_text": "General Practice "
  },
  {
    "title": "TIL that Accountant, Engineer and Dietician are not protected titles",
    "author": "Malifix",
    "score": 68,
    "num_comments": 52,
    "created_utc": 1736223743.0,
    "created_date": "2025-01-07 15:22:23",
    "selftext": "Today I learned that in Australia, titles like \"Accountant,\" \"Engineer,\" and \"Dietician\" are *not* legally protected. This means anyone can technically call themselves these titles without any formal qualifications, registration, or oversight.\n\nIt’s wild to think about the potential for confusion or even harm if unqualified individuals use these unregulated titles. It really emphasises the importance of checking someone’s credentials before hiring them for critical tasks.\n\nWith regard to dieticians, this one shook me. I always thought  any layman could call themselves 'nutritionists', whereas dieticians were protected titles as they require a masters degree. I previously thought that dieticians were protected under[ Accredited Practising Dietitians](https://member.dietitiansaustralia.org.au/registerofAPD), but this is not the case as they are a self-regulated profession-specific college.\n\n[This recent review](https://www.health.gov.au/resources/publications/unleashing-the-potential-of-our-health-workforce-scope-of-practice-review-final-report) is calling on those professions to be included into AHPRA to gain title protection. On page 32 you'll see 'Self-regulated professions are regulated by profession-specific colleges and associations and are not regulated under the NRAS. Their status as self-regulated professions means they do not have statutory title protection which is explained here: [protected titles](https://www.aph.gov.au/About_Parliament/Parliamentary_departments/Parliamentary_Library/Research/Quick_Guides/2023-24/Healthpractitionerregulation). Legally I can call myself a dietician without any degree relating to dietetics. Legally I cannot call myself a 'Chinese herbal dispenser' or I could be fined $60K or imprisoned for 3 years.\n\nHowever, you can have an NP call themselves a 'Medical Doctor', a 'Mental Health Specialist', a 'Doctor of Emergency Medicine' or a 'Medical Physician' without any legal consequence as according to the published [Protected titles in the National Law](https://www.ahpra.gov.au/About-Ahpra/What-We-Do/FAQ.aspx) and [List of Specialties](https://www.ahpra.gov.au/documents/default.aspx?record=WD10%2f106%5bv3%5d&amp;dbid=AP&amp;chksum=OU7zOxkohleqDQJe1bkVgQ%3d%3d). I personally think that's fucked. I believe this has to change and we should advocate for there being more protected titles for our field. I am aware that as doctors our only [protected titles](https://www.ahpra.gov.au/About-Ahpra/What-We-Do/FAQ.aspx) are 'medical practitioner', 'surgeon' and 'specialist' of a certain recognised specialty. The term 'specialist general practitioner' is a protected title as GPs are medical specialists, recognised under Section 115 of the [Health Practitioner Regulation National Law Act 2009](https://classic.austlii.edu.au/au/legis/nsw/consol_act/hprnl460/s115.html).\n\nIf we don’t act to protect our profession, we risk significant encroachment by midlevels, including nurse practitioners (NPs), pharmacists, and others, who may continue to blur the lines of expertise and patient care responsibility. It’s crucial that the public can clearly identify and trust those with the highest level of training and expertise. We must advocate for more protected titles within our field to safeguard the medical profession and ensure patient safety.\n\nThe government and relevant authorities must address these gaps in title protection to preserve public trust in healthcare and protect patients from potential harm caused by misrepresentation. If we don’t push for these changes, the integrity of our profession (and the quality of care we provide) will be at risk.\n\nEdit:\n\nThe only legislation which protects us somewhat is if a title is used in a way to mislead or deceive others, where you hope to obtain a benefit or other advantage, or improve your standing or credibility by making people believe you are something you are not. Then that may be an offence under Fair Trading Act (1987), although this is very subjective. But did that stop anyone?  We all saw what happened with 'cosmetic surgeons'. A protected title had to be introduced.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1hvj954/til_that_accountant_engineer_and_dietician_are/",
    "id": "1hvj954",
    "link_flair_text": "WTF"
  },
  {
    "title": "Mark Butler announces new five-year degree that will allow pharmacists to call themselves ‘doctor’",
    "author": "ameloblastomaaaaa",
    "score": 99,
    "num_comments": 148,
    "created_utc": 1732166049.0,
    "created_date": "2024-11-21 16:14:09",
    "selftext": "Pharmacists who complete a new extended master’s degree will have the right to call themselves ‘doctor’, Mark Butler has announced.\n\nThe federal Minister for Health and Aged Care was speaking this week at the Pharmacy Guild of Australia’s annual dinner at Parliament House in Canberra.\n\nIt follows the formal recognition of a Doctor of Pharmacy qualification, which — according to the guild — recognises the pharmacist’s extended scope of clinical practice, including prescribing and chronic disease management.\n\nIt has been described by the guild as the profession’s “highest possible qualification”, but it also means that pharmacists awarded the degree can introduce themselves to patients as ‘doctor’.\n\nUnlike ‘medical practitioner’, ‘doctor’ is not a protected title.\n\nMr Butler told the audience on Tuesday: “The Albanese Government is delivering on a commitment to pharmacists, who can now join other health professionals recognised with the title ‘doctor’ when they finish an extended master’s.\n\n“Opportunities to extend the education and scope of a pharmacists work will help attract and retain pharmacists in our workforce, which means more pharmacists, happier pharmacists.\n\n“Working in more places, providing more services and cheaper medicines to more Australians — this can only be a good thing.”\n\nThe five-year degree, which includes training in prescribing and chronic disease management, was developed by James Cook University.\n\nIts head of pharmacy, Associate Professor John Smithson, described it as a “logical and necessary step forward” that would “enhance public trust in pharmacists as accessible, capable healthcare providers”.\n\nDespite ‘doctor’ not being a protected title, AHPRA’s website cautions against its use in advertising because of its “historical association” with being a medical practitioner. \n\nPractitioners advertising themselves as a ‘doctor’ should include the related health profession in brackets, according to its FAQs.\n\n  \n[https://www.ausdoc.com.au/news/new-degree-will-let-pharmacists-call-themselves-doctor/](https://www.ausdoc.com.au/news/new-degree-will-let-pharmacists-call-themselves-doctor/)",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1gw8pl6/mark_butler_announces_new_fiveyear_degree_that/",
    "id": "1gw8pl6",
    "link_flair_text": "News"
  },
  {
    "title": "“ASMOF needs to do better”? Then cough up. ",
    "author": "Fit_Regular9763",
    "score": 145,
    "num_comments": 37,
    "created_utc": 1732078694.0,
    "created_date": "2024-11-20 15:58:14",
    "selftext": "“ASMOF needs to do better”? Then cough up.\n\nA lot of chat on this form and others about how ASMOFs communication has been poor, has maybe pivoted away from key JMO priorities (like pay) and generally “needs to do better”. \n\nWell then, my colleagues, you need to put your big boy/girl scrubs and actually pay your union membership fees.\nThousands of (largely) JMOs have joined ASMOF in recent weeks taking advantage of the no membership fee promotion. That’s great for collective bargaining power, but it doesn’t help for anything else. In fact, it probably makes most other things more difficult for your union as they have more members demanding personal interventions / reviews / letters / advice without paying for extra staffing or resources. \n\nBasically, if you want your union to be effective, powerful, speedy and ultimately to achieve your goals, you need to pay your fees. Stop complaining that ASMOFs communication is poor if you also don’t give them a dime. \n\nThis is the year guys. I cannot emphasise this enough. If you want your career to not be progressively worn away by shit pay, overseas imports, nurse practitioners, pharmacists and PAs, then, for crying out loud, join your union AND give them some ammo in the chamber ($$$). Treat your ASMOF fees as part of the cost of being a doctor. It’s tax deductible too. \n",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1gvhvk2/asmof_needs_to_do_better_then_cough_up/",
    "id": "1gvhvk2",
    "link_flair_text": "Opinion"
  },
  {
    "title": "Pharmacy Guild Dinner announcement with health and shadow health minister - pharmacists to be trained to the level of GP and called Drs",
    "author": "Signal-Kale-9273",
    "score": 183,
    "num_comments": 107,
    "created_utc": 1732061741.0,
    "created_date": "2024-11-20 11:15:41",
    "selftext": " There was an announcement at the pharmacy guild dinner by Trent that pharmacists will be called doctors and trained to the level of a GP. Health minister Mark Butler confirmed it and shadow health minister senator Anne Ruston congratulated the whole room for becoming doctors. (Repost from a gp fb group)\n\n\nI believe Australia is headed for a two tiered health system. The public and politicians seem to have no idea the difference in education and training. I really wish GPs/ racgp could black list politicians and their families to only receiving Noctor care in the future.\nThe system is reactive rather than proactive.Maybe when the fatalities start to ramp up 10 years from now and there is public outrage will there be a senate enquiry.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1gvcbta/pharmacy_guild_dinner_announcement_with_health/",
    "id": "1gvcbta",
    "link_flair_text": "General Practice "
  },
  {
    "title": "Primary care: non-fellowed doctors OR nurses, pharmacists and allied health",
    "author": "TheProteinSnack",
    "score": 28,
    "num_comments": 49,
    "created_utc": 1730801967.0,
    "created_date": "2024-11-05 21:19:27",
    "selftext": "I have a contentious topic/question I want to hear everyone's thoughts on. What do you think about non-fellowed doctors with general registration providing primary care, in comparison to nurses, pharmacists and allied health doing so?\n\nThere still are GPs today who are not a FRACGP because they acquired their unrestricted Medicare provider number with general registration before 1996. The arguments against having nurses, pharmacists and allied health clinicians do primary care is the lack of skills in diagnosing, considering differentials, judicious investigation, and discernment in referring on – these are things that we often say even junior doctors do better. As part of trying to minimize harm to patients, should non-fellowed doctors be preferred in primary care over expanding the scope of practice of non-medical healthcare professionals?\n\nWe all already know that the ideal is that General Practice is better funded so that improvements in access to primary care comes from having more fellowed GPs – that's not what this question is about.\n\nEdit to add disclosure that I have no conflict of interest because I'm in psych and will never do primary care.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1gk3j9g/primary_care_nonfellowed_doctors_or_nurses/",
    "id": "1gk3j9g",
    "link_flair_text": "General Practice "
  },
  {
    "title": "Unleashing the Potential of Our Health Workforce Report",
    "author": "happygoluckyscamp",
    "score": 39,
    "num_comments": 18,
    "created_utc": 1730782390.0,
    "created_date": "2024-11-05 15:53:10",
    "selftext": "https://www.health.gov.au/resources/publications/unleashing-the-potential-of-our-health-workforce-scope-of-practice-review-final-report\n\nRecommendations include nurses, allied health professionals and pharmacists should be able to lead clinics, refer patients and manage certain treatments.\n\nMentions of conflicts of interest for pharmacists, 0.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1gjz0f0/unleashing_the_potential_of_our_health_workforce/",
    "id": "1gjz0f0",
    "link_flair_text": "News"
  },
  {
    "title": "Hospital Uniform - Allocated scrub colours",
    "author": "ClayGrownTall",
    "score": 4,
    "num_comments": 5,
    "created_utc": 1730541514.0,
    "created_date": "2024-11-02 20:58:34",
    "selftext": "Would be interesting to see some numbers on opinions on this topic. \n\nRecent post on hospital policy on having dedicated scrub colours for different roles: e.g. navy blue for nurses/midwives, light blue for junior medical staff, black for consultants... pharmacists, allied health etc.\n\nIf your hospital doesn't have a policy would you support one being introduced?\n\nIf your hospital already has a policy in place, do you think the concept works?\n\nObviously there's no way to keep it just doctors voting but would be interested to hear in the comments if the nurses/ midwives/ pharmacists/ allied health in the sub have different perspectives. \n\n[View Poll](https://www.reddit.com/poll/1ght2od)",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1ght2od/hospital_uniform_allocated_scrub_colours/",
    "id": "1ght2od",
    "link_flair_text": "other "
  },
  {
    "title": "Pharmacists have performed just 415 consults in Queensland’s prescribing trial, but what they are doing exactly remains a mystery",
    "author": "jps848384",
    "score": 56,
    "num_comments": 18,
    "created_utc": 1729896043.0,
    "created_date": "2024-10-26 09:40:43",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1gc6sv6/pharmacists_have_performed_just_415_consults_in/",
    "id": "1gc6sv6",
    "link_flair_text": "News"
  },
  {
    "title": "i don't want to be a doctor, what are my options?",
    "author": "silverraen",
    "score": 42,
    "num_comments": 100,
    "created_utc": 1728132345.0,
    "created_date": "2024-10-05 22:45:45",
    "selftext": "tldr: 20YO 2nd year med student with a biomedical science degree. As of now I am a part-time pharmacy assistant. Been warned by many not to go into pharmacy. ould like to take a gap year.\n\nI doubting whether I should be a doctor anymore because I know I will struggle a lot under the stress, and I'm afraid of putting my patient's lives at risk. I'm a chronic insomniac and get burnt out easily. On top of that, I'm super forgetful/ can't focus and have trouble multitasking, so there's definitely a competency issue here. Besides, I just don't think that all the hard work, effort and financial burden is worth it for me. The main reason I even accepted the med school offer tbh was due to parental pressure.\n\nI have been doing a three-trimester/year course since graduating highschool. All I do is study and work and I just wish I was more well-rounded with more real-world experience, which I am clearly lacking. I've just been so focused on getting into med school that I've missed the forest for the trees and my vision/ goals for myself have changed a lot since then.\n\nWas thinking of doing a 2-year master's degree in pharmacy after my gap year at Griffith University as an option. However, I've been told that pharmacists get paid very little for their knowledge and get taken advantage by giants like chemist warehouse.\n\nDon't really have any profound passions that directly align with a field of work, and largely see work as a means to pay off bills and would like enough work-life balance to pursue my hobbies (reading, cooking, painting, hiking etc). I do enjoy learning about the pathophysiology in medicine, but I just don't think the fast-paced work environment in a hospital is for me.\n\nDon't mind doing a regular 9-5 office job either. Maybe get into commerce or cybersecurity. I did do coding in high school and was alright at it, but again, due to lack of life experience, I have no idea if I would be particularly good at it. I just want a job that I don't hate and pays the bills lol.\n\nTo make matters complicated, my asian parents are very unsupportive of this idea (gap year) and want me to toughen up and finish the degree (another 3years) and then decide because at least the degree will be useful. I've also used up my FEE-HELP by the end of this year; they said they will not support me financially going forward (if i take the gap year). The good thing is I'm already renting an apartment, but I will need to take out a car loan (or rely on public transport). Anyways, I'd love to hear some suggestions on what to consider exploring next year. I would LOVE to travel but will definitely need to save up a lot for that haha\n\nThanks!",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1fwpkul/i_dont_want_to_be_a_doctor_what_are_my_options/",
    "id": "1fwpkul",
    "link_flair_text": "Support "
  },
  {
    "title": "Hospital pharmacist here what do you guys actually think of us? ",
    "author": "Forward-Dark-2498",
    "score": 47,
    "num_comments": 77,
    "created_utc": 1728040040.0,
    "created_date": "2024-10-04 21:07:20",
    "selftext": "No wrong answers just curious to know how doctors view us in general. I’ve found most of you love our trusty purple pens but some realllllyyy do not. Keen to know why and what we can do better! ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1fvwiyt/hospital_pharmacist_here_what_do_you_guys/",
    "id": "1fvwiyt",
    "link_flair_text": "Support "
  },
  {
    "title": "What a weird job we have",
    "author": "DunLorDen_21",
    "score": 202,
    "num_comments": 28,
    "created_utc": 1728037215.0,
    "created_date": "2024-10-04 20:20:15",
    "selftext": "Today I went from mindlessly recording a ward round, to helping get a STEMI from resus to cath lab, to mindlessly redoing discharge prescriptions at the request of excellent pharmacists, to responding to a query seizure, to mindlessly copying scans onto CDs, to one handedly holding onto the cigarettes a patient half my weight was trying with all their might to bring into the bathroom.\n\nAlways strikes me as funny how miscellaneous the roles of a junior are. Looking forward to advancing. ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1fvvt2c/what_a_weird_job_we_have/",
    "id": "1fvvt2c",
    "link_flair_text": "Life"
  },
  {
    "title": "Twomey (PGA) on pharmacists extending scope to contraception, respiratory conditions, cardiovascular conditions... and more.",
    "author": "littlepeaflea",
    "score": 33,
    "num_comments": 17,
    "created_utc": 1727321229.0,
    "created_date": "2024-09-26 13:27:09",
    "selftext": "[https://www.heraldsun.com.au/health/about-40-per-cent-of-aussies-waiting-more-than-three-weeks-to-see-a-gp/news-story/1deb678fdde5b3aaf13e4d10e944ad57](https://www.heraldsun.com.au/health/about-40-per-cent-of-aussies-waiting-more-than-three-weeks-to-see-a-gp/news-story/1deb678fdde5b3aaf13e4d10e944ad57)\n\nMr Twomey said pharmacists would soon be able to treat patients for things like contraception, respiratory conditions, urinary tract infections, vaccines, cardiovascular conditions, wounds, gastro, pain and more.''",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1fpn006/twomey_pga_on_pharmacists_extending_scope_to/",
    "id": "1fpn006",
    "link_flair_text": "WTF"
  },
  {
    "title": "Noctors march ever onwards: NSW pharmacists' scope to be expanded",
    "author": "bewilderedfroggy",
    "score": 90,
    "num_comments": 62,
    "created_utc": 1726436364.0,
    "created_date": "2024-09-16 07:39:24",
    "selftext": "From AMA Insight+ this morning:\nThe NSW Government move to broaden the scope of practice of pharmacists has angered GPs.\n\nA NSW Government plan to broaden the abilities of pharmacists to treat a range of conditions from ear infections to joint pain has been labelled as “reckless”.\n\nThe plan, according to the state government is designed to alleviate pressure on GPs, but it has angered them instead.\n\nThe state’s Health Minister Ryan Park announced that pharmacists’ scope of practice will be extended to include:\n\n- acute otitis media (middle ear infection);\n- acute otitis externa (outer ear infection);\n- acute minor wound management;\n- acute nausea and vomiting;\n- gastro-oesophageal reflux and -gastro-oesophageal reflux disease (GORD);\n-mild to moderate acne; and\n- mild, acute musculoskeletal pain\n\nJourney towards an unfair system\n\n“NSW is on a trajectory towards a two-tier health care system in which those who can afford GP care can see it, while everyone else will have to settle for ‘cheaper’ services at a retail pharmacy,” Dr Hoffman said.\n\n“There is no substitute for the quality care you get from a GP who knows you and your history. I invite the NSW Premier and Health Minister Park to meet with GPs and learn about what we do for our patients across the state every day, and what high quality primary care actually involves,” she said.\n\nThe increased scope of practice is the expansion of trials that began with pharmacists being able to resupply the oral contraceptive pill. The second phase saw pharmacists provide more than 18 000 consultations for uncomplicated urinary tract infections. The third and final phase will see pharmacists able to manage common minor skin conditions and is underway.\n\nThe RACGP also cautioned that current trials have not reached completion and the decision to make the announcement at a Pharmacy Guild conference in Sydney early in September was a political one.\n\nThe RACGP also said there was no collaborative discussion prior to the announcement being made at the conferencastro-oesophageal reflux and gastro-oesophageal reflux disease (GORD);\nmild to moderate acne; and\nmild, acute musculoskeletal pain.\nHe said barriers to seeing a GP and long waiting lists led to the Minister making the call.\nDoctors are anything but relieved by the move\n\nThe Royal Australian College of General Practitioners (RACGP) is angry about the announcement and says it is reckless, poses health risks and puts politics before patient safety.\n\n“This is politically driven policy, and it has potentially devastating consequences for people across New South Wales due to the risks of incorrect treatment and serious illnesses being missed,” RACGP NSW Chair Dr Rebekah Hoffman said.\n\n“If you get a diagnosis wrong, the consequences can be devastating. There are significant risks of serious and even life-threatening illnesses being missed with the conditions the NSW Government wants to allow pharmacists to treat”, Dr Hoffman said. \n\n“The NSW Government is kidding itself if it thinks this move will do anything to reduce pressure on the state’s overflowing hospitals. If anything, it will have the opposite effect,” Dr Hoffman said.\n\nOverseas experiment problematic\n\n“We know from the UK that letting non-medically trained health professionals do the work of GPs results in much higher rates of incorrect treatment, delayed diagnosis and serious illnesses being missed,” Dr Hoffman said.\n\n“It costs governments and patients much more because people often need to go back to the doctor and can end up in hospital when they don’t get the right treatment,” she said.\n\nProposed training will be “inadequate”\n\nNSW Health said it is consulting with universities on the development of suitable training as well as the Pharmaceutical Society of Australia on request supports for pharmacists including:\n\ncondition-specific training; and\nupskilling in clinical assessment, diagnosis, management and clinical documentation.\nThe RACGP said this training oversimplifies the expertise of general practitioners.\n\n“What Health Minister Ryan Park clearly doesn’t understand is patients come in with symptoms, not a diagnosis. Diagnosis is complex and requires years of training — GPs train for over 10 years. You can’t squeeze this training into a short course for pharmacists and expect good health outcomes,” Dr Hoffman said.\n\n“For example, nausea can be a symptom of stroke or neurological disorder. Ear infections are also hard to diagnose and the consequences of misdiagnosis in children can be very severe, it can result in abscess or a ruptured eardrum. And someone presenting with reflux and chest pain might not just have reflux, it can mean cardiac problems or heart attack,” she said.\nJourney towards an unfair system\n\n“NSW is on a trajectory towards a two-tier health care system in which those who can afford GP care can see it, while everyone else will have to settle for ‘cheaper’ services at a retail pharmacy,” Dr Hoffman said.\n\n“There is no substitute for the quality care you get from a GP who knows you and your history. I invite the NSW Premier and Health Minister Park to meet with GPs and learn about what we do for our patients across the state every day, and what high quality primary care actually involves,” she said.\n\nThe increased scope of practice is the expansion of trials that began with pharmacists being able to resupply the oral contraceptive pill. The second phase saw pharmacists provide more than 18 000 consultations for uncomplicated urinary tract infections. The third and final phase will see pharmacists able to manage common minor skin conditions and is underway.\n\nThe RACGP also cautioned that current trials have not reached completion and the decision to make the announcement at a Pharmacy Guild conference in Sydney early in September was a political one.\n\nThe RACGP also said there was no collaborative discussion prior to the announcement being made at the conferenc\n\n“We know that it is becoming more difficult to access a GP than ever before, with people often waiting days or even weeks before they can find an appointment,” Minister Park said.\n\n“People should be able to access treatment as and when they need it, and the expansion of this important initiative will improve access to care,” he explained.\n\n“By empowering pharmacists to undertake consultations on more conditions, we can relieve the pressure on GPs and end the wait times,” Minister Park said.\n\n",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1fhnzil/noctors_march_ever_onwards_nsw_pharmacists_scope/",
    "id": "1fhnzil",
    "link_flair_text": "General Practice "
  },
  {
    "title": "Pharmacist who founded telehealth cannabis business banned from dispensing cannabis",
    "author": "jps848384",
    "score": 55,
    "num_comments": 11,
    "created_utc": 1725533822.0,
    "created_date": "2024-09-05 20:57:02",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1f9jje3/pharmacist_who_founded_telehealth_cannabis/",
    "id": "1f9jje3",
    "link_flair_text": "News"
  },
  {
    "title": "The first prescribing pharmacist of australia",
    "author": "jps848384",
    "score": 29,
    "num_comments": 56,
    "created_utc": 1725270016.0,
    "created_date": "2024-09-02 19:40:16",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1f72pp8/the_first_prescribing_pharmacist_of_australia/",
    "id": "1f72pp8",
    "link_flair_text": "other "
  },
  {
    "title": "Full prescribing right for pharmacists?",
    "author": "ameloblastomaaaaa",
    "score": 70,
    "num_comments": 54,
    "created_utc": 1723176583.0,
    "created_date": "2024-08-09 14:09:43",
    "selftext": "What??",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1enqefp/full_prescribing_right_for_pharmacists/",
    "id": "1enqefp",
    "link_flair_text": "WTF"
  },
  {
    "title": "What will be the first job in healthcare to be replaced by AI?",
    "author": "everendingly",
    "score": 29,
    "num_comments": 44,
    "created_utc": 1721860763.0,
    "created_date": "2024-07-25 08:39:23",
    "selftext": "Despite y'all saying Radiology, IMO it's pharmacy. No disrespect to our wonderful colleagues but with a good electronic medical record integrated with pathology eg. micro results, surely it would be faster, safer, able to respond quickly to local trends in organism sensitivities, drop in Hb or platelets etc. \n\nOur electronic systems already do this to a degree with interaction and allergy checking. \n\nThe computing power would be minimal compared to that requried for say radiology or dermatology. A long series of if-then statements, essentially. \n\nPatients could be automatically sent videos eg. how to take your clexane or inhaler, things to know about warfarin, to replace the counselling aspect. \n\nEx-pharmacists please tell me why I'm wrong. \n\nAlso what other jobs are potentially replaceable?",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1ebetma/what_will_be_the_first_job_in_healthcare_to_be/",
    "id": "1ebetma",
    "link_flair_text": "Tech"
  },
  {
    "title": "Your local pharmacist - now an expert in undifferentiated headaches ",
    "author": "Student_Fire",
    "score": 91,
    "num_comments": 39,
    "created_utc": 1721777846.0,
    "created_date": "2024-07-24 09:37:26",
    "selftext": "I say good luck to the pharmacist managing undifferentiated headaches and abdominal pain in both children and adults. Hopefully, their differentials extend further than tension headaches. ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1eamp5z/your_local_pharmacist_now_an_expert_in/",
    "id": "1eamp5z",
    "link_flair_text": "Vent"
  },
  {
    "title": "Medicine is responsible for the rise of noctors",
    "author": "maynardw21",
    "score": 245,
    "num_comments": 136,
    "created_utc": 1721264071.0,
    "created_date": "2024-07-18 10:54:31",
    "selftext": "Inflammatory title, but honest opinion. The rise of noctors overseas and in Australia is the direct result of the failures of the institutions of medicine to a) train enough doctors and b) provide pathways for experienced clinicians. \n\nThe ubiquitous advice for wannabe NPs or PAs on this sub is if you want to practice medicine, go to medical school. The issue is, going to medical school is simply not an option for many people that are already towards the middle of their career. Medical school is mandatory full-time, is difficult/impossible to take short term leave, and does not recognise prior knowledge/experience. And when you graduate you will end up getting paid less than what you were on previously. \n\nI know many nurses, pharmacists, and paramedics that are incredibly experienced and committed. They would love to study medicine, and they would make great doctors. They simply cannot go 4 years without a full-time income. Instead of them my medical cohort is full of (mostly) young, rich, and socially supported people straight from high-school or at the start of their different profession.\n\nWe can all see the problems with the rise of alternative practitioners, mostly the differing levels of training, certification, and ongoing governance between them and doctors. Why then does Medicine (as an institution/profression) not provide pathways for them to become actual doctors so they have to pass the same exams, same training requirements, and be subject to the same level of scrutiny? Is it the old \"I suffered through med school so you should too?\" or just simply elitism at the idea of a nurse taking your job?",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1e5yl62/medicine_is_responsible_for_the_rise_of_noctors/",
    "id": "1e5yl62",
    "link_flair_text": "Opinion"
  },
  {
    "title": "Politicians once again showing their unbiased approach to patient safety",
    "author": "DoctorSpaceStuff",
    "score": 143,
    "num_comments": 87,
    "created_utc": 1720563832.0,
    "created_date": "2024-07-10 08:23:52",
    "selftext": "Between the pharmacy guild and big pharma, money has been pouring in for lawmakers. Tell me you've got an anti-GP agenda, without telling me you've got an anti-GP agenda...\n\n(Figures on donations:https://www.medicalrepublic.com.au/who-benefited-from-pharmacy-guilds-deep-pockets/104766)",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1dzffox/politicians_once_again_showing_their_unbiased/",
    "id": "1dzffox",
    "link_flair_text": "News"
  },
  {
    "title": "GPs seen as third most ethical occupation in healthcare sector after nurses and pharmacists.",
    "author": "hoagoh",
    "score": 64,
    "num_comments": 35,
    "created_utc": 1719630755.0,
    "created_date": "2024-06-29 13:12:35",
    "selftext": "https://governanceinstitute.com.au/app/uploads/2023/11/2023-ethics-index-report.pdf\n\nFirst: Pharmacy\nSecond: Nurses\nThird: General Practitioners\n\nWeirdly enough AMA is the second member association after Choice.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1dr1oef/gps_seen_as_third_most_ethical_occupation_in/",
    "id": "1dr1oef",
    "link_flair_text": "News"
  },
  {
    "title": "Summary of Recent Policy Direction - Mid-level Scope Creep",
    "author": "ExpressGeologist8047",
    "score": 53,
    "num_comments": 2,
    "created_utc": 1718882752.0,
    "created_date": "2024-06-20 21:25:52",
    "selftext": "There has been a lot of talk recently about the shift in policy within the government to move towards a mid-level model of care. Many posts have rightfully outlined the negative impacts of such a direction on doctors and more the public more. The recent federal budget has provided significant funding for NPs and as we all know the Collaborative Arrangement was formally scrapped in Parliament only a few weeks ago. Nurse practitioners can now provide MBS services and prescribe PBS medications independently.\n\n**Australia’s Primary Health Care 10 Year Plan 2022-2032**\n\nThis is where the current direction in policy stems from. Notably section 3.17 which runs through ‘*Workforce Strategies*’.  Of note from this Strategy: \n\n* A Steering Group in 2019 recommended that ‘*\\[b\\]etter use could be made of the primary health care workforce, including nurses and nurse practitioners, allied health professionals and pharmacists, in working to full scope of practice*.’ At this stage, doctors were still party to the discussions with general practice representation.\n\nThis led to the ‘*Strengthening the Medicare Taskforce*’ project. This was actually largely GP-led and had some unfortunate recommendations. Notably, in Section 2: \n\n*  ‘*High quality primary care delivery depends more and more on health care teams – harnessing the full strengths and skills of the diverse health workforce, including GPs, nurses, nurse practitioners and midwives, pharmacists, allied health professionals. Funding and regulatory arrangements should support all parts of the primary care workforce to work to their full scope of practice and to collaborate across the health and other care systems*’\n*  It goes on to provide a list of recommendations which included working with *‘states and territories to review barriers … for all professionals to work to their full scope of practice*’.\n\nFollowing this there was establishment of the Collaborative Arrangements 2023 Project, which was developed to *‘remove barriers to care provided by nurse practitioners … in rural and remote areas’ and to provide NPs/midwives with ‘more autonomy in their scope of practice*’\n\n*  This was purely nurse-led, with stakeholders involved being the Australian College of Nurse Practitioners, Australian College of Midwives, Nursing and Midwifery Board of Australia etc. \n   * I’m sure we can all appreciate the irony of nurses voting to join our profession without us being party to the decision.\n\nThis group also conducted an independent review into collaborative arrangements which had some interesting findings:\n\n*  *‘Negative impacts included Medical Practitioners perceived responsibility for oversight of the Nurse Practitioner … increased liability and Medical Practitioners being involved in the provision of care but not being paid.*’  Is their responsibility only ‘perceived’? \n   * Because in the UK doctors are directly liable for the mistakes of PAs for example (for misdiagnosis, and incorrect prescribing)\n* *‘The literature revealed that collaborative arrangement practices inhibit Nurse Practitioners or Participating Midwives from being able to develop or establish their own private practice.*’ \n   * So is this being pushed through to allow NPs to set up private practices in the cities or to fill gaps in the rural workforce? Interestingly there is a very strong focus on limitations of care in rural settings but the collaborative arrangement was scrapped in all contexts.\n\n**TLDR:** These changes have been brewing for several years. There are lots of concerning findings in these publications (all of which are freely available) - unfortunately there was initially GP support for these changes at least in some capacity. Do we need better representation in stakeholder meetings for policy direction? Or would they simply shit on us anyway? ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1dk99ji/summary_of_recent_policy_direction_midlevel_scope/",
    "id": "1dk99ji",
    "link_flair_text": "Serious"
  },
  {
    "title": "Fed Govt to hand pharmacists $2 billion in compensation for 60-day dispensing",
    "author": "ameloblastomaaaaa",
    "score": 34,
    "num_comments": 28,
    "created_utc": 1717907320.0,
    "created_date": "2024-06-09 14:28:40",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1dbld7g/fed_govt_to_hand_pharmacists_2_billion_in/",
    "id": "1dbld7g",
    "link_flair_text": "News"
  },
  {
    "title": "Dentists, whats your secret for fending off scope creep?",
    "author": "jps848384",
    "score": 7,
    "num_comments": 33,
    "created_utc": 1716819953.0,
    "created_date": "2024-05-28 00:25:53",
    "selftext": "NPs, pharmacist prescribers, podiatric surgeons, chiros, reflexiologist to naturopaths. Noctors wanna be doctors.\n\nBut NO BODY wants to be a dentist except dentists? (Well, may be OHTs). What is your secret sauce?\n\n\n\n",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1d1sqij/dentists_whats_your_secret_for_fending_off_scope/",
    "id": "1d1sqij",
    "link_flair_text": "Vent"
  },
  {
    "title": "Pharmacists to review their own professional titles after being accused of misleading patients",
    "author": "jps848384",
    "score": 89,
    "num_comments": 34,
    "created_utc": 1715992353.0,
    "created_date": "2024-05-18 10:32:33",
    "selftext": "A pharmacy group will review its guidelines for pharmacists calling themselves registrars, residents and consultants after the AMA alleged that some patients had been misled.\n\nThe recently-launched Australian and New Zealand College of Advanced Pharmacy (ANZCAP) grants pharmacists these titles based on their pre-existing training and experience as part of its ‘foundation program’.\n\nFor example, pharmacists with over eight years’ general experience and three years’ experience in a specialty area can apply for recognition as ‘consultants’ and to use the postnominal ‘FANZCAP’.\n\nMore than 1600 pharmacists have been recognised so far, says the Society of Hospital Pharmacists of Australia (SHPA), which jointly set up the college in October 2023.\n\nBut the AMA said last week it had raised concerns with the pharmacy group over “the use of misleading titles by some hospital pharmacists … which may have confused patients”.\n\nWhen asked by *AusDoc*, the AMA did not elaborate further.\n\nA spokesperson for SHPA said it had been “unable to independently verify the misuse” of the terms.\n\nHowever, they said the ANZCAP certificates of recognition (see below) would be revised so that ‘pharmacy’ or ‘pharmacist’ was “more prominently displayed.”\n\n“In the interests of clarity and safety for health professionals and patients, SHPA has committed to an immediate review of ANZCAP guidelines around the use of terminology,” they added.\n\nSeparately, another pharmacy group has joined the AMA and [a former RACGP president](https://www.ausdoc.com.au/news/pharmacists-muddying-the-waters-by-using-resident-and-registrar-titles-doctors-claim/) in voicing concern over pharmacists’ use of consultant or registrar titles.\n\n*ANZCAP’s template certificate of recognition.*\n\nThe Victorian Directors of Pharmacy Group, which represents public hospital pharmacy directors, said in a statement it did not support pharmacists using the titles consultant or registrar at work.\n\n“The use of the titles will be confusing to patients, the public and other health professionals and may not appropriately represent the expertise of the individual pharmacist,” it said.\n\nIt also called the ANZCAP assessment program, which costs pharmacists up to $595, an “expedited process through submission of letters of support and \\[a\\] CV without … evidence of level of practice”.\n\n“The ANZCAP recognition is based primarily on length of time in practice and does not include a robust independent process of assessment of the individual’s level of practice,” it said. \n\nThe ANZCAP recognition is not recognised by the Pharmacy Board of Australia or the Australian Pharmacy Council.\n\n  \n[https://www.ausdoc.com.au/news/doctors-concern-over-pharmacists-using-registrar-resident-and-consultant-titles-sparks-review/](https://www.ausdoc.com.au/news/doctors-concern-over-pharmacists-using-registrar-resident-and-consultant-titles-sparks-review/)",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1cukrnp/pharmacists_to_review_their_own_professional/",
    "id": "1cukrnp",
    "link_flair_text": "News"
  },
  {
    "title": "Pharmacy Prescribing Dangerous Petition",
    "author": "BoardUnlucky8600",
    "score": 39,
    "num_comments": 32,
    "created_utc": 1715518126.0,
    "created_date": "2024-05-12 22:48:46",
    "selftext": "Hi friends,\n\nIf you have concerns about the changes being made with regards to pharmacy prescribing in Australia give this petition a read. Please support and share if you feel this policy will endanger patient care.\n\nhttps://www.change.org/p/pharmacist-prescribing-will-kill-people\n\nAlso read and support the 'you deserve more' Campaign by the AMA. \nhttps://www.ama.com.au/you-deserve-more\n\nMuch Appreciated 💊🩺🧘‍♀️",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1cq74gd/pharmacy_prescribing_dangerous_petition/",
    "id": "1cq74gd",
    "link_flair_text": "Serious"
  },
  {
    "title": "Here’s why GP premiums may rise as pharmacists and allied health expand their practice scope\n",
    "author": "hustling_Ninja",
    "score": 35,
    "num_comments": 30,
    "created_utc": 1715388650.0,
    "created_date": "2024-05-11 10:50:50",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1cp548q/heres_why_gp_premiums_may_rise_as_pharmacists_and/",
    "id": "1cp548q",
    "link_flair_text": "News"
  },
  {
    "title": "‘These are good, caring clinicians’: Why this GP is training pharmacists for the Qld pharmacy pilot",
    "author": "hustling_Ninja",
    "score": 3,
    "num_comments": 9,
    "created_utc": 1714376929.0,
    "created_date": "2024-04-29 17:48:49",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1cfte2h/these_are_good_caring_clinicians_why_this_gp_is/",
    "id": "1cfte2h",
    "link_flair_text": "General Practice "
  },
  {
    "title": "Niche Specialties",
    "author": "Familiar-Reason-4734",
    "score": 19,
    "num_comments": 4,
    "created_utc": 1713961005.0,
    "created_date": "2024-04-24 22:16:45",
    "selftext": "Please excuse my ignorance as “just a GP”. \n\nThroughout my medical career, I have heard of but never had the pleasure of working with or have directly referred patients to or consulted with the following specialty fields in medicine:\n\n- Clinical Pharmacology (how is this different to seeking the expertise opinion of a pharmacist or pharmacologist or toxicologist?) \n\n- Community Child Health (how is this significantly different from the scope of a general paediatrician, and are they limited to practising in the community outpatient setting and child protection units?)\n\nCould someone with more recency with and awareness of the RACP and its various niche subspecialty tracks please shed some light on these fields and any insights from those practising in these fields on what type of patients are referred to these specialist medical practitioners? \n\nMany thanks in advance!",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1cbwnzz/niche_specialties/",
    "id": "1cbwnzz",
    "link_flair_text": "General Practice "
  },
  {
    "title": "New pharmacy college with resident, registrar, and consultant titles",
    "author": "hoagoh",
    "score": 72,
    "num_comments": 38,
    "created_utc": 1713659939.0,
    "created_date": "2024-04-21 10:38:59",
    "selftext": "Pharmacy are making a college (ANZCAP) that will function to train pharmacists in prescribing etc.\n\nTitles are a little brazen. They will have residents, registrars, and consultants. They’ll also have specialist titles. The example on the site is “ANZCAP-Reg. (Generalist, ObsGynae)”.\n\nhttps://shpa.org.au/ANZCAP/faqs\n\nHey switch can you put me through to the obsgyn reg?",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1c9549c/new_pharmacy_college_with_resident_registrar_and/",
    "id": "1c9549c",
    "link_flair_text": "News"
  },
  {
    "title": "Doctors fear Medicare reforms could ‘reproduce failures’ of UK health system",
    "author": "AussieFIdoc",
    "score": 100,
    "num_comments": 35,
    "created_utc": 1712954315.0,
    "created_date": "2024-04-13 06:38:35",
    "selftext": "Doctors fear Australia could follow the path of the United Kingdom’s struggling health system as the federal government probes changes that would give pharmacists, nurses and other health professionals more authority to prescribe medicines or refer patients to specialists.\n\nHealth Minister Mark Butler will later this year receive the recommendations of a review that is considering ways to cut red tape so that non-medical health workers – which also include midwives, physiotherapists and paramedics – can do more in a primary care system that relies heavily on general practitioners.\n\nDoctors are pushing back against proposals to give more powers to other health professionals.\nDoctors are pushing back against proposals to give more powers to other health professionals.CREDIT: GETTY\nAn interim paper from the review highlighted the Canadian and UK health systems as useful examples, as it suggested professionals other than doctors could have expanded prescribing and referral powers – a move it said would reduce reliance on GPs, improve accessibility for patients and make the system more efficient.\n\nBut doctors are pushing back against those proposals, in an early sign of the strong resistance Butler will face if he tries to enact changes that dilute the power of the medical profession as part of his reforms to Medicare.\n\nRoyal Australian College of GPs president Dr Nicole Higgins said her members were “very concerned the current review appears to be giving serious consideration to a model of care that would reproduce the failures of the UK health system”.\n\nLoading\n“Rather than investing in general practice, the UK model fragmented the system, pushing the work of GPs onto health professionals without medical training ... This is not an efficient use of a health workforce and limited health resources,” Higgins said.\n\n“And it has been frankly disastrous, with worse health outcomes, unhappy patients, and GPs fleeing – the number of UK-trained doctors in Australia increased a staggering 67 per cent from 2013 to 2021.”\n\nThe Australian Medical Association also said its members were worried about the review’s direction. “Concerns about safety and standards, about the significant gaps and loopholes in our regulatory systems, and about fragmentation of the health system are not trivial,” the association said.\n“The review must acknowledge and address the concerns to ensure the continued support of the medical profession.”\n\nThe AMA said the models referenced by the review had been “developed in health systems which are under a level of strain not experienced in Australia”.\n\n“The [UK National Health Service] for example is in a state of critical workforce shortage with extensive backlogs. The United Kingdom has 3.2 doctors per 1000 people. Australia still sits above the OECD average at four doctors per 1000 people. The AMA is not arguing that we are not experiencing workforce pressures, but when looking to the NHS for models of care we must contextualise appropriately.”\n\nIn one example, the review pointed to the non-medical prescribing framework in the UK where nurses, midwives, pharmacists, optometrists, paramedics, diagnostic radiographers, podiatrists, physician associates, physiotherapists, therapeutic radiographers and dietitians have some prescribing powers.\n\n“This has created efficiencies in the health care system and facilitated improved access to medicines for consumers,” it said.\n\nIt also suggested there be Medicare subsidies for professionals other than doctors to refer patients to specialists, to address a “widely discussed gap in the primary health care system and overreliance on GPs to manage all referrals”.\n\nNurses hold placards and chant on a march through central London during a strike in January 2023.\nNurses hold placards and chant on a march through central London during a strike in January 2023.CREDIT: BLOOMBERG\nThe Royal Australian College of GPs reacted strongly to both suggestions and said the review was treating general practice as a problem or barrier, rather than a solution or protection for the health system.\n\n“There is a disproportionate emphasis on convenience and an oversimplification of general practice and the role of the generalist ... Over-prescribing, over-testing, over-imaging and over-diagnosis are the expected outcomes of removing the ‘gatekeeper’ role of highly trained generalists,” it said in a response.\n\n“The review is looking to the United Kingdom and Canada for inspiration, despite evidence at the coal face that primary care policies in these countries are failing ... [They] are all reporting GP workforce crises despite at least a decade of attempting role or task substitution through nurse and pharmacist prescribing.”\n\nLoading\nThe college also claimed the UK’s plans to license non-doctor assistant roles had created an uproar “with reports of misdiagnoses leading to deaths”, and warned that expanding referral powers would extend already long waitlists for specialist services and lead patients to become unwell when they don’t communicate with their doctor.\n\nInstead of expanding other professions’ prescribing powers, the Royal Australian College of GPs said doctor’s clinics could play a greater role dispensing medicines, reducing the dominance of pharmacies in that space.\n\nHowever, the review’s interim paper said that policy and practice examples from the UK and Canada were “highly relevant to the Australian context”.\n\nIt also said feedback to its suggestions had so far splintered along professional lines, in a reference to long-standing turf wars that have often pitted doctors and pharmacists against each other.\n\n“There are potential real and perceived risks to consumers, the health care team and the health care system if changes to health professionals’ scope of practice are not appropriately supported or implemented. However, many of these risks are well identified, understood and can be minimised or managed,” it said.\n\nA second interim paper will be handed to Butler next week.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1c2jmsb/doctors_fear_medicare_reforms_could_reproduce/",
    "id": "1c2jmsb",
    "link_flair_text": "News"
  },
  {
    "title": "Doctors have lost the battle over pharmacist prescribing and diagnosing, says top GP",
    "author": "hustling_Ninja",
    "score": 63,
    "num_comments": 71,
    "created_utc": 1712354590.0,
    "created_date": "2024-04-06 09:03:10",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1bwujpi/doctors_have_lost_the_battle_over_pharmacist/",
    "id": "1bwujpi",
    "link_flair_text": "General Practice "
  },
  {
    "title": "The hunt for the Australian 'cowboy' pharmacist behind a replica Ozempic and Mounjaro scam",
    "author": "smoha96",
    "score": 30,
    "num_comments": 9,
    "created_utc": 1711942783.0,
    "created_date": "2024-04-01 14:39:43",
    "selftext": "Starter comment:\n\nA Syndey based pharmacist with restrictions on compounding practice and staking in compounding practices by AHPRA is suspected of selling unregulated  compounded semaglutide with aggressive advertising to GPs and patients, and questionable and inconsistent compositions of its formulation and cold storage - with one patient presenting to hospital with peripheral neuropathy. Sales of this compounder's product appear to have gone as far as the United States. The ABC claims limited investigation was done by authorities despite concerns from GPs and patients until Four Corners tracked down the suspected compounder. The TGA has since investigated this person's property and finding vials similar to the ones used by customers of this compounder which have been taken away for forensic testing. \n\nI'm not in GP land or a pharmacist, so I'd be curious to the thoughts of our colleagues on:\n\n1. How common is compounding/do you typically write scripts for compounded medications? \n\n2. What is the community demand for GLP-1s at the moment? \n\n3. Do compounded pharmacies usually advertise in this way? \n\n4. Are there many regulatory checks and balances for compounded pharamcies/accreditation processes?\n\n5. General thoughts",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1bsto17/the_hunt_for_the_australian_cowboy_pharmacist/",
    "id": "1bsto17",
    "link_flair_text": "News"
  },
  {
    "title": "Getting COC/POP repeats straight from the pharmacy",
    "author": "hustling_Ninja",
    "score": 4,
    "num_comments": 10,
    "created_utc": 1709691497.0,
    "created_date": "2024-03-06 13:18:17",
    "selftext": "Saw this on one of GP group \n\nhttps://preview.redd.it/r2oec1bbimmc1.png?width=1372&amp;format=png&amp;auto=webp&amp;s=808db1d5147e3d26169550e5fd342b20b6a5ad38",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1b7nzb1/getting_cocpop_repeats_straight_from_the_pharmacy/",
    "id": "1b7nzb1",
    "link_flair_text": "General Practice "
  },
  {
    "title": "Looking for anaesthetic medication index website or App please",
    "author": "eusabia",
    "score": 7,
    "num_comments": 5,
    "created_utc": 1706742491.0,
    "created_date": "2024-02-01 10:08:11",
    "selftext": "Hi all, I’m currently on a 3 month anaesthetics term as a PGY2 and looking to scrub up my medication knowledge, particularly common medications used in routine and emergency scenarios of anaesthesia.\n\nI’m on the hunt for a resource that has an index of medications commonly used + MoA (side effects a bonus but not required). I’ve tried many pharmacology apps but none seem to have a direct MoA answer, they commonly just state the receptor the medication acts on, no further detail. \n\nApps I’ve tried: drugs.com, pocket pharmacist, PEDID, lexicomp.\n\nPreferable looking for free resources but also willing to pay if it actually has what I need. \n\nThanks all!",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1afvokb/looking_for_anaesthetic_medication_index_website/",
    "id": "1afvokb",
    "link_flair_text": "Crit care"
  },
  {
    "title": "Paramedic Practitioners, Another Doctor-Wanna-Be Group",
    "author": "Cold_Algae_1415",
    "score": 76,
    "num_comments": 78,
    "created_utc": 1706741778.0,
    "created_date": "2024-02-01 09:56:18",
    "selftext": "Just as Nurse Practitioners are allowed to practice medicine (prescribing, diagnosis etc) without a medical degree under the pretext of “filling the GP shortage”, “working to their full scope of practice”. Now we have another group wanting to do the same, by becoming Paramedic Practitioner (PP).\n\nThis is their proposed scope of practice, which is exactly the same as a medical doctor:\n\n[https://handbook.cqu.edu.au/he/courses/structure?productVersionId=822](https://handbook.cqu.edu.au/he/courses/structure?productversionid=822)\n\nThey are already looking at creating a “Doctor of Advanced Clinical Practice (Paramedic Practitioner)” at Deakin University. As we seen from the US where NPs with a Doctor of Nursing Practice fighting for their rights to be addressed as Dr., it won’t be long for these PPs to start doing the same.\n\nIt is still in a very beginning phase in Australia. But 20-30 years from now, I would not be surprised if NP/PP/GP all are presented as doctors.\n\nEdit:\n\nFor those who think that these new NPs/PPs wont replace GPs, there’s an article in another thread. This happened in the UK where NPs/PAs are running rampant:\n\n[https://www.bbc.com/news/uk-england-surrey-67912753.amp](https://www.bbc.com/news/uk-england-surrey-67912753.amp)\n\nThree doctors will be leaving a Surrey surgery after **All** of its salaried GPs were invited to apply for voluntary redundancy. New roles at the practice include pharmacists, **advanced nursing and paramedic practitioners** and paediatric nurses.\n\nAren’t they there to help with the GP shortage? That‘s what they claimed initially.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1afve4l/paramedic_practitioners_another_doctorwannabe/",
    "id": "1afve4l",
    "link_flair_text": "Career"
  },
  {
    "title": "Pharmacist banned after swapping patient’s narcolepsy medications as an ‘experiment’",
    "author": "hustling_Ninja",
    "score": 98,
    "num_comments": 35,
    "created_utc": 1702521243.0,
    "created_date": "2023-12-14 13:34:03",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/18hy9su/pharmacist_banned_after_swapping_patients/",
    "id": "18hy9su",
    "link_flair_text": "News"
  },
  {
    "title": "Pharmacist at Alfred Hospital in Melbourne fired for looking at files",
    "author": "doctor_test_9",
    "score": 63,
    "num_comments": 42,
    "created_utc": 1698960078.0,
    "created_date": "2023-11-03 08:21:18",
    "selftext": "[https://www.theage.com.au/national/victoria/curious-pharmacist-spied-on-patient-records-at-the-alfred-20231025-p5eet1.html](https://www.theage.com.au/national/victoria/curious-pharmacist-spied-on-patient-records-at-the-alfred-20231025-p5eet1.html)\n\nSee the above article - how would they identify Doctors doing the same? I know I look at 30-40 files a day at times, many on a different bed card to the team I am on whilst I'm in a consults role. In many cases I don't order any tests/write any notes so it could be difficult to know if I was 'meant' to access the file. Would someone have to manually 'review' every file access? Just seems like a logistical nightmare to conduct a similar investigation for a medical staff member. ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/17me5r1/pharmacist_at_alfred_hospital_in_melbourne_fired/",
    "id": "17me5r1",
    "link_flair_text": "Opinion"
  },
  {
    "title": "What do other people / professions think of us?",
    "author": "hustling_Ninja",
    "score": 20,
    "num_comments": 67,
    "created_utc": 1696721016.0,
    "created_date": "2023-10-08 10:23:36",
    "selftext": "Just reflecting on another [thread](https://www.reddit.com/r/ausjdocs/comments/171t9ul/hamish_andy_podcast_on_being_a_gp/) that was posted recently. What do other professionals who work with us, think of us? (PT, OT, NS, pharmacists etc). Moreover, what do general population think of us? (All doctors, not just general practice)\n\nWould you say the respect of medical profession as a whole has deteriorated over the years? If so, why? Just wanted to be candid and have a real discussion about this\n\nAlso, should we care? (\\*I think we should).\n\nGeneral feedback from other professions welcome.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/172k2rc/what_do_other_people_professions_think_of_us/",
    "id": "172k2rc",
    "link_flair_text": "Feedback"
  },
  {
    "title": "Pharmacists post patient scripts to Facebook in 60-day dispensing attack",
    "author": "hustling_Ninja",
    "score": 46,
    "num_comments": 29,
    "created_utc": 1696485004.0,
    "created_date": "2023-10-05 16:50:04",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/170a3vw/pharmacists_post_patient_scripts_to_facebook_in/",
    "id": "170a3vw",
    "link_flair_text": "News"
  },
  {
    "title": "Advice on reducing redundant workflow in hospital in the home (HITH)",
    "author": "natemason95",
    "score": 17,
    "num_comments": 25,
    "created_utc": 1694731243.0,
    "created_date": "2023-09-15 08:40:43",
    "selftext": "BPT in a HITH role at tertiary hospital. The service runs with me at the hospital, the team leader, NS and allied health at a peripheral staff. Just wondering how to communicate/ alter the system so I don't keep getting the never ending phone calls/ disruptions to my day (average about 30 a day). Some examples are\n\n- 'does this patient need a blood test they had bloods yesterday'\n- What's the plan for x patient, are they discharging (this is a good question, except I get a call from the team leader, shift coordinator, and the visiting nurse)\n- this patient needs new medication, can you call them and figure out what (my response - call the pharmacist)\n- the plan says the patient needs x investigation- what's happening with it (same thing of multiple people asking, or that I tell the nurse the day prior and they don't document or read my answer)\n- Or the classic - the patient is QADDs 1 with a heart rate of 91 - just letting you know.\n\nI understand these and the multitude of others need answers from me - but clear documentation on their part, text messages and emails could answer at least half of them. So just want some advice to conver/ cause that change?",
    "url": "https://old.reddit.com/r/ausjdocs/comments/16iwbuw/advice_on_reducing_redundant_workflow_in_hospital/",
    "id": "16iwbuw",
    "link_flair_text": "Support "
  },
  {
    "title": "Being older and starting medicine",
    "author": "IndividualCourse7921",
    "score": 14,
    "num_comments": 40,
    "created_utc": 1693542995.0,
    "created_date": "2023-09-01 14:36:35",
    "selftext": "Hi, I’m a young mom, in my late 30s and have been a clinical pharmacist for almost a decade. I’ve always wanted to study medicine after I started working at the hospital but I’ve had a lot of issues with money and having a roof over my head. But now I have paid off my house and I do have enough money I think to survive school again. Is it too late ? I’m 36. My daughter is 2. \nMy husband is supportive and doing well but we are wanting a second child in the near future. \nIs there anyone is the same predicament as me or has any advice ?\nIs this doable or am I dreaming?\nHow does one balance study and family ? \nWould love to hear some thoughts.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/166xcu3/being_older_and_starting_medicine/",
    "id": "166xcu3",
    "link_flair_text": "Support "
  },
  {
    "title": "I am a hospital pharmacist. AMA",
    "author": "Odd_Apple_8488",
    "score": 13,
    "num_comments": 20,
    "created_utc": 1693023954.0,
    "created_date": "2023-08-26 14:25:54",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/161l1ng/i_am_a_hospital_pharmacist_ama/",
    "id": "161l1ng",
    "link_flair_text": "AMA"
  },
  {
    "title": "Pharmacists protest changes to dispensation limits from federal government",
    "author": "hustling_Ninja",
    "score": 9,
    "num_comments": 2,
    "created_utc": 1692262838.0,
    "created_date": "2023-08-17 19:00:38",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/15thu4p/pharmacists_protest_changes_to_dispensation/",
    "id": "15thu4p",
    "link_flair_text": "News"
  },
  {
    "title": "Reader's digest - Sh* that health professionals do sometimes",
    "author": "hustling_Ninja",
    "score": 17,
    "num_comments": 7,
    "created_utc": 1691918201.0,
    "created_date": "2023-08-13 19:16:41",
    "selftext": "If you are bored during your night shift but the admin won't let you sleep\n\nor\n\nyou are doom scrolling while taking a post coffee dump at work\n\nCheck this [out](https://www.ahpra.gov.au/Resources/Tribunal-decisions.aspx)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nFew highlights:\n\n\\- A Victorian chiropractor who falsely declared they had professional indemnity insurance (PII) and practised without it for four years has been reprimanded for professional misconduct and suspended for two months\n\n&amp;#x200B;\n\n\\- Provisional psychologist penalised for providing false details and breaching supervised practice rules.\n\n&amp;#x200B;\n\n\\- A Queensland medical practitioner has been reprimanded and suspended for three months by a tribunal for professional misconduct involving inappropriate prescribing\n\n&amp;#x200B;\n\n\\- A tribunal has cancelled a nurse’s registration and disqualified her from applying for two years after she spat at a vulnerable patient and used vulgar language\n\n&amp;#x200B;\n\n\\- A South Australian tribunal has found a dentist guilty of professional misconduct for falsifying medical certificates\n\n&amp;#x200B;\n\n\\- A medical practitioner who injured his son has been reprimanded by a tribunal and had his registration suspended for four months for professional misconduct.\n\n&amp;#x200B;\n\n\\- Former pharmacist reprimanded and disqualified from applying for registration or providing a health service for five years, after he was convicted in the SA Magistrates Court for criminal trespass, theft and creating false records\n\n&amp;#x200B;\n\n\\- A pharmacist who misappropriated prescription-only pain killers and stole money from her workplace has been reprimanded, suspended and ordered to comply with health and education conditions.\n\n&amp;#x200B;\n\n\\-  A tribunal has disqualified a former nurse from applying for registration for six months following criminal convictions concerning drug trafficking\n\n&amp;#x200B;\n\n\\- Pharmacist reprimanded and disqualified for two months for importing ice pipes\n\n&amp;#x200B;\n\n&amp;#x200B;",
    "url": "https://old.reddit.com/r/ausjdocs/comments/15pu8nf/readers_digest_sh_that_health_professionals_do/",
    "id": "15pu8nf",
    "link_flair_text": "Life"
  },
  {
    "title": "Will GPs embrace 60-day prescribing?",
    "author": "hustling_Ninja",
    "score": 9,
    "num_comments": 7,
    "created_utc": 1685232968.0,
    "created_date": "2023-05-28 10:16:08",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/n361xig6tg2b1.png?width=1888&amp;format=png&amp;auto=webp&amp;s=a632184a9bc250fb89b4c8ab7a6563af75764d01\n\n&amp;#x200B;\n\nhttps://preview.redd.it/b8sd8k39tg2b1.png?width=1892&amp;format=png&amp;auto=webp&amp;s=63d1cb6d4de11c7dae4bbe79d411ec73846ae65c\n\nSource: [https://www.ausdoc.com.au/news/will-gps-embrace-60-day-prescribing/](https://www.ausdoc.com.au/news/will-gps-embrace-60-day-prescribing/)",
    "url": "https://old.reddit.com/r/ausjdocs/comments/13tmh9r/will_gps_embrace_60day_prescribing/",
    "id": "13tmh9r",
    "link_flair_text": "News"
  },
  {
    "title": "I’m a pharmacist — let me explain why 60-day dispensing is an existential threat",
    "author": "hustling_Ninja",
    "score": 3,
    "num_comments": 63,
    "created_utc": 1684829191.0,
    "created_date": "2023-05-23 18:06:31",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/r7lz09ffgj1b1.png?width=1878&amp;format=png&amp;auto=webp&amp;s=0cef8114b4dade0d2913bb5a92ab558984954b0f\n\nhttps://preview.redd.it/dt8e1sshgj1b1.png?width=1892&amp;format=png&amp;auto=webp&amp;s=cb0ebb6bf3143be49d5f7616a83b40a04620fcdc\n\nhttps://preview.redd.it/cl4yk3zjgj1b1.png?width=1898&amp;format=png&amp;auto=webp&amp;s=216a1f102df169b56daafe8f0bb2430597880892\n\n[https:\\/\\/www.ausdoc.com.au\\/news\\/im-a-pharmacist-let-me-explain-why-60-day-dispensing-is-an-existential-threat\\/](https://preview.redd.it/cbuhi2jlgj1b1.png?width=1900&amp;format=png&amp;auto=webp&amp;s=b43330462d82941ca38c0fa6eaa80744e8a908c0)",
    "url": "https://old.reddit.com/r/ausjdocs/comments/13pi0ne/im_a_pharmacist_let_me_explain_why_60day/",
    "id": "13pi0ne",
    "link_flair_text": "News"
  },
  {
    "title": "New report ‘proof’ pharmacy prescribing for UTIs should end, says RACGP",
    "author": "hustling_Ninja",
    "score": 17,
    "num_comments": 14,
    "created_utc": 1684743221.0,
    "created_date": "2023-05-22 18:13:41",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/yuxy3mdwcc1b1.png?width=1900&amp;format=png&amp;auto=webp&amp;s=3fb9881895efad5097628e8d2d25de241f56a1e7\n\n[https:\\/\\/www.ausdoc.com.au\\/news\\/new-report-proof-pharmacy-prescribing-for-utis-should-end-says-racgp\\/](https://preview.redd.it/6rj2f0ozcc1b1.png?width=1892&amp;format=png&amp;auto=webp&amp;s=1031a948170e539054fa42b3b62e4dd5bec0977c)",
    "url": "https://old.reddit.com/r/ausjdocs/comments/13okko6/new_report_proof_pharmacy_prescribing_for_utis/",
    "id": "13okko6",
    "link_flair_text": "News"
  },
  {
    "title": "NSW pharmacists start prescribing in ‘feasibility’ study as full trial pushed back",
    "author": "hustling_Ninja",
    "score": 18,
    "num_comments": 32,
    "created_utc": 1684314213.0,
    "created_date": "2023-05-17 19:03:33",
    "selftext": "&amp;#x200B;\n\n[https:\\/\\/www.ausdoc.com.au\\/news\\/nsw-pharmacists-start-prescribing-in-feasibility-study-as-full-trial-pushed-back\\/](https://preview.redd.it/fbsuwa89xc0b1.png?width=1980&amp;format=png&amp;auto=webp&amp;s=ed60a9e700c391928f63b49af56d164e924a61cf)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lv9cieicxc0b1.png?width=1922&amp;format=png&amp;auto=webp&amp;s=28541748bc6a27f9bc96f4d5355765759060beb7",
    "url": "https://old.reddit.com/r/ausjdocs/comments/13jwaw6/nsw_pharmacists_start_prescribing_in_feasibility/",
    "id": "13jwaw6",
    "link_flair_text": "News"
  },
  {
    "title": "Pharmacists prescribing ABx",
    "author": "hustling_Ninja",
    "score": 13,
    "num_comments": 5,
    "created_utc": 1683703957.0,
    "created_date": "2023-05-10 17:32:37",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/13djfyx/pharmacists_prescribing_abx/",
    "id": "13djfyx",
    "link_flair_text": "International"
  },
  {
    "title": "Why the RACGP isn’t walking out of the next pharmacy prescribing trial",
    "author": "hustling_Ninja",
    "score": 9,
    "num_comments": 6,
    "created_utc": 1683323155.0,
    "created_date": "2023-05-06 07:45:55",
    "selftext": "&amp;#x200B;\n\n[https:\\/\\/www.ausdoc.com.au\\/news\\/why-the-racgp-isnt-walking-out-of-the-next-pharmacy-prescribing-trial\\/](https://preview.redd.it/514ol0id23ya1.png?width=1900&amp;format=png&amp;auto=webp&amp;s=99ff2c41b2ad611791cd2542ebfe2cfb07b74e23)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/r9kuh2le23ya1.png?width=1896&amp;format=png&amp;auto=webp&amp;s=aeba944759d274cec76bb608ada96be80f5a2c84",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1392gj4/why_the_racgp_isnt_walking_out_of_the_next/",
    "id": "1392gj4",
    "link_flair_text": "News"
  },
  {
    "title": "https://www.ausdoc.com.au/news/pharmacist-prescribing-is-not-safe-specialist-medical-colleges-condemn-assault-on-tga-schedule/",
    "author": "hustling_Ninja",
    "score": 13,
    "num_comments": 0,
    "created_utc": 1681811861.0,
    "created_date": "2023-04-18 19:57:41",
    "selftext": "[https://www.ausdoc.com.au/news/pharmacist-prescribing-is-not-safe-specialist-medical-colleges-condemn-assault-on-tga-schedule/](https://www.ausdoc.com.au/news/pharmacist-prescribing-is-not-safe-specialist-medical-colleges-condemn-assault-on-tga-schedule/)\n\n&amp;#x200B;\n\n[https:\\/\\/www.ausdoc.com.au\\/news\\/pharmacist-prescribing-is-not-safe-specialist-medical-colleges-condemn-assault-on-tga-schedule\\/](https://preview.redd.it/hliy5s5j8mua1.png?width=2002&amp;format=png&amp;auto=webp&amp;s=b17574c917e96058ac6509d9b8b981b493624452)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lsqiol1i8mua1.png?width=2036&amp;format=png&amp;auto=webp&amp;s=e3823e7ddfdf2c63c162119ad435c2ad810594e7",
    "url": "https://old.reddit.com/r/ausjdocs/comments/12qi01t/httpswwwausdoccomaunewspharmacistprescribingisnots/",
    "id": "12qi01t",
    "link_flair_text": "News"
  },
  {
    "title": "Scrap the pharmacy prescribing experiment: Sign the AusDoc petition",
    "author": "hustling_Ninja",
    "score": 9,
    "num_comments": 2,
    "created_utc": 1680507455.0,
    "created_date": "2023-04-03 17:37:35",
    "selftext": "&amp;#x200B;\n\n[https:\\/\\/www.ausdoc.com.au\\/news\\/scrap-the-pharmacy-prescribing-experiment-sign-the-ausdoc-petition\\/](https://preview.redd.it/fsdju1xshmra1.png?width=1970&amp;format=png&amp;auto=webp&amp;s=8b706fe8219939cb04ba76c37da95826f72f31f7)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/rpkv5qfxhmra1.png?width=1598&amp;format=png&amp;auto=webp&amp;s=e054a945c0cceb0387552803657a6d77e1110aa3",
    "url": "https://old.reddit.com/r/ausjdocs/comments/12aczkr/scrap_the_pharmacy_prescribing_experiment_sign/",
    "id": "12aczkr",
    "link_flair_text": "News"
  },
  {
    "title": "Duel registration",
    "author": "Hopefullyhopeful9",
    "score": 3,
    "num_comments": 7,
    "created_utc": 1679793098.0,
    "created_date": "2023-03-26 12:11:38",
    "selftext": "I couldn’t really find straight answer to this question anywhere. Would ahpra allow duel registrations? For example, pharmacist &amp; medical practitioner as long as I meet the registration requirements and pay for fee etc?",
    "url": "https://old.reddit.com/r/ausjdocs/comments/12265zs/duel_registration/",
    "id": "12265zs",
    "link_flair_text": "Support "
  },
  {
    "title": "175 Qld pharmacists sign up for prescribing training",
    "author": "hustling_Ninja",
    "score": 12,
    "num_comments": 11,
    "created_utc": 1679792397.0,
    "created_date": "2023-03-26 11:59:57",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/pmctcdukfzpa1.png?width=1958&amp;format=png&amp;auto=webp&amp;s=363e94110efb02e013037151556b54fad1f65c88\n\n[https:\\/\\/www.ausdoc.com.au\\/news\\/175-qld-pharmacists-sign-up-for-prescribing-training\\/](https://preview.redd.it/8v8m4znnfzpa1.png?width=1878&amp;format=png&amp;auto=webp&amp;s=19f55bd6363ca0c34222161fbd2aa17460c14373)",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1225r7y/175_qld_pharmacists_sign_up_for_prescribing/",
    "id": "1225r7y",
    "link_flair_text": "News"
  },
  {
    "title": "Revealed: The training pharmacists will undergo to prescribe independently of doctors",
    "author": "hustling_Ninja",
    "score": 15,
    "num_comments": 14,
    "created_utc": 1679480969.0,
    "created_date": "2023-03-22 21:29:29",
    "selftext": "&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ib52kelmp9pa1.png?width=1924&amp;format=png&amp;auto=webp&amp;s=9f3a5754db4a83ae409e91f18772b40a7149f68b\n\n&amp;#x200B;\n\n[https://www.ausdoc.com.au/news/revealed-the-training-pharmacists-will-undergo-to-prescribe-independently-of-doctors/](https://www.ausdoc.com.au/news/revealed-the-training-pharmacists-will-undergo-to-prescribe-independently-of-doctors/)",
    "url": "https://old.reddit.com/r/ausjdocs/comments/11yeo7q/revealed_the_training_pharmacists_will_undergo_to/",
    "id": "11yeo7q",
    "link_flair_text": "News"
  },
  {
    "title": "Pharmacists could soon renew scripts for the pill under NSW election pledge | 9 News Australia",
    "author": "hustling_Ninja",
    "score": 3,
    "num_comments": 13,
    "created_utc": 1676805398.0,
    "created_date": "2023-02-19 22:16:38",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/11682hm/pharmacists_could_soon_renew_scripts_for_the_pill/",
    "id": "11682hm",
    "link_flair_text": "News"
  },
  {
    "title": "A real take on Pharmacist prescribing",
    "author": "PinkPikachu999",
    "score": 10,
    "num_comments": 13,
    "created_utc": 1669795768.0,
    "created_date": "2022-11-30 19:09:28",
    "selftext": "This was on Sydney Morning Herald yesterday:\n\nhttps://www.smh.com.au/healthcare/as-a-pharmacist-turned-doctor-i-don-t-trust-noctors-to-diagnose-20221128-p5c1w6.html",
    "url": "https://old.reddit.com/r/ausjdocs/comments/z8lpll/a_real_take_on_pharmacist_prescribing/",
    "id": "z8lpll",
    "link_flair_text": "News"
  },
  {
    "title": "Prescribing Pharmacists uk",
    "author": "hustling_Ninja",
    "score": 2,
    "num_comments": 0,
    "created_utc": 1669431114.0,
    "created_date": "2022-11-26 13:51:54",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/z4w1z3/prescribing_pharmacists_uk/",
    "id": "z4w1z3",
    "link_flair_text": "Medicine"
  },
  {
    "title": "I’m a doctor who’ll trust pharmacists to diagnose",
    "author": "hustling_Ninja",
    "score": 6,
    "num_comments": 1,
    "created_utc": 1669320434.0,
    "created_date": "2022-11-25 07:07:14",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/z3tcpm/im_a_doctor_wholl_trust_pharmacists_to_diagnose/",
    "id": "z3tcpm",
    "link_flair_text": "other "
  },
  {
    "title": "State Govt says it will fund $20 patient consults with pharmacists and cover the cost of their scripts",
    "author": "hustling_Ninja",
    "score": 3,
    "num_comments": 1,
    "created_utc": 1669179886.0,
    "created_date": "2022-11-23 16:04:46",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/z2fz9n/state_govt_says_it_will_fund_20_patient_consults/",
    "id": "z2fz9n",
    "link_flair_text": "news"
  },
  {
    "title": "Do pharmacists really want to prescribe?",
    "author": "joon848384",
    "score": 17,
    "num_comments": 6,
    "created_utc": 1665925735.0,
    "created_date": "2022-10-17 00:08:55",
    "selftext": "I am trying to be impartial here...but WTH are they thinking??\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nTL:DR - QLD government is hatching up a secret plan for pharmacists in FNQ to diagnose and prescribe for 23 medical conditions \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nOk. Context first.\n\n&amp;#x200B;\n\nBack in January, one of Australian medical news outlets has uncovered that QLD government had drawn up a radical plan for pharmacists to diagnose and prescribe 23 medical conditions.\n\n&amp;#x200B;\n\n[https:\\/\\/www.ausdoc.com.au\\/adg\\_brand\\/australiandoctor\\/](https://preview.redd.it/xrfbk160s5u91.png?width=1406&amp;format=png&amp;auto=webp&amp;s=6e5f9f2cd318df2965f8432ec258a7513e51e5d0)\n\n&amp;#x200B;\n\nThis would allow pharmacists to charge between $22 - $55 a consult\n\nSo essentially, diagnosing, prescribing and dispensing is happening in one place. (do you see any issues here?....conflict of interest?)\n\nAND get this, pharmacists will have ability to alter the drug formulation without permission from the original prescriber if they believe it to be clinically necessary.\n\nNow, I'm not doubting our pharmacist colleague's ability to intervene medication errors or life threatening drug interactions. No sir.\n\nInfact, they are probably best at this because that is their SCOPE OF PRACTICE. They have trained 4 + years to manage these things. Just like us, doctors, spending number of years horning in our skills to diagnosis, investigate and manage myriad of diseases and conditions.\n\nI love hospital pharmacists. They tell me ALL the time how my dosage of certain medication is wrong or how my brain is farting out and not thinking about potential drug interactions or I stupidly spelled a medication  wrong and my writing is illegible 99.9% of the time.\n\nAnd best of all, they NEVER get MAD. (seriously they are the most nicest people in the hospital - I should of bought coffee for them for saving my ass)\n\nThey write these very clear / legible non aggressive notes with their beautiful hand writing and  with very bright purple pen. (I thought they had to use green pen but anyway)\n\n&amp;#x200B;\n\nI digress.\n\n&amp;#x200B;\n\nThe above article states the following:\n\n&amp;#x200B;\n\n\"Outlined in a 34-page confidential draft report, leaked to *Australian Doctor,* the list of Schedule 4 drugs being considered for pharmacist prescribing is extensive.\n\nTheir expanded role would cover:\n\n* Travel medicine, including non-vitamin K antagonist oral anticoagulants for VTE prophylaxis, despite this being an off-label use in Australia.\n* Depending on patient complexity, potential diagnosis and management of type 2 diabetes, including initiation of anti-hyperglycaemics, although referral to a doctor is required for patients with multiple comorbidities, pregnant patients and those with microvascular and macrovascular complications.\n* Acute infective conditions — like impetigo, shingles, otitis externa and otitis media — with the pharmacist examining the patient’s ear drums as part of diagnosis. \n* Wound management, with pharmacists using surgical sutures and prescribing oral antibiotics for localised minor infections. \n* Pharmacist COPD diagnosis and medicine initiation in adults over 40 (see box below for full details).\n* Diagnosis and management of gastro-oesophageal reflux disease in adults under 50.\n* Obesity, asthma, acne and atopic dermatitis, with pharmacists independently prescribing high-strength steroids and pimecrolimus without medical oversight.\n\nQueensland Government has refused to respond to questions and has yet to confirm whether it will become official policy\"\n\n&amp;#x200B;\n\nI have so many questions..\n\n&amp;#x200B;\n\nVTE prophylaxis? Dx and Mx of DM? Prescribing high strength steroids?\n\nDo pharmacist regularly examine ears? Do they know how to dx perforated TM? When was the last time you saw a pharmacist using surgical sutures? When was the last time  you saw a  MED REG doing surgical sutures in the hospital? (sorry, that was a cheap shot)\n\n&amp;#x200B;\n\nOh yeah, and there's this UTI trial. (pharmacists are able to dx uncomplicated UTI and Tx with POAB)\n\n&amp;#x200B;\n\nWay I see it, I don't think pharmacists wants to do this. I wouldn't do this when you are already underpaid (Pharmacists are  one of the lowest paid health professionals in Australia) and busy doing 400 scripts per day + managing store front and staff etc etc.\n\n&amp;#x200B;\n\nWill they be covered by their indemnity when sh\\*t hits the fan? is AHPRA okay with pharmacists expanding their scope?\n\n&amp;#x200B;\n\nSo who's bright idea was this? Why isnt there a public debate? what's all this secrecy?\n\n&amp;#x200B;\n\n**QLD HEALTH + Pharmacy** **guild.co** **-** \"Allegedly\" .Don't sue me)\n\n&amp;#x200B;\n\n[https:\\/\\/www.ausdoc.com.au\\/news\\/exclusive-massive-expansion-pharmacist-prescribing-cards\\/](https://preview.redd.it/wt1b1zayy5u91.png?width=1888&amp;format=png&amp;auto=webp&amp;s=059ac236e7763e2f0c6f6f32933005fde37bf303)\n\nPharmacy guild? what's that?\n\nBasically they are group of pharmacy owners with very strong lobbying power \"allegedly\"\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[https:\\/\\/www.youtube.com\\/watch?v=J8qh4UwutZA&amp;t=4s](https://preview.redd.it/rt6vnndy06u91.png?width=1694&amp;format=png&amp;auto=webp&amp;s=075188b309495836880f6ea9de4fa7676dff5c2e)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[https:\\/\\/www.ausdoc.com.au\\/news\\/queensland-pharmacy-trial-independent-prescribing-ruled-out-for-five-conditions\\/](https://preview.redd.it/sghwgq8g16u91.png?width=1874&amp;format=png&amp;auto=webp&amp;s=b8a874722ca30a17bd38344abefe075610b273ea)\n\n&amp;#x200B;\n\nObviously, there has been a massive backlash from doctors (surprise surprise)\n\n&amp;#x200B;\n\nNow the QLD Gov has revised their plan:\n\n&amp;#x200B;\n\n'Under the revised plan, pharmacists will not be given independent prescribing rights for type 2 diabetes, hypertension, dyslipidaemia, asthma and exercise-induced bronchoconstriction, and COPD, but perform “protocol or structured prescribing”.\n\nThis means they will have to collaborate with a GP to make sure the medication is appropriate, a government spokesperson said.'\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nQuestions is though, is this really the solution to reduce the burden on GPs and overcrowded ED?\n\nOr just another ploy to fatten the pockets of pharmacy guild by driving traffic into pharmacies?",
    "url": "https://old.reddit.com/r/ausjdocs/comments/y5gfj5/do_pharmacists_really_want_to_prescribe/",
    "id": "y5gfj5",
    "link_flair_text": "Opinion"
  },
  {
    "title": "Who's paying for your med school journey?",
    "author": "joon848384",
    "score": 8,
    "num_comments": 7,
    "created_utc": 1663075523.0,
    "created_date": "2022-09-13 23:25:23",
    "selftext": "This post will probably resonate more with medical students who are putting themselves through medical school with their own finance.\n\nEven if you have a CSP place. That student loan will be taken out of your pay once you start your internship. After 4 years and with all this inflation, your indexed student loan will become a gigantic debt you had to pay for. (we'll see what happens with our economy)\n\nSo, it's probably better to pay your tuition fees as soon as possible  (if you can afford it).\n\n&amp;#x200B;\n\nNow, question becomes - How do I support myself / pay for tuition fees?\n\nHere are some ideas.\n\n&amp;#x200B;\n\n1. If you are a post-grad and already had a job prior to med school. Try to keep this job and covert to a part-time / casual. (fingers crossed and hope your boss can do this for you). I had a friend who used to be a pharmacist and another friend who used be a dentist. They supported themselves by working on weekends in their respective field. Lock in those weekend rates.\n2. Try to work for 1st - 2nd year of your medical school journey. Its already hard enough to juggle between studying one of the hardest course in uni and sleep right? I hear ya.  But, you would have no time whatsoever when you start your clinical years.\n3. Be a part-time phlebotomist in a hospital - few of my mates in medical school did this. Not only it will help you with your communication skills and procedures skills, you also have an opportunity to talk to consultants and residents early on. Get to know the ins and outs of a hospital\n4. Be a receptionist in a GP clinic - again, same notion as point 3. You get to interact with patients and get to know the ins and outs of a GP clinic. Good idea if you want to be a GP and become a practice owner one day. Med school won't teach you how to run your own GP clinic.\n5. Be a surgical wardie / surgical scrub - there are people who who help with transporting patients and delivering surgical equipments in the operating theatre. Some of hospitals also have night shifts available. Again, you get to see the operating theatre before your peers and get used to the environment.\n\n&amp;#x200B;\n\nLet me know any other ideas you have.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/xd7itt/whos_paying_for_your_med_school_journey/",
    "id": "xd7itt",
    "link_flair_text": "Support "
  },
  {
    "title": "Pharmacy prescribing students in ED/GP",
    "author": "TasMitch",
    "score": 5,
    "num_comments": 10,
    "created_utc": 1763073067.0,
    "created_date": "2025-11-14 09:31:07",
    "selftext": "I’m not a fan of pharmacy prescribing, but I wonder whether we should push for pharmacy prescribing students to do mandatory placements in ED and GP? As a medical student it helped me realise how important it is to run even “simple things“ via seniors, so I wonder if having the pharmacy prescribing students there would similarly give them pause. Placement requirements would also make it more onerous to get the pharmacy prescribing tick, which may curtail supply. The risk, of course, is that it may impart further legitimacy. \n\nI am genuinely curious to know what people think 😊",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1owf5u1/pharmacy_prescribing_students_in_edgp/",
    "id": "1owf5u1",
    "link_flair_text": "Opinion📣"
  },
  {
    "title": "UPDATE: Call for More AMA Members - Let’s Get This Done",
    "author": "Prior-Lawful",
    "score": 114,
    "num_comments": 12,
    "created_utc": 1759889522.0,
    "created_date": "2025-10-08 13:12:02",
    "selftext": "Thanks to everyone who has stepped up and for being part of this important moment for our profession so far - the response has been incredible.\n\nMomentum is building, and it’s clear many of us share deep concerns about how our profession is being represented.\n\nFor those without context, this was in response to our Federal AMA coming out in support for general nurse prescribing. \n\nWhen our peak profession body publicly supports general nurse prescribing - without any public fight, public campaign, or defence of our scope, and then calls a watered-down version “better” or even a “win,” shows how far we’ve drifted from standing up for the core fundamentals of medical practice.\n\nTo call the EGM we need 25 members from each state and territory AMA to formally requisition the Federal AMA Extraordinary General Meeting (EGM).\n\nThe form is attached. If you haven’t yet signed, now’s the time.\n\nWhy this matters\nPrescribing is not just a technical task - it is a core fundamental of medical practice, underpinned by years of rigorous training, examinations, and clinical judgment.\n\nWe are not against collaboration. We value and respect our nursing and pharmacy colleagues. But roles matter and training matters.\nEach profession has its own strengths and responsibilities - and these boundaries exist to protect patient safety, not egos.\n\nWhat’s happening\nWe’re seeing key medical responsibilities being eroded, often under the language of “freeing up doctors from administrative tasks.”\n\nBut when examined closely, these changes are not improving speed, ease, or workflow. They are not about efficiency - they are about role substitution. This disproportionately affects RMO and Doctors-in-training. \n\nAnd once that happens, the profession loses not just work, but purpose and accountability.\n\nWhat we’re asking\nWe first need transparency from the AMA about how we reached this point, and ensure decisions that affect the future of medical care for patients from a system perspective are based on safe, role-appropriate models. \n\nWhat is the point of endless exams, countless hours of study, and all those years of training if the very fundamentals of medical practice can be handed away?\n\nThis is not about turf. This is about patient safety, professional integrity, and the future of medicine in Australia.\n\nWe are getting there, if you haven’t signed yet - please do. If you have than you and please share it with your colleagues. \n\nEvery name counts.\n\nState Counter:\nVIC - 9\nNSW - 5\nQLD - 9\nTAS - 2\nWA - 2\nACT - 1",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1o0yc4o/update_call_for_more_ama_members_lets_get_this/",
    "id": "1o0yc4o",
    "link_flair_text": "serious🧐"
  },
  {
    "title": "Disparaging comments about nurses",
    "author": "parkingfinemyass",
    "score": 530,
    "num_comments": 114,
    "created_utc": 1759403044.0,
    "created_date": "2025-10-02 21:04:04",
    "selftext": "Recently, I’ve noticed some members of this sub (apparent med students and junior docs) have made some rather disappointing comments about nurses. One such case was a member referring to nurses as ‘shitheads.’ IMO such behaviour doesn’t belong in the healthcare profession. It doesn’t belong anywhere.\n\nWe need to work together. We work in a fucked system that is constantly at breaking point. We’re all trying. We don’t need this bullshit us vs them mentality. Nor should this invisible divide between docs and nurses continue. We all come from different backgrounds and that should disappear in the clinical setting. We’re your colleagues and we’re not beneath you - and likewise you. We have our roles and you yours - but we are ALL working towards one goal. \n\nSomeone wrote nurses do the bare minimum - which is such a gut punch to think that’s what our medical staff might think of nurses. There are bad practitioners in all healthcare fields. We’ve all seen it. I’ve dealt with them - docs, nurses and even allied health. But the sins of some shouldn’t fuel this divide. \n\nI know you are all upset about changes to the nursing and pharmacy scope. I don’t agree with it. But that doesn’t mean you should go online and rant about nurses. \n\nAnd likewise to nurses. You shouldn’t whinge or speak badly about all doctors. Nor should you engage in such divisive behaviour.\n\nI hate reading these comments and then worrying that the doctors I work alongside think we’re all dummies or shitheads. I know it’s not the case, but it influences my own fears.\n\nWe are a team. We have a goal. We should be unified.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1nw0pv6/disparaging_comments_about_nurses/",
    "id": "1nw0pv6",
    "link_flair_text": "Vent😤"
  },
  {
    "title": "Should we be upskilling wardsmen to help with the nursing shortages?",
    "author": "natemason95",
    "score": 319,
    "num_comments": 61,
    "created_utc": 1759382951.0,
    "created_date": "2025-10-02 15:29:11",
    "selftext": "Wardies have a key role in healthcare - patient transfers, cpr, escorting patients. So, why dont we unskill senior wardies with nursing skills? Antibiotic administration, IV cannulation, opioid dispensing. With appropriate education i cant see an issue with this \n\nThis would help with the nursing shortage and the ballooning cost of the health system of nursing wages. I'm sure nursing staff would also welcome the extra hands and be happy to help with their education. \n\n(Shit-post for pharmacy/ nursing prescribing and skill creep)",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1nvvaou/should_we_be_upskilling_wardsmen_to_help_with_the/",
    "id": "1nvvaou",
    "link_flair_text": "sh8t post :doge:"
  },
  {
    "title": "Nurse prescribing - why this is a horrible idea",
    "author": "Particular_Number",
    "score": 115,
    "num_comments": 71,
    "created_utc": 1759274952.0,
    "created_date": "2025-10-01 09:29:12",
    "selftext": "I share the overall concern about the dangerous and poorly thought out RN prescribing initiative pushed through by AHPRA and unelected 'leaders'. I also note that many RNs themselves are against this and lots of pharmacy colleagues are also opposed. But only saying 'do not endorse or refuse to supervise RNs prescribing' is not enough, we are likely to face the consequences of this very soon. Here is a recent post from the r/residency subreddit (I can't post the screenshot because it gets the post banned), basically the OP is asking psychiatrists what they think about this acual drug regime for a patient (prescribed by an NP no less): \"Quetiapine 100mg daily and 600 mg nightly Fluoxetine 40 mg daily Paliperidone 12 mg nightly Zolpidem 5 mg nightly Hydroxyzine 50 mg BID Buspirone 10 mg BID Vanelaflaxine 150 mg\"\n\nThere are many posts similar to this (admittedly the NP scope is much wider there). This is what we should be afraid of. If NP's are granting prescribing rights after only 6 months of 'supervision' then it's like the blind leading the blind. Where is the liability when the patient is ultimately harmed?\n\nI would love to see what long term outcome data these people relied on to justify pushing this through without consultations.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1nuso93/nurse_prescribing_why_this_is_a_horrible_idea/",
    "id": "1nuso93",
    "link_flair_text": "serious🧐"
  },
  {
    "title": "WTF - Why is the AMA supporting scope creep??!",
    "author": "sudopns",
    "score": 327,
    "num_comments": 129,
    "created_utc": 1759197587.0,
    "created_date": "2025-09-30 11:59:47",
    "selftext": "“The AMA president Danielle McMullen said she was broadly supportive of the new initiative”\n\nWhy the blazing f*uck is the president of what is meant to be our professional body helping support the erosion of the fundamentals of our profession and running our scope into the ground?\n\nI don’t see the nursing body supporting any initiatives that erodes their field, nor the \npharmacy guild supporting initiatives that eliminate core functions of their profession. WTF is the AMA doing? This is the UK all over again. ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1nu0tbv/wtf_why_is_the_ama_supporting_scope_creep/",
    "id": "1nu0tbv",
    "link_flair_text": "WTF🤬"
  },
  {
    "title": "Not-Physician appreciation post",
    "author": "Dull-Initial-9275",
    "score": 117,
    "num_comments": 16,
    "created_utc": 1758924633.0,
    "created_date": "2025-09-27 08:10:33",
    "selftext": "BREAKING NEWS\n\nInside Australia's healthcare revolution - lengthy medical degrees out, fast tracked \"Active Listening\" diplomas in\n\nBy Staff Reporter, Ministry of Healthy Living - February 2038\n\nAUSTRALIA - 90% of the nation's public hospital doctors have resigned. Most have moved on to better opportunities in the private sector. They no longer wanted to be exploited - a sentiment that has left policy makers feeling bamboozled and betrayed. Fortunately, a number of superior doctors have taken their place. \n\nTheir leader? Dr Hearse Practitioner (PhD). Before he demonstrated his immense skill for having patients end up in hearses, he was already a real doctor. With a PhD on the fur texture of ancient Amazonian guinea pigs, he insists that his background is directly transferable to clinical practice. He frequently cites this extraordinary achievement in defense of his right to be called \"Dr.\"\n\nHe is the hospital's lead NP (Not-Physician). The former KFC worker has decided he is destined for more than seeing sprained ankles in ED. A humble man, he accepts that he is not on the level of a medical specialist, but rather, \"I'm far above it.\" In fact, he once rescued a child with a stubbed toe by frantically calling 000. The ambulance was diverted away from a raging house fire. Crisis averted. \n\nSuccess came early for Dr Hearse. His ATAR was so impressive that it had to be hidden with an asterisk, to avoid inflicting emotional damage on his peers. He went on to breeze through a highly competitive degree at the world renowned Mt Druitt Online University, where he flourished under the mentorship of Clinical Professor Green - a gardener.\n\nDr Hearse didn't choose his NP (Not-Physician) speciality. It chose him. Early on, the HCCC noticed a lot of people he was caring for ended up on the end of life pathway. This was long before he was awarded his FRACAP (Fellowship of the Royal Australian College of Accidental Palliation).\n\nIn a rare bipartisan move, Prime Minister Antonio Bolognese and the leader of the opposition - Peta Mutton, joined forces to evict the outdated general medicine departments from the public hospital system. The new podiatrist led complex care team proved to be much more cost effective and patient focused. You could say they put the right foot forward.\n\nToday is an even more momentous occasion. It's media day - a chance to showcase the new model of care improving health outcomes all over the country. It aims to combine the best parts of the UK's often deserted NHS with that of the USA's often sued insurance-led healthcare model. PM Bolognese proudly prances behind Dr Hearse as he leads his team of NP (Not-Physician) practitioners on the ICU ward round. They prescribe everyone 40mg of subcut lavender oil daily, for ATP (autism prophylaxis).\n\nThe team arrives to review Sarah, a young woman who survived a major car accident with serious but non life-threatening injuries. She is complaining of severe chest pain.\n\nIrked by the attention Dr Hearse has been getting all morning, Dr Pusha Button (PhD), an interventional radiographer, moves to the front of the huddle. He's sick and tired of being seen as just a button pusher who takes pictures for the radiologist. He is far more than a doctor, he is a specialist NP (Not-Physician). He orders someone else to push the button for the mobile x-ray. It's showing some unusual opacifications. Could they be pneumothoraces? He's stumped, like usual, so he secretly uploads a photo to the radiology subreddit AskARadiologist, pleading for help. He gets roasted without delay.\n\n\"The bilateral chest x-ray opacities you refer to are obviously just breast shadows. Please stop.\"\n\nHe quickly puts his phone away as the patient continues to complain of chest pain. She thinks her ribs are fractured, but he assures her that being in a car crash doesn't clinically correlate with that type of injury. He confidently directs the inferior medical ICU specialist to order serial beta HCGs, to exclude an intrathoracic ectopic pregnancy.\n\nThe lone ICU JMO sitting across the unit notices that the patient is visibly distressed. He wants to chart her some pain relief. Unfortunately, the JMO isn't allowed to prescribe. Under new legislation, JMOs are not allowed to practice beyond their scope. The JMO sighs and returns to changing an incontinence pad. \n\nIn bed 3, another patient has gone into cardiac arrest. The team of NPs (Not-Physicians) ignores the alarm. As a group deeply invested in the sort of holistic care not provided by medical doctors, Dr Hearse's team understands the importance of treating the person, not the asystole. They prescribe him some cinnamon powder and move on.\n\nDr Hearse's subordinates furiously take notes as PM Bolognese excitedly texts his boss at Pharmacy Megamart. \"The new pilot program for replacing the medical doctors is a resounding success! Your application to convert your perfume aisles into operating theatres has been approved.\"\n\nThe Pharmacy Megamart CEO beams at his employee's message from aboard his yacht. In an unrelated gesture, he replies with a link that can be used to claim a free beachfront mansion.\n\nThe NP (Not-Physician) team expertly reviews the rest of the patients in a similar fashion. They head for their much deserved third muffin break of the morning. \n\nThe final member of the team, a trainee ward clerk NP, completes the documentation. \"All 30 patients are suitable for discharge home, right now. JMO to complete and post discharge summaries by this afternoon.\"\n\nMeanwhile, in The Maldives, the NP bed manager grins as he remotely approves the documented plan. Bed block doesn't exist in a world free of medical doctors. He promptly promotes the trainee for his excellent clinical acumen.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1nrei9v/notphysician_appreciation_post/",
    "id": "1nrei9v",
    "link_flair_text": "sh8t post :doge:"
  },
  {
    "title": "Full scope grocers and retailers",
    "author": "PseudoscientificBook",
    "score": 81,
    "num_comments": 11,
    "created_utc": 1758834222.0,
    "created_date": "2025-09-26 07:03:42",
    "selftext": "It's time to unleash the full scope and access potential of Woolies and Coles and allow them to dispense pharmacy medications as well. \n\nWhy should a patient have to go all the way to Chemist Warehouse to fill their scripts? They can get a prescription from their Nurse Practitioner and conveniently fill it during their next shop. \n\nTake us off the bench! ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1nqil1t/full_scope_grocers_and_retailers/",
    "id": "1nqil1t",
    "link_flair_text": "sh8t post :doge:"
  },
  {
    "title": "*Dr Trent, the Utiologist (*of Pharmacy)",
    "author": "Towering_insight",
    "score": 201,
    "num_comments": 34,
    "created_utc": 1757814835.0,
    "created_date": "2025-09-14 11:53:55",
    "selftext": "**SHIT POST** \n\nDr Trent Cystwell adjusted his crisp white coat—which he'd ordered online with \"Utiologist\" embroidered in gold thread—and surveyed his domain: the back corner of Patel's Pharmacy, nestled between the vitamin aisle and the incontinence products. A hand-painted sign read \"Specialist Utiologist\" with a small asterisk noting \"\\*~~Not~~ actual medical advice.\" The NOT recently crossed out due to superb lobbying of the Pharmacy Guild.\n\nTrent had completed his two-week online certificate in \"Urinary Tract Infection Recognition and Treatment\" from the Australian Institute of Very Specific Studies. In his mind, this made him more qualified than any garden-variety urologist or GP who had to waste time learning about kidneys, prostates, and other irrelevant bits.\n\n\"Next!\" Trent called out, adjusting his stethoscope—which he wore purely for effect since UTIs weren't really a listening sort of condition.\n\nMr Henderson shuffled forward, clutching a pathology form. \"Doctor, I've been having trouble urinating, and I see bl…—\".\n\n\"Ah, say no more!\" Trent interrupted, raising his hand dramatically. \"You've come to the right man, I am a Specialist Utiologist.\"\n\nMr Henderson blinked. \"I thought you were a urologist. Didn't you say—\"\n\n\"Bah,\" Trent scoffed, \"No Sir, a Utiologist, while those so-called 'urologists' are fumbling around with their broad, unfocused knowledge of the entire urinary system, I have laser-focused my expertise on the singular art of UTI mastery,\" his voice echoing off the shelves of Metamucil.\n\n\"My dear friend, I am a Utiologist, a far superior specialisation. Think of it this way—would you rather see someone who knows a little about everything, or someone who knows everything about very little?\"\n\n\"Well, when you put it like that...\" Mr Henderson said, somewhat confused by the proposition. \n\nTrent leaned back in his plastic chair, which he'd strategically positioned to look more important. \"You see Mr Henderson, urologists spend years learning about kidney stones, bladders, enlarged prostates, erectile dysfunction, etc., etc. - amateur hour stuff, really. But can they tell you the precise pH level that E. coli prefers in a bladder environment? Can they recite the seventeen different strains of bacteria that cause cystitis? Probably, but how can you be confident with such a broad speciality\"\n\nHe pulled out a laminated chart he'd made himself, embossed with a large signet that had the acronym ACUP (Australian College of Utilogy Pharmacy), which he was the president of. \"Now, based on your symptom, which I diagnosed faster than any urologist would have,\" he said proudly, unburdened by knowledge of the rest of the urinary system, \"I can tell you're dealing with a classic case of bacterial cystitis.\"\n\n\"Wow!\" declared Mr Henderson, \"I’m truly impressed just how quickly you were able to diagnose my condition.\"\n\nDr Trent looked up proudly at his newly acquired certificate and reassured by his Extended Practice Authority. \"It's all in the details, Mr Henderson. That's the beauty of my speciality; my speciality has removed them — everything leads to UTIs. Burning sensation? UTI. Frequent urination? UTI. Cloudy urine? UTI. Blood? UTI, UTI, UTI. It's really quite elegant in its simplicity, and highly efficient.\"\n\nMr Henderson looked puzzled. \"But, now I am not doubting your brilliance doctor, but what if it's something else?\"\n\n\"Something else?\" Trent laughed heartily. \"My dear man, that's exactly the kind of unfocused thinking that holds back the medical profession. These ‘medical’ doctors waste time considering 'differential diagnoses' and 'comprehensive examinations,'\" his laughter becoming more unrestrained thinking about how ridiculous these medical practitioners truly are. \"I cut straight to the chase.\"\n\nHe reached under his makeshift desk and produced a bottle of cranberry juice and some over-the-counter sachets. \"Here's your treatment plan. This cranberry juice is medical-grade—I get it from the Asian grocer,\" whispering, not wanting the Pharmacy owner to hear. \"And these sachets contain the finest urinary alkalinisers money can buy - $12.99\"\n\n\"Maybe I should just go see a doctor 'of medicine'?\" asked Mr Henderson, somewhat unconvinced by the reassurance Dr Trent was offering.\n\nTrent gasped theatrically. \"A medical doctor? Mr Henderson, I am beyond these doctors. I am a hyper-specialist. Those people are generalists dabbling in UTIs as a side hobby, I have dedicated my entire professional existence to this one noble condition.\"\n\n\"As you wish then doctor, so when should I see you next?\" asked Mr Henderson.\n\n\"Next!\" exclaimed Dr Trent, \"if there is a 'next', it is clearly not something my specialty can help you with, there will be no next, good day sir.\"\n\nMr Henderson stood up, turning to walk down the vitamin aisle and towards the exit. \n\n“Oh wait! I forgot I am allowed to do this now” Dr Trent called taking out is equally decorated prescription pad. “Take this prescription for Cefalexin to the front counter, say you saw Dr Trent, I get a 30 % kick back, I mean escalated responsibility allowance.”\n\n“Thanks...” Mr Henderson walked to the counter, his face filled with uncertainty, taking his cranberry juice and alkalinisers with him.\n\nJust then, Mr Patel the pharmacy owner poked his head around the corner. \"Trent, mate, Mrs Jones is asking if you can help her with a prescription for high blood pressure medication.\"\n\n\"Tell her to find herself a cardiologist!\" Trent called back. \"I don't muddy my expertise with amateur conditions like hypertension. I deal exclusively with…\" this is when Dr Trent had another brilliant idea - God bless the Pharmacy Guild.\n\nA week later Mr Henderson died of late-stage bladder cancer. The Pharmacy Board determined that Dr Trent was practicing within his self defined 'scope of practice' and continues to treat utilogy and heartilogy related conditions to this date.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1ngexrg/dr_trent_the_utiologist_of_pharmacy/",
    "id": "1ngexrg",
    "link_flair_text": "sh8t post :doge:"
  },
  {
    "title": "The Australian on RACP crashout - Article published 30/08/25",
    "author": "Aragornisking",
    "score": 50,
    "num_comments": 23,
    "created_utc": 1756520736.0,
    "created_date": "2025-08-30 12:25:36",
    "selftext": "TITLE: Sickness within: fight for a doctors’ college exposes health’s hidden weakness\n\nBY: Natasha Robinson\n\nTL;DR (it's ridiculously long)\n * The Big Picture\n   * RACP crisis = symptom of a bigger \"sickness\" in all medical colleges.\n   * A clash between modern, skills-based governance and old-school member-led democracy.\n * Jennifer Martin's (Current President) Take\n   * The problem isn't the people, it's the RACP's outdated constitution.\n   * Wants a modern board with real governance skills.\n   * Pushing for a separate President (to represent members) and a separate Chair (to run the board), which is the standard model elsewhere.\n * Sharmila Chandran's (President-Elect) Side\n   * She's accused of \"adversarial and disrespectful behaviour\".\n   * She fiercely denies this.\n   * Frames the fight as a showdown over constitutional changes and fee increases that she believes undermine the will of the members.\n * Broader Context\n   * All medical colleges are facing existential threats.\n   * They no longer have a monopoly on Continuing Professional Development (CPD).\n   * They're under huge pressure from the government to fix workforce shortages.\n * The \"Woke\" and Race Angle\n   * The article brings up \"race politics\" and \"woke causes\" as a factor.\n   * It mentions board member Nada Hamad, who resigned alleging racism at the highest levels.\n   * It also notes that some conservative members believe the RACP has become the \"wokest college\".\n\nMAIN ARTICLE:\n\"Race politics, woke causes and a split on democracy have spilled over in a battle for control of a prestigious medical college. It’s a descent that threatens the important role of colleges as they work to ensure the highest standards in medicine.\n\n\"Behind glossy black doors with golden handles fronting a sandstone building at the high end of the medical quarter on Sydney’s Macquarie Street sit the offices of the Royal Australasian College of Physicians. Inside, wood-panelled walls and plush carpet lead to a musty-smelling medical library filled with rare books, some centuries old. This is the headquarters of one of the largest medical colleges in Australia, which takes its place among a network of storied organisations devoted to upholding the highest standards of training in medicine. Remnants of the medieval guilds in Britain that allowed trades and professions to be self-governing, medical colleges today face unique pressures.\n\n\"The unedifying drama at the RACP this week that followed the college’s board passing a motion of no confidence in its president-elect, Sharmila Chandran, as leaders publicly tore one another apart, stands in arresting contrast to college pomp and ceremony, as well as these organisations’ sombre mission.\n\n\"Chandran stands accused of impeding the work of the RACP’s board through adversarial and disrespectful behaviour and contributing to a toxic culture at the board table, allegations she fiercely denies. The renal physician, who is resisting changes to the RACP’s constitution that she contends would undermine the will of the membership and arguing against fee increases, insists the 30,000-strong amalgam of physicians including pediatricians, infectious diseases doctors, gastroenterologists and neurologists, among other specialists who make up the college’s disparate base, is firmly behind her.\n\n\"“This is designed to destroy the voice of the membership,” Chandran said this week of the attacks on her that came amid a showdown over governance reform. “It’s designed to destroy me.”\n\n\"Some insiders are appalled at Chandran’s treatment but even more disturbed at what they say are irregularities in process and governance at the RACP that highlight abuses of power within the organisation. “It’s just so shambolic and so devoid of integrity,” says one well-placed source. “I don’t even know if the organisation is functional any more. It’s a descent into oblivion.”\n\n\"The RACP has been racked by leadership chaos for years, its critical work as a quasi-regulator of training standards diverted continually by internal division and serious issues of governance breakdown. The college has been investigated by the charities regulator, lawsuits have been filed at 50 paces and reams of material have been placed before corporations regulator the Australian Securities &amp; Investments Commission. Current president Jennifer Martin is attempting to reform the organisation but is herself enmeshed in blocs that have wielded what some say is dictatorial power.\n\n\"Still, Martin’s manifesto for reform, published on independent medico-political news site The Limbic this week, lays out an important case. She argues that doctors can hold their own in theatres and high-stakes health emergencies but are ill-suited to sitting on boards or running large organisations. “Doctors are trained to diagnose and heal, not to govern large, complex organisations responsible for training and safeguarding the profession. I’ve learned this lesson up close,” Martin said. “The truth is, the skills that make us decisive in medicine can make us clumsy elsewhere, at times accompanied by some extreme hubris. The solution does not lie in swapping leaders in and out. It lies in reforming our constitution so that those with governance, finance, risk and culture experience share responsibility with medical leaders. A modern skills-based board, with a separate president who represents the profession and a chair who governs it, is the standard across Australia. We should be no different.”\n\n\"Reform is essential but the ructions at the RACP are playing out across a wider canvas than simply the imperative to modernise governance at one college. Similar toxic politics has marred the work of medical colleges internationally, such as at Britain’s Royal College of Physicians where a vicious battle over the presidency also played out recently. National Health Service consultant physician Louella Vaughan, the author of a two-volume history of the RCP, was at the centre of that drama in London this year when she ran for college vice-president. The Australian-born and trained physician, who has a doctorate in the history of medicine, says medical colleges are highly unusual organisations with complex structures and duality of function as quasi-regulators that set the standards for medical practice but also as membership and professional bodies.\nSince the 1960s, they have been structured as charities. That consultant specialists generally train junior doctors for no remuneration in public hospitals is not sufficient to demonstrate a charitable purpose, Vaughan says. \n\n\"“Increasingly both in Australia and the UK there’s pressure on these organisations to prove they exist for public good,” Vaughan says. “It’s insufficient to say we exist as quasi-regulatory bodies. Colleges, as charities, have to demonstrate good governance and public benefit, which ends up meaning they distort themselves in interesting ways. And the biggest problem ends up being reform of the boards because what you end up seeing is that when you modernise the board, you actually end up making the organisation less democratic in what are meant to be membership organisations. And this exposes the schism, this kind of trick, in colleges. But what counts in law is only the board. The council and all the rest of the stuff which looks democratic, it doesn’t matter at all. Nothing the council says is binding. And lack of board transparency is a really big problem.”\n\n\"Medical colleges have worked extremely hard in recent years to augment their relevance to members and collaborate with governments on training standards, accreditation practice and big national policy such as the import of international medical graduates to areas of need. Governments have long been frustrated at what they have alleged are limits placed on the numbers of specialists in the country, suspecting the colleges pursue a closed-shop agenda to increase their privilege and income, while health systems face increasing numbers of patients and increasing complexity of conditions and treatments. Bitter rows have broken out with state governments when colleges, concerned at endemic bullying, harassment and poor treatment of trainee doctors in some public hospitals, have withdrawn those hospitals’ accreditation to train registrars, leaving the health services critically bereft of staff.\n\n\"Recent regulation change has weakened the colleges’ power, meaning they no longer can they operate entirely as monopolies. Doctors now do not have to be fellows of a college to gain registration as a specialist as they can undertake their continuing professional development in an approved CPD provider anywhere they like. That means colleges must provide value for members in other ways.\n“The CPD changes have come at a huge cost to the colleges,” says Sanjay Jeganathan, president of peak body the Council of Presidents of Medical Colleges, which represents 16 of the nation’s specialist colleges.\n\n\"“The biggest challenge we face is that we are voluntary organisations, they are not funded by anybody except the members. The government wants more workforce. They want more specialists and that’s where the challenge is. In a nutshell, colleges are under enormous pressure to deliver on various fronts, to work with the state and federal government to resolve their workforce issues, and we want to collaborate so that we are reliable partners. I am doing my level best to build positive relationships with health ministers. We are in particular proactively trying to help with rural and regional workforce issues and other matters. But in terms of our core functions, and training more specialists, how do you get more volunteers to do this work? Whichever way you look at it, this volunteer work for colleges is running pretty thin. When there is so much pressure to do more and more, the colleges also need to be agile, more contemporary organisations, and that needs proper functional boards.”\n\n\"The drama at the RACP is the last thing the CPMC needs as it attempts to work with governments amid looming existential threats to colleges’ viability. But the ongoing war at the physicians’ college and the scrutiny it has attracted may be what prompts members to insist on proper governance and an end to the infighting, as awareness grows of what is at stake.\n\n\"Jeganathan’s own college, the Royal Australia New Zealand College of Radiologists, pioneered modern governance reform under his presidency and that college now has an independent chair. The Royal Australasian College of Surgeons, which recently found itself broke amid deep governance problems, also now provides a model for reform. It’s not as unwieldy to govern as the RACP, which incorporates 30 subspecialties, but it has managed to balance democratic process with the imposition of expert governance.\n\n\"Recently, it voted to separate the roles of president and board chair who is a fellow. RACS also managed to navigate successfully the issue that is tearing apart the RACP. The RACS council is elected by the membership, and it has an independent chair. The council then elects a president. Expressions of interest for nominations to the board go out to the whole membership, but nominees must meet a skills matrix criteria.\n\n\"“When we drafted what we thought was an ideal governance model, and when I suggested to the members that the president would not be chairman of the board, it caused an absolute furore,” says RACS president Owen Ung. “Members were raining down on me and they just did not understand that they’re two totally different roles. They were concerned the membership loses its power, all these sorts of concerns. What they don’t understand is they lose their power if their organisation goes under. The College of Physicians has a member-elected president, who then becomes immediately the chairman of their board. That is problematic. Boards have got to elect their own chairman. Boards have got to be cohesive and be able to work together. Popular votes don’t work. They only have a few hundred people that end up voting for the president position. You can get a gerrymander and get in anybody you want. So that’s their problem, and it’s tied into their constitution. They need to change it.”\n\n\"Viewed from the perspective of functional colleges, Chandran’s insistence on the pure operation of what might be described as a fairyland version of democracy at the RACP may appear naive. She faces an upcoming potential extraordinary general meeting that could block her from taking up the post of president next May. She has placed the emphasis firmly on representation at the top that reflects a diverse membership. That’s important as a concept on its face, but the undertones of identity politics are unavoidable.\nFellow board member Nada Hamad, who resigned this week, stated the issue outright, alleging racism at the highest levels of the college. That rankles Jeganathan. “When things don’t go their way, people of colour scream racism and use it as a tool to silence others,” he says. “As a person of colour I do not see this as an issue at the top levels of the colleges, however it may be an issue for junior trainees.”\n\n\"Race does become a relevant factor when considering colleges’ purposes as charitable organisations. That’s because, in the attempt to carve out charitable purposes, some of these training bodies have taken up issues far wide of their raison d’etre as the medical standards setters. A focus on research is one of the uncontroversial wider purposes of colleges. Activism over a suite of what some describe as “woke” causes including an obsession with performative cultural sensitivity and issues of racial justice that extend well beyond healthcare is an entirely different matter and this has annoyed some within medicine’s conservative establishment. They allege the RACP is the wokest college.\n\n\"“These organisations get very self-involved with themselves as to what it means to be charities, as opposed to what does it mean to be a quasi-regulatory body, or what does it mean to be a membership body?” says Vaughan.\n\n\"From her perspective within the crumbling NHS, Vaughan says the most alarming thing about the RACP drama, as well as the very concerning allegations of irregular practice, is that it comes amid seismic changes that are diluting standards in medicine to a dangerous extent. That includes not only the lowering of the bar for international medical graduates but also workforce substitution, which has been a disaster in the case of physician assistants in Britain. Australia has seen the start of the trend in particular in pharmacy prescribing.\n\n\"Colleges must get their houses in order to be as strong and influential as they can in the face of the coming onslaught. As Vaughan says, it’s in governments’ interests to have a complaisant medical profession, less able to resist the erosion of quality and standards. And the RACP stoush plays right into governments’ hands.\n\n\"For patients, strong medical colleges are the only bulwark against these trends. One day, their own lives may depend on it.\"\n\nENDS \n\nArticle link: https://www.theaustralian.com.au/health/medical/sickness-within-fight-for-a-doctors-college-exposes-healths-hidden-weakness/news-story/e933aed5e954150e92f7251c6bd989cf\n\nOriginal threads: https://www.reddit.com/r/ausjdocs/s/rsGA3CO5Tg\nhttps://www.reddit.com/r/ausjdocs/comments/1n2dial/racp_crashout_update_dr_chandran_speaks_to_the/\n\nOriginal Substack (my editorialising is you're interested, I'll be adding more in the comments): https://open.substack.com/pub/drmattpaed/p/the-racps-reckoning-a-house-divided?utm_source=share&amp;utm_medium=android&amp;r=4tv7ip",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1n3q8it/the_australian_on_racp_crashout_article_published/",
    "id": "1n3q8it",
    "link_flair_text": "news🗞️"
  },
  {
    "title": "Is patient privacy not a thing in pharmacy",
    "author": "Astronomicology",
    "score": 57,
    "num_comments": 37,
    "created_utc": 1755210767.0,
    "created_date": "2025-08-15 08:32:47",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1mqfjss/is_patient_privacy_not_a_thing_in_pharmacy/",
    "id": "1mqfjss",
    "link_flair_text": "WTF🤬"
  },
  {
    "title": "#deepfakedoctors - see a real GP.",
    "author": "Fun_Consequence6002",
    "score": 20,
    "num_comments": 3,
    "created_utc": 1747857015.0,
    "created_date": "2025-05-22 05:50:15",
    "selftext": "I know it's referring to ai. However, if this isn't the best way to refer to all scope creepers like the pharmacy guild I will eat many hats.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1ks79oh/deepfakedoctors_see_a_real_gp/",
    "id": "1ks79oh",
    "link_flair_text": "other 🤔"
  },
  {
    "title": "Pharmacy Guild coming to you from the Chairman’s Lounge",
    "author": "jps848384",
    "score": 15,
    "num_comments": 1,
    "created_utc": 1746035779.0,
    "created_date": "2025-05-01 03:56:19",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1kbmw4u/pharmacy_guild_coming_to_you_from_the_chairmans/",
    "id": "1kbmw4u",
    "link_flair_text": "WTF🤬"
  },
  {
    "title": "Breaking news elective surgeries back on",
    "author": "Akubra-angel",
    "score": 805,
    "num_comments": 138,
    "created_utc": 1744011782.0,
    "created_date": "2025-04-07 17:43:02",
    "selftext": "The Pharmacy Guild is ready to save the day during the planned 3 day doctor strike having just learnt to cannulate, intubate and resuscitate. ",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1jtfsko/breaking_news_elective_surgeries_back_on/",
    "id": "1jtfsko",
    "link_flair_text": "sh8t post :doge:"
  },
  {
    "title": "Queensland patients' access to health services in community pharmacies made permanent",
    "author": "Astronomicology",
    "score": 19,
    "num_comments": 4,
    "created_utc": 1742549209.0,
    "created_date": "2025-03-21 20:26:49",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1jgctm3/queensland_patients_access_to_health_services_in/",
    "id": "1jgctm3",
    "link_flair_text": "news🗞️"
  },
  {
    "title": "Another day, another MP bends the knee",
    "author": "DoctorSpaceStuff",
    "score": 48,
    "num_comments": 64,
    "created_utc": 1738823553.0,
    "created_date": "2025-02-06 17:32:33",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1iiwb2x/another_day_another_mp_bends_the_knee/",
    "id": "1iiwb2x",
    "link_flair_text": "General Practice🥼"
  },
  {
    "title": "This powerful lobby group claimed 665 pharmacies would close. Here’s what really happened",
    "author": "BPTisforme",
    "score": 85,
    "num_comments": 35,
    "created_utc": 1735507707.0,
    "created_date": "2024-12-30 08:28:27",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1hp6cu5/this_powerful_lobby_group_claimed_665_pharmacies/",
    "id": "1hp6cu5",
    "link_flair_text": "Support "
  },
  {
    "title": "AHPRA Parental Leave Fees Cut - Credit where it's due to Dr Belle Sasse",
    "author": "RattIed_doc",
    "score": 55,
    "num_comments": 5,
    "created_utc": 1733820912.0,
    "created_date": "2024-12-10 19:55:12",
    "selftext": "https://www.ausdoc.com.au/news/junior-doctor-challenges-ahpra-over-registration-fees-and-parental-leave/\n\nTo follow on from the post about AHPRAs parental leave fees cut I think it's important to give credit where it's due and to show the benefit of taking action and working to create change. The copy and paste from the article is :\n\nWhen third-year oncology registrar Dr Belle Sasse took maternity leave last year, she took non-practising status to cut her registration fees to around $200 a year.\n\nThis month, she had to return to work to ensure she met her training requirements. But there was a problem.\n\nIt was just two weeks before AHPRA started accepting renewals for the 2024/25 registration year, meaning she faced a full annual fee of $995 so she could be registered for just two weeks of 2023/24.\n\nBarely a month later, she would have to renew for the next year — another $995.\n\n“If I had delayed my return by two weeks in order to avoid paying AHPRA almost $1000, at the end of the year, I would be two weeks short of my training requirements … so I would have to apply and take a registrar job in 2026 instead of becoming a fellow,” she explained.\n\n“People should be charged for the portion of the year they are actually working because AHPRA is not providing any kind of service to doctors who are on parental leave; they are not actively practising.”\n\nShe asked AHPRA about paying a pro-rata fee but was told this was not an option.\n\nInstead, she had to “thread the needle” by switching to full-time work so she could renew her registration in the next renewal period and still train for long enough to have a chance of fellowship.\n\nNow, she has gone to the National Health Practitioner Ombudsman, Minister for Health and Aged Care Mark Butler and independent MP Dr Monique Ryan calling for change.\n\nAt the same time, AMA Victoria is also petitioning AHPRA to review fee structure.\n\nThe petition has received 2400 signatures and was endorsed by organisations including the Pharmacy Guild of Australia, plus every AMA except NSW.\n\nAMA Victoria president Dr Jill Tomlinson said AHPRA had told her in June it was considering the issue, but it had not responded to her request to meet AMA Victoria representatives.\n\n\n“We are disappointed that they have not, at this time, agreed to meet, and we are disappointed that their response has solely been to indicate they will review this matter,” she said.\n\nThe plastic surgeon said AHPRA’s fee policy was “inequitable and discriminatory”.\n\n“It puts a greater fee burden on individuals who take parental leave, and it encourages individuals to take up non-practising registration and therefore takes them out of the healthcare workforce in a setting where we have … shortages across Australia,” she said.\n\nShe said AHPRA should add a separate registration category for parental leave with “a very fast turnaround when somebody indicates that they wish to return to the workforce”.\n\nNeurologist-turned-MP Dr Monique Ryan told AusDoc she was backing the doctors’ campaign.\n\nShe said she had contacted AHPRA but with no response so far.\n\n\n“The regulatory board for medical professionals in this country should not be focused on collecting money to support itself,” she said.\n\n“It should be focused on its oversight of the professional actions of health professionals.\n\n“There has long been disquiet in the medical profession regarding AHPRA’s activities.\n\n“It is often perceived as opaque, slow and injudicious.”\n\nA spokesperson for AHPRA told AusDoc that it had “heard the calls for fee relief from practitioners”.\n\n“[However] we also need to maintain the capacity of the national scheme to regulate those professions to protect the public, noting we are a practitioner-funded regulatory scheme.\n\n“We also understand that practitioners are affected by issues related to moving between practising and non-practising registration, and as part of our review, we are looking at ways to simplify this.”\n\nAsked whether doctors earned enough to absorb registration fees, Dr Sasse said it was nuanced.\n\n“There are many doctors who are very well remunerated for whom this fee does not represent any kind of barrier,” she said.\n\n“But if you have been on maternity leave for 12 months and have not earned an income, if you were working part-time before you went on maternity leave, if you were in training … you can quickly run out of your savings.\n\n“That is why we are asking for it to be pro-rata; we are not asking for it to be free.”\n\n",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1haxm61/ahpra_parental_leave_fees_cut_credit_where_its/",
    "id": "1haxm61",
    "link_flair_text": "News"
  },
  {
    "title": "How profitable are GP surgeries? Is investing in a GP clinic as a non GP a good idea?",
    "author": "Many_Ad6457",
    "score": 33,
    "num_comments": 30,
    "created_utc": 1732513448.0,
    "created_date": "2024-11-25 16:44:08",
    "selftext": "I have a non medical friend who dropped out of uni to help run his dads GP practice (yep). \n\nHis father has a clinic with  8 or 9 doctors and some visiting specialists. They have an imaging centre attached with a CT scanner, there’s a pharmacy and dental clinic. \n\nMy friend claims they make more than 2 or 3 million a year. He wants to expand the practice and asked me if I want to invest.\n\nI am not planning on investing but I’m wondering if a well run clinic can actually yield that much profit for just one person? In this case my friend or his dad. \n\nWho owns the imaging machines in these situations? Who owns the pharmacy and dental clinics? Are the other GPS usually just leasing rooms or are they also co-owners?",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1gzbvyf/how_profitable_are_gp_surgeries_is_investing_in_a/",
    "id": "1gzbvyf",
    "link_flair_text": "General Practice "
  },
  {
    "title": "Queensland Health to review pharmacy contraceptive pill trial",
    "author": "hustling_Ninja",
    "score": 9,
    "num_comments": 16,
    "created_utc": 1732234384.0,
    "created_date": "2024-11-22 11:13:04",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1gwukqx/queensland_health_to_review_pharmacy/",
    "id": "1gwukqx",
    "link_flair_text": "News"
  },
  {
    "title": "COVID vaccine frequency for healthcare staff",
    "author": "Wooden-Anybody6807",
    "score": 11,
    "num_comments": 9,
    "created_utc": 1727049467.0,
    "created_date": "2024-09-23 09:57:47",
    "selftext": "Upon attempting to book my routine 6 month COVID booster today, I saw that the guidelines now say \"You can consider a further COVID-19 vaccine dose every 12 months based on a risk-benefit assessment.\" Has anyone else tried to get a booster recently and been successful despite not having waited the full 12 months?\n\n  \nEdit: Ok I just called Priceline Pharmacy and they said yes you can still get the boosters 6 monthly if you want. I'm just leaving this post up now to help other people who also might have the same question.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1fn7blp/covid_vaccine_frequency_for_healthcare_staff/",
    "id": "1fn7blp",
    "link_flair_text": "Support "
  },
  {
    "title": "Queensland Election, NPs &amp; Pharmacy Prescribing",
    "author": "smoha96",
    "score": 35,
    "num_comments": 16,
    "created_utc": 1726182581.0,
    "created_date": "2024-09-13 09:09:41",
    "selftext": "I've just caught on the radio this morning, an interview with RACGP Qld Faculty Council Chair, Dr Cath Hester, talking about the RACGPs hopes/requests of whomever is elected after the October Qld state election.\n\nThe topics included strategies to attract and retain GP registrars, GP access to continuing prescribing of stimulants for ADHD for patients after they turn 18, roaccutane prescribing, and the expansion of practice for pharmacy prescribing and nurse practioners.\n\nI was very disappointed to hear the radio presenter imply that this last concern was simply a lobbying effort for a 'turf war'. To paraphrase, they said: \"*This is where I start to wonder if you are a healthcare advocacy group or a union for doctors.*\", and saying that Dr Hester didn't have any other ideas, and imo, imply that concerns for patient safety were overblown in favour of lobbying - this last one was not explicitly said, and is my interpretation from the conversation. \n\nA very disappointing interview. Dr Hester held herself up incredibly professionally.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1ffg5ul/queensland_election_nps_pharmacy_prescribing/",
    "id": "1ffg5ul",
    "link_flair_text": "News"
  },
  {
    "title": "Pharmacy altering scripts",
    "author": "DoctorSpaceStuff",
    "score": 48,
    "num_comments": 32,
    "created_utc": 1724628439.0,
    "created_date": "2024-08-26 09:27:19",
    "selftext": "Venting my frustrations with a recent encounter with one of the large pharmacy chains. Patient's pathology indicated that treatment was necessary with a commonly used medication for which they did not meet the population criteria for a PBS script.\n\nAs such they were given a private script, and they understood this, and agreed. Not an expensive drug, patient definitely not experiencing financial hardship. The patient returned today and advised that big chain pharmacy said \"they made it a PBS script to knock a couple of bucks off the price\".\n\nI believe that this is reportable and I'll be following up with it. I have a good relationship with my smaller local pharmacies and have never had an issue like this. Is it commonplace with the big chains?",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1f19zov/pharmacy_altering_scripts/",
    "id": "1f19zov",
    "link_flair_text": "Opinion"
  },
  {
    "title": "Shannon Fentiman on pharmacy scope of practice pilot in QLD",
    "author": "joon848384",
    "score": 40,
    "num_comments": 61,
    "created_utc": 1721980110.0,
    "created_date": "2024-07-26 17:48:30",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1ecien9/shannon_fentiman_on_pharmacy_scope_of_practice/",
    "id": "1ecien9",
    "link_flair_text": "News"
  },
  {
    "title": "Qld pharmacy pilot includes wound mgmt administration of lidocaine and suturing",
    "author": "Signal-Kale-9273",
    "score": 46,
    "num_comments": 41,
    "created_utc": 1718593759.0,
    "created_date": "2024-06-17 13:09:19",
    "selftext": "Has anyone seen the clinical guidelines for the pharmacy extended scope of practice pilot in Qld ?\n\nI haven't sussed out every guideline but the wound management one involves administration of 1% lidocaine and suturing. Which is wild ...\n\nQld seems to have lost the plot....\n\nhttps://www.health.qld.gov.au/clinical-practice/guidelines-procedures/community-pharmacy-pilots/resources/clinical\n\nhttps://www.health.qld.gov.au/__data/assets/pdf_file/0026/1304396/wound-management-guideline.pdf\n\n",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1dhodbv/qld_pharmacy_pilot_includes_wound_mgmt/",
    "id": "1dhodbv",
    "link_flair_text": "General Practice "
  },
  {
    "title": "State budget delivers $6M for full-scope training to QLD community pharmacies",
    "author": "hustling_Ninja",
    "score": 6,
    "num_comments": 5,
    "created_utc": 1718189326.0,
    "created_date": "2024-06-12 20:48:46",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1de3oq5/state_budget_delivers_6m_for_fullscope_training/",
    "id": "1de3oq5",
    "link_flair_text": "News"
  },
  {
    "title": "Pharmacy academic Prof Lisa Nissen leading scope of practice review’s $1.2 million research team",
    "author": "hustling_Ninja",
    "score": 23,
    "num_comments": 17,
    "created_utc": 1715333562.0,
    "created_date": "2024-05-10 19:32:42",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1colhcl/pharmacy_academic_prof_lisa_nissen_leading_scope/",
    "id": "1colhcl",
    "link_flair_text": null
  },
  {
    "title": "Prescribing for partner ",
    "author": "ChampionExciting7016",
    "score": 13,
    "num_comments": 38,
    "created_utc": 1711620424.0,
    "created_date": "2024-03-28 21:07:04",
    "selftext": "Current RMO, wondering what the rules are around prescribing something common like antiemetics for my partner? Am I able to just write on any piece of paper her details + my details and prescriber number and a pharmacy will accept it? \n\n\nEdit: Had heard of other people doing it to renew friends/partners scripts or get antiemetics for a hangover but also felt like it was a bad idea. This was all I needed to confirm that. Thanks team! 😅",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1bprwk2/prescribing_for_partner/",
    "id": "1bprwk2",
    "link_flair_text": "other "
  },
  {
    "title": "Old but gold ",
    "author": "adognow",
    "score": 77,
    "num_comments": 6,
    "created_utc": 1710720802.0,
    "created_date": "2024-03-18 11:13:22",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1bhd669/old_but_gold/",
    "id": "1bhd669",
    "link_flair_text": "Gen Med"
  },
  {
    "title": "RACGP - Shingles management added to pharmacy prescribing pilot",
    "author": "hustling_Ninja",
    "score": 36,
    "num_comments": 49,
    "created_utc": 1708423544.0,
    "created_date": "2024-02-20 21:05:44",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1ave71e/racgp_shingles_management_added_to_pharmacy/",
    "id": "1ave71e",
    "link_flair_text": "News"
  },
  {
    "title": "New intern, have just received an SLS report",
    "author": "Battle_Dapper",
    "score": 25,
    "num_comments": 25,
    "created_utc": 1706527910.0,
    "created_date": "2024-01-29 22:31:50",
    "selftext": "As per the title, I’m a new intern who just started on my ED rotation 1.5 weeks ago. I just got an email from the pharmacy team leader about an SLS (safety learning system) report and am meeting with her tomorrow. I am not too sure what this is about, but I strongly suspect it was about an incident earlier last week where nursing staff were kicking up a big fuss about a chronic back pain patient whose pain was poorly controlled on multiple opioids. We tried all types of different pain medications including tapentadol but her pain was still bad. When we tried to give her more pain relief, we received pushback from nursing staff saying they were uncomfortable administering more opioids etc. in the end the patient was admitted to the gen med wards as she failed PT review. I think the nurses were also unhappy as my consultant was trying to discharge the patient but they did not feel like she would be able to cope at home and would just come back to the ED. \n\nRegardless of what the report is for, I am feeling very anxious and worried about this. Can someone please tell me if this will affect my ability to pass internship, I really dont want to fail because of this. I am also shocked that this has happened so quickly into the year, didn’t think it would happen to me🥲. Has anyone else gotten one before/what is the outcome of this?",
    "url": "https://old.reddit.com/r/ausjdocs/comments/1adt7se/new_intern_have_just_received_an_sls_report/",
    "id": "1adt7se",
    "link_flair_text": "Support "
  },
  {
    "title": "Writing private scripts",
    "author": "adognow",
    "score": 15,
    "num_comments": 29,
    "created_utc": 1698915314.0,
    "created_date": "2023-11-02 19:55:14",
    "selftext": "Asking for a bored friend. Can you do it on say, the back of a receipt or a paper napkin, or will most pharmacies only accept it on official pbs stationary even as a private script?\n\nI had a professor (pretty ancient dude) in med school once tell the class that he did it with a receipt and wrote a script for himself when he ran out while on an interstate holiday. Probably a long time ago when there was no national regulator I suppose.",
    "url": "https://old.reddit.com/r/ausjdocs/comments/17lz62d/writing_private_scripts/",
    "id": "17lz62d",
    "link_flair_text": "Research"
  },
  {
    "title": "RACGP - Pharmacy prescribing decision ‘makes no sense’",
    "author": "hustling_Ninja",
    "score": 19,
    "num_comments": 16,
    "created_utc": 1695632603.0,
    "created_date": "2023-09-25 19:03:23",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/16rmwll/racgp_pharmacy_prescribing_decision_makes_no_sense/",
    "id": "16rmwll",
    "link_flair_text": "News"
  },
  {
    "title": "PSA: pholcodine no longer available in Australia",
    "author": "hustling_Ninja",
    "score": 19,
    "num_comments": 6,
    "created_utc": 1694221493.0,
    "created_date": "2023-09-09 11:04:53",
    "selftext": "\"Following a safety investigation by the Therapeutic Goods Administration (TGA), 55 products containing pholcodine are being cancelled from the Australian Register of Therapeutic Goods and those currently on pharmacy shelves are being recalled from pharmacies.\n\nThe cancellation and recall actions are being taken because of a link between pholcodine-containing medicines and an increased risk of anaphylactic reactions (a sudden, severe and life-threatening allergic reaction) to certain medicines used as muscle relaxants during general anaesthesia (called neuromuscular blocking agents).\n\nPholcodine has been used in a wide range of over the counter pharmacy medicines to treat non-productive (dry) cough, particularly in syrups and lozenges. It is also used in combination with other medicines in products that treat the symptoms of cold and flu...\"\n\n&amp;#x200B;\n\n[TGA](https://www.tga.gov.au/news/media-releases/pholcodine-cough-medicines-cancelled-tga-and-recalled-pharmacies-safety-reasons)",
    "url": "https://old.reddit.com/r/ausjdocs/comments/16ds160/psa_pholcodine_no_longer_available_in_australia/",
    "id": "16ds160",
    "link_flair_text": "News"
  },
  {
    "title": "AHPRA general registration fees for health professionals 2022/23",
    "author": "hustling_Ninja",
    "score": 4,
    "num_comments": 6,
    "created_utc": 1693031563.0,
    "created_date": "2023-08-26 16:32:43",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/vzpcf53zfekb1.png?width=1766&amp;format=png&amp;auto=webp&amp;s=95d5a4027854b70edeb170cfbeb83632d5351461",
    "url": "https://old.reddit.com/r/ausjdocs/comments/161ndb4/ahpra_general_registration_fees_for_health/",
    "id": "161ndb4",
    "link_flair_text": "Finance"
  },
  {
    "title": "Pharmacy option for UTI diagnosis for Western Australian women",
    "author": "hustling_Ninja",
    "score": 4,
    "num_comments": 3,
    "created_utc": 1691401826.0,
    "created_date": "2023-08-07 19:50:26",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/15kg1o6/pharmacy_option_for_uti_diagnosis_for_western/",
    "id": "15kg1o6",
    "link_flair_text": "News"
  },
  {
    "title": "RACGP - Big Tobacco’s new push into pharmacy vapes",
    "author": "hustling_Ninja",
    "score": 6,
    "num_comments": 1,
    "created_utc": 1690453114.0,
    "created_date": "2023-07-27 20:18:34",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/15ay18o/racgp_big_tobaccos_new_push_into_pharmacy_vapes/",
    "id": "15ay18o",
    "link_flair_text": "News"
  },
  {
    "title": "One in 10 pharmacies will shut if GPs write 60-day scripts, analysis claims",
    "author": "hustling_Ninja",
    "score": 136,
    "num_comments": 270,
    "created_utc": 1687420988.0,
    "created_date": "2023-06-22 18:03:08",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/ysu1qjw6k57b1.png?width=1922&amp;format=png&amp;auto=webp&amp;s=1e2a917b12994ea3dab9ed860d366262ccc0357c\n\nhttps://preview.redd.it/xgqw0gb8k57b1.png?width=1914&amp;format=png&amp;auto=webp&amp;s=926d3f2f6a6eec6b326f84340232c0771199c950\n\n[https://www.ausdoc.com.au/news/one-in-10-pharmacies-will-shut-if-gps-write-60-day-scripts-analysis-shows/](https://www.ausdoc.com.au/news/one-in-10-pharmacies-will-shut-if-gps-write-60-day-scripts-analysis-shows/)",
    "url": "https://old.reddit.com/r/ausjdocs/comments/14fx87s/one_in_10_pharmacies_will_shut_if_gps_write_60day/",
    "id": "14fx87s",
    "link_flair_text": "News"
  },
  {
    "title": "‘Thought bubble’ or the new bulk billing? Controversy rages over pharmacy prescribing",
    "author": "hustling_Ninja",
    "score": 12,
    "num_comments": 4,
    "created_utc": 1686233120.0,
    "created_date": "2023-06-09 00:05:20",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/144a80o/thought_bubble_or_the_new_bulk_billing/",
    "id": "144a80o",
    "link_flair_text": "News"
  },
  {
    "title": "Is GP clinic a profitable business?",
    "author": "hustling_Ninja",
    "score": 38,
    "num_comments": 57,
    "created_utc": 1686188198.0,
    "created_date": "2023-06-08 11:36:38",
    "selftext": "I don't know how many GP practice owners are on this sub but it's an interesting question to ask.\n\nIs GP clinic actually profitable?\n\nI see varying sizes of GP clinics from Super clinics with all the attachments (physio, radiology, pathology, pharmacy etc) to single GP practice.\n\nI've also heard of places where owner of the practice isn't even a doctor.\n\nI wonder whether its actually worth it to be a practice owner in current climate. Esp with all the pay roll tax shenanigans\n\n&amp;#x200B;\n\nhttps://preview.redd.it/de80ngzj6p4b1.png?width=1872&amp;format=png&amp;auto=webp&amp;s=d868cbeb07ea417b1a33b0bfe4d0c3c0613a97b3\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ubqw45yq6p4b1.png?width=1886&amp;format=png&amp;auto=webp&amp;s=9467867ad3fa5f457a914035e7569195b5eea1df\n\n&amp;#x200B;\n\nhttps://preview.redd.it/k4hosyns6p4b1.png?width=1888&amp;format=png&amp;auto=webp&amp;s=1f3ed2ec3142520787b0f0a62f0fd0ee039f50cc\n\nhttps://preview.redd.it/fbpc739w6p4b1.png?width=1892&amp;format=png&amp;auto=webp&amp;s=257cc244b1c33e5b4c837cb86dd76484dbdeaa59\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ozdc15kx6p4b1.png?width=1900&amp;format=png&amp;auto=webp&amp;s=b3d3131580a7e3abbe49be17aa2fbdc7535adbf3\n\nhttps://preview.redd.it/jxj0f1ry6p4b1.png?width=1898&amp;format=png&amp;auto=webp&amp;s=42b74e62ecf776003ea1a3a8c99cc5b69e56ab6b\n\nhttps://preview.redd.it/ou0mkut27p4b1.png?width=1892&amp;format=png&amp;auto=webp&amp;s=1dde4828f392cdbcb02b237f76b3a7cb36a85192\n\nhttps://preview.redd.it/hf49lhl47p4b1.png?width=1888&amp;format=png&amp;auto=webp&amp;s=589b58a6c37d3fa39512b61da56bce33f9006f29\n\nhttps://preview.redd.it/yfzxtft67p4b1.png?width=1916&amp;format=png&amp;auto=webp&amp;s=b1906fe546fcbf2d9fecb1c339f42a81c393cb2a\n\n[https://www.ausdoc.com.au/news/ausdoc-special-report-general-practice-and-its-battle-with-the-existential-threat-of-payroll-tax/](https://www.ausdoc.com.au/news/ausdoc-special-report-general-practice-and-its-battle-with-the-existential-threat-of-payroll-tax/)\n\n&amp;#x200B;\n\n&amp;#x200B;",
    "url": "https://old.reddit.com/r/ausjdocs/comments/143vkl6/is_gp_clinic_a_profitable_business/",
    "id": "143vkl6",
    "link_flair_text": "General Practice "
  },
  {
    "title": "Should I pursue medicine?",
    "author": "kikibananascray",
    "score": 5,
    "num_comments": 18,
    "created_utc": 1686065442.0,
    "created_date": "2023-06-07 01:30:42",
    "selftext": "I’ve always had a passion for medicine (having previously worked in a small community pharmacy for 8 years, patching up the locals and providing advice) as well as a general passion and “one day” mentality.\n\nI’m 30 and currently working in upper management (ICT), comfortably working 70 hours a fortnight and making around 140k gross annually with plenty of perks and flexibility.\n\nI want to get into medicine because it’s always been the true career I want (actually being able to help people), and the place I see myself being happiest - but my question is whether the pay will be worth the hard slog to get there? I see so many conflicting pay scales online and whilst money isn’t the deciding factor, it definitely has to be part of the decision if I’m going to upend my life to pursue it. Of course I can’t say for certain what my speciality will be (as I’m sure it will be heavily influenced by internships and clinical rotations), I’m most interested in general practice, ob/gyn, or emergency medicine. \n\nSome additional info: childless and will remain so, have a mortgage, have partner who earns same wage and will continue working to support me throughout study. \n\nTLDR: currently earning low 6 figures in comfy job, but want to study medicine - is it a stupid financial decision in the long term?",
    "url": "https://old.reddit.com/r/ausjdocs/comments/142jo4l/should_i_pursue_medicine/",
    "id": "142jo4l",
    "link_flair_text": "Opinion"
  },
  {
    "title": "The Pharmacy Guild of Australia says the government&amp;#x27;s 60-day script policy will worsen medicine shortages. What does the data say?",
    "author": "hustling_Ninja",
    "score": 15,
    "num_comments": 3,
    "created_utc": 1685313976.0,
    "created_date": "2023-05-29 08:46:16",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/13udgzi/the_pharmacy_guild_of_australia_says_the/",
    "id": "13udgzi",
    "link_flair_text": "News"
  },
  {
    "title": "Prescription repeats include political statements",
    "author": "hustling_Ninja",
    "score": 15,
    "num_comments": 8,
    "created_utc": 1685274444.0,
    "created_date": "2023-05-28 21:47:24",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/13tyini/prescription_repeats_include_political_statements/",
    "id": "13tyini",
    "link_flair_text": "News"
  },
  {
    "title": "UTI trial the latest front in 'turf war' between Pharmacy Guild and peak GP group",
    "author": "hustling_Ninja",
    "score": 30,
    "num_comments": 87,
    "created_utc": 1685161471.0,
    "created_date": "2023-05-27 14:24:31",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/13sxtgq/uti_trial_the_latest_front_in_turf_war_between/",
    "id": "13sxtgq",
    "link_flair_text": "News"
  },
  {
    "title": "Pharmacy advocate in tears over prescription changes",
    "author": "hustling_Ninja",
    "score": 18,
    "num_comments": 15,
    "created_utc": 1683362016.0,
    "created_date": "2023-05-06 18:33:36",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/139gz1n/pharmacy_advocate_in_tears_over_prescription/",
    "id": "139gz1n",
    "link_flair_text": "News"
  },
  {
    "title": "Nearly 200 women wrongly treated for recurrent UTIs in Queensland pharmacy pilot: new report",
    "author": "hustling_Ninja",
    "score": 44,
    "num_comments": 6,
    "created_utc": 1683104766.0,
    "created_date": "2023-05-03 19:06:06",
    "selftext": "&amp;#x200B;\n\n*Processing img hr7inb0iimxa1...*\n\n*Processing img k6knrufjimxa1...*",
    "url": "https://old.reddit.com/r/ausjdocs/comments/136f6v6/nearly_200_women_wrongly_treated_for_recurrent/",
    "id": "136f6v6",
    "link_flair_text": "News"
  },
  {
    "title": "Govt cuts red tape for vaping prescribers, bans non-prescription sales",
    "author": "hustling_Ninja",
    "score": 7,
    "num_comments": 1,
    "created_utc": 1683008120.0,
    "created_date": "2023-05-02 16:15:20",
    "selftext": "&amp;#x200B;\n\n[https:\\/\\/www.ausdoc.com.au\\/news\\/govt-cuts-red-tape-for-vaping-prescribers-bans-non-prescription-sales\\/](https://preview.redd.it/3bpr64yj1dxa1.png?width=1926&amp;format=png&amp;auto=webp&amp;s=7b9f6facf32b457bb8cd6c0696f5fde4fb4e0942)\n\n[https:\\/\\/www.ausdoc.com.au\\/news\\/govt-cuts-red-tape-for-vaping-prescribers-bans-non-prescription-sales\\/](https://preview.redd.it/ftehpt6n1dxa1.png?width=1896&amp;format=png&amp;auto=webp&amp;s=980643e6473faf2c718a4c250fa969d07d0d9498)",
    "url": "https://old.reddit.com/r/ausjdocs/comments/135d0q5/govt_cuts_red_tape_for_vaping_prescribers_bans/",
    "id": "135d0q5",
    "link_flair_text": "News"
  },
  {
    "title": "Woolies is now offering $45 GP telehealth consults",
    "author": "hustling_Ninja",
    "score": 9,
    "num_comments": 11,
    "created_utc": 1679463376.0,
    "created_date": "2023-03-22 16:36:16",
    "selftext": "&amp;#x200B;\n\n[https:\\/\\/www.ausdoc.com.au\\/news\\/woollies-is-now-offering-45-gp-telehealth-consults\\/](https://preview.redd.it/xxt1fzyb98pa1.png?width=1918&amp;format=png&amp;auto=webp&amp;s=c8e1462953323f1486a7b7ce6dcc7e86bf7c855c)",
    "url": "https://old.reddit.com/r/ausjdocs/comments/11y8f8b/woolies_is_now_offering_45_gp_telehealth_consults/",
    "id": "11y8f8b",
    "link_flair_text": "News"
  },
  {
    "title": "‘Out of control’: RACGP says pharmacy guild president should consider standing down",
    "author": "hustling_Ninja",
    "score": 20,
    "num_comments": 4,
    "created_utc": 1674202311.0,
    "created_date": "2023-01-20 19:11:51",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/10grdgv/out_of_control_racgp_says_pharmacy_guild/",
    "id": "10grdgv",
    "link_flair_text": "News"
  },
  {
    "title": "No reason to fear: GPs should embrace pharmacy prescribing, says Dr Nick Coatsworth",
    "author": "hustling_Ninja",
    "score": 8,
    "num_comments": 3,
    "created_utc": 1669268764.0,
    "created_date": "2022-11-24 16:46:04",
    "selftext": "",
    "url": "https://old.reddit.com/r/ausjdocs/comments/z3bofz/no_reason_to_fear_gps_should_embrace_pharmacy/",
    "id": "z3bofz",
    "link_flair_text": "news"
  }
]