{
  "1owkkre": {
    "post_id": "1owkkre",
    "post_info": {
      "title": "Hospital pharmacist",
      "selftext": "Hey docs, I’m a newly registered hospital pharmacist and wanted to get a better sense of how we can work more effectively with the medical team. From your experience, what can pharmacists do that’s genuinely helpful (if you’ve had any encounters with us) and what things could we improve on to make your jobs easier?",
      "score": 9,
      "num_comments": 37
    },
    "comments": [
      {
        "author": "lolkitty91",
        "body": "It would be a massive value add if the pharmacist could ascertain an up to date accurate medication list that’s essentially gospel, notify re missing regular inpatient meds, identify adherence issues and safety net interactions or side effects the medical team may have missed, ensure scripts and supply on discharge.",
        "score": 61,
        "created_utc": 1763088215.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "DrPipAus",
            "body": "All of this, especially ‘in a timely manner’. Patients being discharged having to wait for scripts/meds can significantly affect bed flow. \nI would add, letting the drs know if something is not available and what an alternative may be. Especially with recent drug shortages in the community. Im sure you understand the frustrations for patients if the drug isn’t actually available, and for staff. Being an emergency physician and getting a call from the community from/about a patient I don’t know, who has been discharged from a ward stay, needing a different script because the med isn’t available and its now after hours, and is it important, and if not you, then who, because the treating team has all gone home and no one else is answering their phone.",
            "score": 12,
            "created_utc": 1763091580.0,
            "depth": 1,
            "is_submitter": false,
            "replies": [
              {
                "author": "Hongkongjai",
                "body": "I’d image the ward pharmacists are already trying to do things as quickly as possible. But sometimes there’s something on the script that needs to be fixed, and they have to get someone to fix it. Or the discharge med is being dispensed and it’s out of the ward pharmacists’ control really.\n\nAs for shortage it’s complicated because that is officially out of stock may not be actually out of stock in the community, and the reverse can also be true. I don’t know if your pharmacists meet up before their shift to get updated on what is out of stock now, but if they do maybe ask if they can make a list for the ward as well? Otherwise you can also just call any pharmacy in the community and see if they can tell you what is available to consider substituting.",
                "score": 1,
                "created_utc": 1763179517.0,
                "depth": 2,
                "is_submitter": false,
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "author": "Free_Ad7133",
        "body": "Try not to make us feel stupid for medication errors. The workload of drs, particularly juniors, is huge. We don’t make errors to be annoying. We know mistakes are dangerously too, which is why no one makes medication mistakes on purpose. I’ve been left in tears after interactions with our ward pharmacist",
        "score": 64,
        "created_utc": 1763088456.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "Short_Nobody_4647",
            "body": "sounds like your ward pharmacist is a horrible person. sorry you’ve had a bad encounter",
            "score": 34,
            "created_utc": 1763089163.0,
            "depth": 1,
            "is_submitter": true,
            "replies": []
          },
          {
            "author": "sour___citrus",
            "body": "Also, we’re not purposefully ignoring you, sometimes we genuinely do not have time to get to even urgent tasks. One gentle reminder after a couple hours is okay",
            "score": 7,
            "created_utc": 1763101960.0,
            "depth": 1,
            "is_submitter": false,
            "replies": []
          }
        ]
      },
      {
        "author": "CaptnPeroxide",
        "body": "Be the best information gatherer possible! The safety of our prescribing decisions is often limited by incomplete information. And gathering the information is a huge task that we often don't have the time or resources for.  Having someone make sure the best possible information is there in the chart, and some expert prompts on how to use it, would be a great way to share your expertise. \n\nExamples of stuff that has been super helpful\n\n* Do a good medicines reconciliation with patients on admission. Its hard for doctors to have the time to go to 3 different sources and cross reference them and check with the patient/family what they are actually taking, especially when they are admitted out of hours and GP/pharmacy etc is closed. Sometimes JMO admitting them is actually cross covering another team and has never worked on a gastro ward etc so might have limited knowledge of the 'normal meds' for that patient group. \n*  Similar applies to discharges - be the one that spots that we witheld the ACEi for 2 weeks and then there was term changeover and all the doctors changed, and then the patient got started on something different for their hypertension at a met call out of hours and now they are either on both, or something entirely new unnecessarily and probably should just go back onto their ACEi...    \n* Transcribe meds on admission into the chart (my hospital has a function to be able to record med rec without prescribing and then the docs can just agree or disagree to create a prescription). Put your recommendations for withhold, cease, adjust, based on their renal function / acute illness etc. When these comments are in-line in the same place as the meds its much easier for the medical team to review the reasoning and choose to agree or adjust based on new information that comes to light during a round. \n* Look into doing pharmacist led PENFAST screening and de-label penicillin allergies if PENFAST 0. Highlight patients that would benefit from an oral challenge, facilitate the oral challenge on the ward, and then follow them up and de-label them. Provide patient information and counselling on the fact that they no-longer are considered to have a pencillin allergy and send a letter to the GP/add a standardised comment to D/C letter. \n* Identify patients on high risk medications e.g. Vancomycin and take ownership of ordering the levels at the appropriate time based on hospital protocol and then recommend dose adjustments with comments in the chart/record.Make it easy for medical teams to follow the trail of information. Similar for warfarin, APTTs for heparin etc\n* Spot patients on dangerous combinations and speak to someone face to face about it as well as writing it in the notes. Its awful to miss the note and then see 3 days later that the Pharmacist knew they were on x, y, and z but only wrote it down and it got missed because 30 other clinical notes were added since.\n\nI'm sure there's heaps more. Basically being the source of truth for a patients medication history is gold!",
        "score": 22,
        "created_utc": 1763091632.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "SomeCommonSensePlse",
            "body": "This is excellent.",
            "score": 2,
            "created_utc": 1763106678.0,
            "depth": 1,
            "is_submitter": false,
            "replies": []
          },
          {
            "author": "Short_Nobody_4647",
            "body": "super helpful, thank you!!",
            "score": 2,
            "created_utc": 1763108282.0,
            "depth": 1,
            "is_submitter": true,
            "replies": []
          }
        ]
      },
      {
        "author": "Haem_consultant",
        "body": "Our pharmacists rounds with us so they know who is getting chemo, who is getting discharged and who needs an application for expensive drugs. And of course, pick up on any drug interactions sooner rather than later.",
        "score": 15,
        "created_utc": 1763089487.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Short_Nobody_4647",
        "body": "Just for extra context, I’ve recently taken on independent pharmacist responsibility for my own ward after having a supervisor around for most of this year. So any suggestions or feedback you have are genuinely super helpful!",
        "score": 4,
        "created_utc": 1763092539.0,
        "depth": 0,
        "is_submitter": true,
        "replies": [
          {
            "author": "Free_Ad7133",
            "body": "All the best - the fact you care enough to ask speaks volumes! You’ll smash it! ",
            "score": 1,
            "created_utc": 1763201902.0,
            "depth": 1,
            "is_submitter": false,
            "replies": []
          }
        ]
      },
      {
        "author": "legoman_2049",
        "body": "medication reconciliations/meds lists are really helpful at admission and discharge\n\nbe nice to the junior doctors\n\nmonitor for hubris",
        "score": 4,
        "created_utc": 1763108040.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "ghost_ch1p",
        "body": "The best pharmacists I’ve worked with come find us and hit us up over stuff we’ve prescribed or missed. Although it sounds obvious, I say this because I’ve also worked with pharmacists that will throw a med rec in the chart (with missed medications), or box a med for review but unclear why, or write notes all over the med chart that could really be better had as a coversation.\n\nYou guys are the experts on medications so definitely just hit us up and that way we can let you know if there was intention behind the decision or not. Giving advice is always well received and the best teams are the ones the pharmacist is a key member of. \n\nAlso just an extra set of eyes for dumb stuff that sometimes gets miss on rounds - this patient isn’t on VTE prophylaxis, I know there was XYZ concern on admission but it’s been 3 days so is it cool to start now? Or this was the renal adjusted dose but AKI now improved? This alternative medication can be given as a daily dose which is likely to improve adherence at home, is there any reason we shouldn’t swap? It’s good for learning for both disciplines as sometimes they’ll be a solid reason why we’re doing something specifically, and sometimes it’ll just be because someone made a call and no one else thought about changing it but those conversations where it’s the latter do result in changed practice.",
        "score": 3,
        "created_utc": 1763097233.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "specialKrimes",
        "body": "My hospital pharmacist is the best. If ever I want to try a new treatment that I’ve never initiated before we look it up together, learn about it, resource it",
        "score": 3,
        "created_utc": 1763123891.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "HarbieBoys2",
        "body": "I trained at St Vincent’s in Sydney, and we had a very pro-active clin pharm team. They were excellent, and whilst I appreciated their input at the time, it never crossed my mind that other hospitals didn’t offer the same service. For example a pharmacist would attend psychiatry ward rounds and grand rounds. \n\nWhat I appreciated was information about optimal dosing and streamlining dosage regimes, information about drug-drug interactions, and being asked to think about concepts like pill load.",
        "score": 2,
        "created_utc": 1763121229.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Frosty-Morning1023",
        "body": "new doc starting soon. just wanted to say I appreciate this post and pharmacists like you 😊 have witnessed ward pharmacists be very kind to the interns and juniors overall and that honestly goes so far.",
        "score": 2,
        "created_utc": 1763136135.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "Short_Nobody_4647",
            "body": "thank you! and hope all goes well with your new job, im sure you’re going to be an amazing doctor",
            "score": 1,
            "created_utc": 1763206148.0,
            "depth": 1,
            "is_submitter": true,
            "replies": []
          }
        ]
      },
      {
        "author": "sour___citrus",
        "body": "Don’r jump on the bandwagon of pharmacy prescribing that is getting bandied about at hospitals. \n\nDevelop good relationships with your interns/residents/registrars and consultants and there will be far more value you can provide than just duplicating what the doctors are doing without their knowledge",
        "score": 4,
        "created_utc": 1763102207.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "MDInvesting",
        "body": "Call me before making a change to a medication that I then have to readjust.\n\nOr even better read my note explicitly stating the dose plan and rationale.\n\nPharmacists are incredibly knowledgeable but sometimes we just do not work with eachother like a team.",
        "score": 3,
        "created_utc": 1763092091.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "crumplechicken",
        "body": "Pharmacists are amazing, so great that I married one 😍.\n\nBest things you can do:\n\n- politely call us out on our errors: don't be shy with this, doctors make medication errors all the time and pharmacists add massive value by noticing drug errors\n\n- make medication suggestions or dose changes on ward rounds: if you think of something, don't be shy. We may not have considered it.\n\n- know the key classes of medication in the specialty inside out. Particularly dosing ranges in relation to renal function etc. \n\n- if your hospital doesn't offer it, lobby your department to introduce partnered pharmacist charting - it is safer for the patient and significantly reduces junior doctor workload",
        "score": -10,
        "created_utc": 1763088257.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "AnonBecauseLol",
            "body": "Who is legally liable if there’s an error in charting in your fourth point?",
            "score": 12,
            "created_utc": 1763089054.0,
            "depth": 1,
            "is_submitter": false,
            "replies": [
              {
                "author": "crumplechicken",
                "body": "Both the pharmacist and the doctor - as it requires co-sign off.",
                "score": -2,
                "created_utc": 1763091012.0,
                "depth": 2,
                "is_submitter": false,
                "replies": [
                  {
                    "author": "AnonBecauseLol",
                    "body": "Would be interesting to see how it plays out in real life litigation",
                    "score": 5,
                    "created_utc": 1763092796.0,
                    "depth": 3,
                    "is_submitter": false,
                    "replies": []
                  }
                ]
              }
            ]
          },
          {
            "author": "Short_Nobody_4647",
            "body": "The hospital im based at currently does have ppmc, provided you’ve gone further training and I believe you need to be assessed by a consultant to become credentialed. I’ve heard mixed thoughts on this, some doctors absolutely despise the idea",
            "score": 6,
            "created_utc": 1763089381.0,
            "depth": 1,
            "is_submitter": true,
            "replies": [
              {
                "author": "crumplechicken",
                "body": "It is well supported by the evidence that it significantly reduces medication errors.",
                "score": 3,
                "created_utc": 1763090884.0,
                "depth": 2,
                "is_submitter": false,
                "replies": []
              }
            ]
          },
          {
            "author": "CampaignNorth950",
            "body": "You were doing so well until number 4",
            "score": 5,
            "created_utc": 1763090201.0,
            "depth": 1,
            "is_submitter": false,
            "replies": [
              {
                "author": "crumplechicken",
                "body": "What's wrong with number 4?",
                "score": 4,
                "created_utc": 1763090666.0,
                "depth": 2,
                "is_submitter": false,
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "author": "AuntJobiska",
        "body": "Know your stuff. Don't just default to what's in stock/on the PBS - particularly when there are cogent reasons not to use it (Risperidone for bpsd I'm looking at you). Plenty of patients want the choice of paying out of pocket for a better/safer drug. Disappointing when I as the med student know more than the pharmacist because I've taken the trouble to have a conversation with consult liaison psychiatry who def knew far more than the pharmacist about the pros and cons of antipsychotic prescribing in dementia",
        "score": -11,
        "created_utc": 1763091039.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      }
    ]
  },
  "1fvwiyt": {
    "post_id": "1fvwiyt",
    "post_info": {
      "title": "Hospital pharmacist here what do you guys actually think of us? ",
      "selftext": "No wrong answers just curious to know how doctors view us in general. I’ve found most of you love our trusty purple pens but some realllllyyy do not. Keen to know why and what we can do better! ",
      "score": 48,
      "num_comments": 77
    },
    "comments": [
      {
        "author": "wotsname123",
        "body": "As a psychiatrist, if you aren't at least slightly pissing the pharmacist off you really aren't trying hard enough.\n\n\nBut as guard rails they are really valued.",
        "score": 82,
        "created_utc": 1728041277.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "Forward-Dark-2498",
            "body": "I don’t think I’ve ever been pissed off at a doctor (or nurse) tbh you guys have a HARD job and we’re here to try and make it a bit easier. Unless you hand me 6 discharge scripts at 5pm…",
            "score": 30,
            "created_utc": 1728041602.0,
            "depth": 1,
            "is_submitter": true,
            "replies": [
              {
                "author": "pm_me_ankle_nudes",
                "body": "Ok, 7 discharge scripts at 4:58 pm it is then \n\n/s",
                "score": 35,
                "created_utc": 1728043696.0,
                "depth": 2,
                "is_submitter": false,
                "replies": [
                  {
                    "author": "LuckyNumber-Bot",
                    "body": "All the numbers in your comment added up to 69. Congrats!\n\n      7\n    + 4\n    + 58\n    = 69\n\n^([Click here](https://www.reddit.com/message/compose?to=LuckyNumber-Bot&amp;subject=Stalk%20Me%20Pls&amp;message=%2Fstalkme) to have me scan all your future comments.) \\\n^(Summon me on specific comments with u/LuckyNumber-Bot.)",
                    "score": 43,
                    "created_utc": 1728043708.0,
                    "depth": 3,
                    "is_submitter": false,
                    "replies": [
                      {
                        "author": "Riproot",
                        "body": "Good bot",
                        "score": 14,
                        "created_utc": 1728053293.0,
                        "depth": 4,
                        "is_submitter": false,
                        "replies": []
                      }
                    ]
                  },
                  {
                    "author": "Amiileigh",
                    "body": "Boourns",
                    "score": 2,
                    "created_utc": 1739004498.0,
                    "depth": 3,
                    "is_submitter": false,
                    "replies": []
                  }
                ]
              },
              {
                "author": "Riproot",
                "body": "PLEASE get pissed if you work in psychiatry. \n\nI’ve seen way too many unnecessary, ineffective, side-effect-inducing combinations over the past 7 years. \n\nWe need to get pissed off on behalf of these vulnerable people who are being driven to an early grave (with a poor quality of life in the meantime); in many cases they are disempowered &amp; too institutionalised to freely speak up for themselves (or they won’t be heard regardless).",
                "score": 10,
                "created_utc": 1728053590.0,
                "depth": 2,
                "is_submitter": false,
                "replies": []
              },
              {
                "author": "wotsname123",
                "body": "I more meant aggressive dose increases or out there combinations, rather than bad timing.",
                "score": 2,
                "created_utc": 1728044367.0,
                "depth": 2,
                "is_submitter": false,
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "author": "timey_timeless",
        "body": "Used to really hate you guys. Absolute despise you. Calling me up all the time and telling me I had written something up wrong, or done a script incorrectly.\n\nSo I showed all you clowns. I learnt to prescribe accurately and appropriately so you would stop hassling me. Pharmacists hate this one simple trick.\n\nVery handy resource for bridging the gap between learning about medications in medical school and the practical reality of safe prescribing.",
        "score": 119,
        "created_utc": 1728041487.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "Relative-Ganache-138",
            "body": "As I hospital pharmacist, I do hate this trick. It gives me nothing to giggle about when I'm receiving orders to make my day (my favourite of this week was an order for \"Accuhaler? 2 INH BD\"). I do love a little error, and the pls r/v pager message I get to send.\n\nIn saying that, I absolutely love a correct script (particularly because 90% of the scripts I do are weekend scripts so it's so much harder to get hold of who you need), so thank you for learning how to prescribe safely and accurately ❤️",
            "score": 22,
            "created_utc": 1728043334.0,
            "depth": 1,
            "is_submitter": false,
            "replies": [
              {
                "author": "Overratedmango",
                "body": "I once had a very tired and overworked resident chart methane instead the patients methadone, the best are the funny harmless ones we can laugh together over",
                "score": 4,
                "created_utc": 1728135309.0,
                "depth": 2,
                "is_submitter": false,
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "author": "waxess",
        "body": "Genuinely, genuinely you lot are an actual godsend. I am so confused about \n\n1) how you remember literally everything I have tried and failed to learn and \n\n2) how far up shits Creek i would be by now without having a pharmacist bail me out of my own stupid prescribing decisions on an almost daily basis and\n\n3) how you can all be so nice while being right all the time, surrounded by people who are so often wrong and horrible.\n\nI have literally never met a pharmacist who I didn't think was amazing and I've been here for over a decade. Legitimately, thank you for everything you do, you guys are fucking incredible.",
        "score": 82,
        "created_utc": 1728043121.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "Amiileigh",
            "body": "We love you too 🙌 I see the jmos running around all stressed and just wanna hug them all - it’ll be alright in the end",
            "score": 2,
            "created_utc": 1739004638.0,
            "depth": 1,
            "is_submitter": false,
            "replies": []
          }
        ]
      },
      {
        "author": "gpolk",
        "body": "I think you guys are great, and a very welcome part of the team. And your purple pens are a lovely colour. But I may have a bias as I'm married to a hospital pharmacist.",
        "score": 42,
        "created_utc": 1728040333.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Isakson_chris",
        "body": "Would be lost without pharmacy assessments and advice personally (PGY2). Even my consultants liaise closely with pharmacists. Your input is most valuable.",
        "score": 24,
        "created_utc": 1728041123.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "InkieOops",
        "body": "Still think fondly of the pharmacists that worked with me as a junior. Had long term effects on how I prescribed. The pharmacists were some of the few members of the care team who were consistently nice, helpful and patient. \n\nThose good early experiences fostered good relationships with my community pharmacists later as a GP too- so no defensiveness on my part when they called up to clarify scripts or alert me to errors as I knew they had my back and would help me out when they could (hold that last pack of Bactrim for one of my patients, give me advice, or stay open five mins when I sent a patient around at the end of the day, etc). Love the pharmacists. (But hate the pharmacy guild, sorry).",
        "score": 17,
        "created_utc": 1728041806.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "ImpossibleMess5211",
        "body": "Every single hospital pharmacist I’ve worked with has been both extremely knowledgeable and also just a genuine nice person. An invaluable part of the hospital team, especially for junior doctors terrified of prescribing anything, legitimately lifesaving",
        "score": 9,
        "created_utc": 1728045327.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "becorgeous",
        "body": "All the hospital pharmacists I’ve worked with have been an invaluable part of the team, and I’ve never felt annoyed at being called by them as a junior. I think it’s because they’ve always called with a possible solution to the problem at hand or willing to brainstorm with me to get there. You guys do a great job!",
        "score": 8,
        "created_utc": 1728042832.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "taytayraynay",
        "body": "My favourite people in the hospital - help me heaps, and generally super nice! I envy the purple pen, it’s my favourite colour 🥺",
        "score": 14,
        "created_utc": 1728042283.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Peastoredintheballs",
        "body": "As a student, my opinion is probably irrelevant, but I’ve seen the ward pharmacists make saves countless times",
        "score": 7,
        "created_utc": 1728045947.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Fit_Square1322",
        "body": "i was just having a convo about this yesterday with my partner (ED CNE), and we both love you guys honestly.\n\ni'm an IMG and i WISH we had hospital pharmacists as well trained &amp; knowledgeable as you back home.",
        "score": 6,
        "created_utc": 1728043957.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Caffeinated-Turtle",
        "body": "I loved you guys as a JMO &lt;3 \n\nI have little to do with pharmacists these days but still thankful!",
        "score": 4,
        "created_utc": 1728047926.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "anyoneseenmysteth",
        "body": "Hospital pharmacists are holy saviors of interns who were sent from above to save us from ourselves with their fountain of wisdom and  magical purple pens. We’re forever grateful and utterly reliant.",
        "score": 4,
        "created_utc": 1728051030.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Queen_Of_Corgis",
        "body": "My team pharmacist is legit my saviour and I love them so much. I’ll sometimes ask them the most bizarre meds related questions and they’ll be like “huh, don’t know. We’ll look it up and we’ll find out together.”",
        "score": 4,
        "created_utc": 1728101701.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "teraBitez",
        "body": "I'm sorry for my bad handwriting.",
        "score": 3,
        "created_utc": 1728122571.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "maddionaire",
        "body": "Not a doctor (nurse) but I adore and admire our pharmacists. You are so smart, and your wisdom/knowledge is an invaluable and underutilised resource in both hospital and community settings. Thank you for helping keep our patients safe 💜",
        "score": 10,
        "created_utc": 1728040990.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Curlyburlywhirly",
        "body": "Amazing brilliant and infuriating.\n\nLike why do you need to check an antibiotic with me that is the correct type and dose, but my order is for 5 days instead of the usual 3? I have been a physician for almost 30 years and this needing to justify myself every damn time is frustrating. And yes I want Augmentin because of previous treatment failure, yes I know it is not first line…\n\nIf you are picking up errors or helping with efficacy then great, but the nit pocking needs to go.",
        "score": 10,
        "created_utc": 1728045180.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "smoha96",
        "body": "Highly valued. Have caught out a decent few things in my time. Good for advice when caught in tricky administration situations or coming up with novel aquisition strategies. If I ever hear, \"*Hey, just double checking this script...*\" (not that I write scripts much anymore), I take it seriously. Thanks for the hard work.",
        "score": 3,
        "created_utc": 1728048996.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "skyborn001",
        "body": "Never met a pharmacist that I despise. I love you all. All of you are helpful and always approachable. Thanks for keeping us on track and not kill anyone",
        "score": 3,
        "created_utc": 1728050257.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "themotiveateher",
        "body": "Especially when I was an intern, you guys were lifesavers. Like a fairy godmother in times of need! Thank you so much for your help &lt;3",
        "score": 3,
        "created_utc": 1728051024.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Sudden_Telephone_880",
        "body": "the most knowledgeable person in the room more often than you realise. Many respects. Aside from that, have only good things to say with regard to personal interactions... one of the few true scientists on the front line, dedicated, passionate and pragmatic",
        "score": 3,
        "created_utc": 1728099571.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "ChuckBarrel",
        "body": "Absolutely invaluable, love getting some pharmacist advice on something I’m not familiar with",
        "score": 5,
        "created_utc": 1728041739.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "speedbee",
        "body": "You guys save the day.",
        "score": 4,
        "created_utc": 1728043020.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Intrepid-Rent4973",
        "body": "Hospital pharmacists suck. Like what do you guys even do. Can't we just let the patients die or deteriorate from all the critical prescribing mistakes? \n\nInstead of asking the lowly junior doctors to rechart them or redo scripts.\n\nP.S love the work the pharmacist do. Just hate the extra work.",
        "score": 4,
        "created_utc": 1728085509.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "j5115",
        "body": "Mostly good but have had the occasional one (generally quite junior) overstep the mark in areas they don’t understand.",
        "score": 2,
        "created_utc": 1728072246.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "euphoric-alpaca",
        "body": "I have really enjoyed working with pharmacists in the hospital! I find them mostly approachable, respectable, knowledgeable and fun! Thank you!",
        "score": 2,
        "created_utc": 1728080301.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Southern_Stranger",
        "body": "Love the pharmacists I work with. Givers of knowledge, stock and legibility.",
        "score": 2,
        "created_utc": 1728086616.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "xxx_xxxT_T",
        "body": "Without you, lots more patients would be dying an iatrogenic death or come to iatrogenic harm",
        "score": 2,
        "created_utc": 1728087177.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Shenz0r",
        "body": "Pharmacists are adored by most doctors. I find that the ones who  have a hard time dealing with pharmacists to be giant walking red flags.\n\nBantering with pharmacy in our group WhatsApps is such a gem.",
        "score": 2,
        "created_utc": 1728089699.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Lost-Ad-1402",
        "body": "I have a great professional relationship with my pharmacist. We often banter about non medical or work related topics. He can even go outside and buy Banh Mi or bubble tea to bring back and we eat!! (No uber eats surcharges). So good!! On work side of things, it’s all about working out problems together like needing special formulation or working out doses of TDM drugs and makes sure I order things correctly",
        "score": 2,
        "created_utc": 1728092383.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Ok-Inevitable-3433",
        "body": "Thanks for everything, pharmacists! What a wholesome thread 🧵. ",
        "score": 2,
        "created_utc": 1728093304.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "EducationalWaltz6216",
        "body": "You are amazing &lt;333",
        "score": 2,
        "created_utc": 1728128297.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "DevSGID",
        "body": "Hospital pharmacist prevent many medication errors / patient deaths. You are a wealth of information, the job would be way harder without you!",
        "score": 2,
        "created_utc": 1728131115.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Overratedmango",
        "body": "As a hospital pharmacist myself as well, reading these replies gives me that warm fuzzy feeling, thanks for the kind words all. We appreciate all your work too",
        "score": 2,
        "created_utc": 1728134792.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "EducationalWriting48",
        "body": "Still remember a call from pharmacy asking if I was planning on killing X Patient. Turned out that wasn't part of the plan so we fixed the chart. Who doesn't love Hospital Pharmacists?",
        "score": 2,
        "created_utc": 1728135862.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Hot_Procedure_3351",
        "body": "I’m a hospital pharmacist in private! I find I’m a little less loved by consultants that have been doing there thing for a while in this setting. Which I understand, me rotating in for 6 months, I get it, annoying, and still learning, I truly do understand. But still trying to be on the same team. I find, in private, compared to my public experience, probably a little less understanding of the role and scope nowadays, given these doctors probably left the public system way before these hospital pharmacist roles were as developed. Anyone have thoughts?",
        "score": 1,
        "created_utc": 1728120043.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "MelonaBarr",
        "body": "Looking for advice on career change\nIn the last few weeks of job searching attempting at a career change to gradually transition into, I am wondering how everybody else has been doing and what their experiences have been?\n\nI had to step down from my corporate job due to it reaching a breaking point where I was so mentally drained and couldn’t have the energy to do anything else on the weekend (if I’m not working)..\n\nAt the moment was seeing if I could do some retail or christmas casual positions until I figure out my study position for which Healthcare path to undertake.\n\nCan anybody offer some advice? As going back to Uni is not very convenient for me, I was planning to study for Dental Assistant or Pharmacy Assistant as a change.",
        "score": 1,
        "created_utc": 1728195523.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Fast_Refuse_6090",
        "body": "EXTREMELY helpful and knowledgeable. Lot of security in knowing you guys will catch any major mistakes I make. Also really helpful to call and ask for medication advice, much faster than clicking through eTG",
        "score": 1,
        "created_utc": 1728266227.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "carebear_maeve",
        "body": "Love ya. Annoy me a lot, but it’s for my own good.",
        "score": 1,
        "created_utc": 1728049000.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "aussiedollface2",
        "body": "There’s always a few who hate doctors and are annoying af (maybe tried to get into med school but failed?) but otherwise yall chill and great",
        "score": 0,
        "created_utc": 1728085973.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Impossible-Outside91",
        "body": "Annoying AF",
        "score": -25,
        "created_utc": 1728041138.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "Forward-Dark-2498",
            "body": "Why do you feel that way?",
            "score": 8,
            "created_utc": 1728041343.0,
            "depth": 1,
            "is_submitter": true,
            "replies": [
              {
                "author": "Riproot",
                "body": "“Dumb AF” – the most likely answer. \n\nDoctors mostly get annoyed about being presented with time-consuming problems with unnecessary additional information, issues, etc. etc. \n\nPharmacists 99% of the time bring the problem with a solution, and that makes the solution minimally time-consuming. They’re an intelligent, invaluable asset to hospitals. \n\n(Although, I’ve had some difficult pharmacist experiences that were most definitely just personality clashes and I can’t blame the profession 🤣)",
                "score": 7,
                "created_utc": 1728053995.0,
                "depth": 2,
                "is_submitter": false,
                "replies": []
              },
              {
                "author": "Impossible-Outside91",
                "body": "Little to no value add. \n Often avoid or dont do the main useful thing: a comprehensive medication reconciliation and medication counselling on discharge.",
                "score": 1,
                "created_utc": 1728259648.0,
                "depth": 2,
                "is_submitter": false,
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "author": "Amiileigh",
        "body": "I’m late to the party here, I left NSW health over the poor treatment/bullying from within our own team but really miss the immediate impact we can have on the critically ill and vulnerable population. Personally I didn’t have any issues with doctors except for a few of the advanced trainees when they were high strung and overworked but it’s not personal. I might go back to hospital if community stresses me out too much 🤔",
        "score": 1,
        "created_utc": 1739004831.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      }
    ]
  },
  "1fvvt2c": {
    "post_id": "1fvvt2c",
    "post_info": {
      "title": "What a weird job we have",
      "selftext": "Today I went from mindlessly recording a ward round, to helping get a STEMI from resus to cath lab, to mindlessly redoing discharge prescriptions at the request of excellent pharmacists, to responding to a query seizure, to mindlessly copying scans onto CDs, to one handedly holding onto the cigarettes a patient half my weight was trying with all their might to bring into the bathroom.\n\nAlways strikes me as funny how miscellaneous the roles of a junior are. Looking forward to advancing. ",
      "score": 202,
      "num_comments": 28
    },
    "comments": [
      {
        "author": "MDInvesting",
        "body": "I held a camera and pretended to find the bosses jokes funny.\n\nDon’t advance. ‘Tis folly to be wise.",
        "score": 56,
        "created_utc": 1728039569.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "Peastoredintheballs",
            "body": "Damn was it just lap appies? U didn’t even get to do a lap chole and hold the gallbladder in the same position for the entire case whilst being told to move it back and forth slightly despite making no difference and they probably just wanted to fuck with you",
            "score": 9,
            "created_utc": 1728054335.0,
            "depth": 1,
            "is_submitter": false,
            "replies": []
          },
          {
            "author": "DunLorDen_21",
            "body": "Every level has its problems I guess",
            "score": 2,
            "created_utc": 1728041962.0,
            "depth": 1,
            "is_submitter": true,
            "replies": []
          }
        ]
      },
      {
        "author": "cold-hard-steel",
        "body": "I probably spent at least 10% of my resident years fixing the printers and another 10% sending faxes. We also had an X-Box in the Doctors’ Mess so I also got paid to complete both Halo and Jedi Starfighter.",
        "score": 31,
        "created_utc": 1728044550.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Stretcher_Bearer",
        "body": "Not to impinge on the Jdoc community but as a paramedic I totally relate to this. From catching a baby to talking someone down off of a bridge, to searching for a drunk in a pub to huddling under the tail of a RFDS plane in pouring rain. \n\nThe variety in what we do is ridiculous and I love it.",
        "score": 133,
        "created_utc": 1728037943.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "DunLorDen_21",
            "body": "Wow you sound a lot cooler than me. At least I’m under one roof all the time. Nice username!",
            "score": 25,
            "created_utc": 1728038908.0,
            "depth": 1,
            "is_submitter": true,
            "replies": [
              {
                "author": "Stretcher_Bearer",
                "body": "Nah look I reckon hospital medicine is also pretty cool too, especially if you’re in resus. You’d get such a higher proportion of the stuff we all train for, the massive STEMI’s, the multi-traumas, the CVA’s. Plus you’d get to see the treatments you initiate actually working. \n\nDon’t get me wrong, I love my pre-hospital field but that shouldn’t diminish the hospital field at all.",
                "score": 13,
                "created_utc": 1728040237.0,
                "depth": 2,
                "is_submitter": false,
                "replies": [
                  {
                    "author": "COMSUBLANT",
                    "body": "I'm not feeling well so after hours STEMIs are cancelled this weekend, its GORD until Monday, please pack plenty of mylanta in the ambulance.",
                    "score": 14,
                    "created_utc": 1728043229.0,
                    "depth": 3,
                    "is_submitter": false,
                    "replies": [
                      {
                        "author": "Stretcher_Bearer",
                        "body": "I will kindly ask all patients to reschedule their coronary events to occur within business hours going forward and apologise for any interruption to your golf game.",
                        "score": 17,
                        "created_utc": 1728043648.0,
                        "depth": 4,
                        "is_submitter": false,
                        "replies": [
                          {
                            "author": "COMSUBLANT",
                            "body": "They do this all the time. The catastrophic christmas crowd - catastrophic because they wait to present with their extensive anterior infarct until boxing day so as not to let their rapidly necrotising myocardium interfere with family proceedings.\n\nBut much appreciated. cardiology vs orthospine scramble on Sunday I want to be at 100% for.",
                            "score": 15,
                            "created_utc": 1728044601.0,
                            "depth": 5,
                            "is_submitter": false,
                            "replies": []
                          }
                        ]
                      },
                      {
                        "author": "smoha96",
                        "body": "\"*All ECG changes are early repolarisation until otherwise stated.*\"",
                        "score": 2,
                        "created_utc": 1728102885.0,
                        "depth": 4,
                        "is_submitter": false,
                        "replies": []
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "author": "speedbee",
        "body": "I went from joking around in the ward and cleaning clutter on the corridor to team leading an arrest call in a snap",
        "score": 19,
        "created_utc": 1728040362.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "DunLorDen_21",
            "body": "Yep just turns so quick doesn’t it",
            "score": 2,
            "created_utc": 1728041991.0,
            "depth": 1,
            "is_submitter": true,
            "replies": []
          }
        ]
      },
      {
        "author": "Queen_Of_Corgis",
        "body": "I once diagnosed an intrauterine foetal death for someone who came in with reduced foetal movements overnight, awful, awful experience. Then an hour later helped deliver a baby and had to act all chipper and smiley when I was dying on the inside.",
        "score": 7,
        "created_utc": 1728102045.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Middle_Composer_665",
        "body": "Is there any other way to wield a cigarette other than one handed?",
        "score": 5,
        "created_utc": 1728085745.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "DunLorDen_21",
            "body": "Picture me with one hand around the box and them trying to break my grip while also not letting go",
            "score": 3,
            "created_utc": 1728087157.0,
            "depth": 1,
            "is_submitter": true,
            "replies": []
          }
        ]
      },
      {
        "author": "stefanobris",
        "body": "Don’t forget the people you help will remember your kindness.",
        "score": 3,
        "created_utc": 1728097561.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Active-Button676",
        "body": "Can be a bit nuts nursing too. Went from drawing up an IV med to racing out because a patient had a fall, died on the floor within seconds (was palliative) to then finally hanging the IV med on the patient in the next room while he was asking after the patient that fell (he heard the thud). I’ve had other crazy shifts but that one comes to mind quite easily",
        "score": 1,
        "created_utc": 1728293629.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      }
    ]
  },
  "1oxmpn5": {
    "post_id": "1oxmpn5",
    "post_info": {
      "title": "GPs, are you okay with pharmacists ringing you up to change the prescription dose/directions?",
      "selftext": "I'm a pharmacist who is also a medical student.\n\nI often need to call the GP to get permission to change the dose to a safe, appropriate dose. Most of the time it's clear that the GP accidentally put an increased dose on when they didn't mean to.\n\nThe GPs usually are nice about it and then hang up as soon as I say thank you that's all. Which implies they are very busy.\n\nBut do GPs mind that pharmacists call them up for something seemingly simple like that?\n\nI do feel awkward calling GPs to fix the script.",
      "score": 54,
      "num_comments": 47
    },
    "comments": [
      {
        "author": "Garandou",
        "body": "If the dose I'm prescribing is likely to be an error please call so I don't accidentally kill someone.",
        "score": 195,
        "created_utc": 1763196878.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "BreadDoctor",
        "body": "Being corrected for an error is good.\n\nWhat is not so good is when the Pharmacist wants to change your management because they think they know better. ",
        "score": 112,
        "created_utc": 1763197597.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "azureleafe",
            "body": "Oh okay. I didn't know some pharmacists recommend changing management. I haven't done that before.\n\nI've only asked the doctor for permission to change the dose and frequency.",
            "score": 22,
            "created_utc": 1763197683.0,
            "depth": 1,
            "is_submitter": true,
            "replies": [
              {
                "author": "BreadDoctor",
                "body": "Unfortunately, some (a minority) do. \n\nSounds like you’re on the right track. ",
                "score": 25,
                "created_utc": 1763197769.0,
                "depth": 2,
                "is_submitter": false,
                "replies": [
                  {
                    "author": "azureleafe",
                    "body": "Thanks. Before I became a pharmacist, I thought i wasnt cut out for this job. But then I read news articles about how a mistake in a prescription got through 7 different pharmacists before it was caught by the 8th pharmacist.\n\nEdit: sorry, I wasnt clear why I wrote this comment. I meant that I used to rather trust any other pharmacist than me. But now seeing other pharmacists also make mistakes or even go out of their way to do unethical things, that has forced me to learn things for myself and be confident in my own skills and not blindly following/listening/relying on another pharmacist.",
                    "score": 17,
                    "created_utc": 1763197925.0,
                    "depth": 3,
                    "is_submitter": true,
                    "replies": [
                      {
                        "author": "BreadDoctor",
                        "body": "That’s pretty funny. \nEdit: checking things for yourself is also good advice for medicine. ",
                        "score": 10,
                        "created_utc": 1763198030.0,
                        "depth": 4,
                        "is_submitter": false,
                        "replies": [
                          {
                            "author": "Riproot",
                            "body": "“Trust no bitch” is what a friend of mine calls it. \n\nThe CT report isn’t normal unless it’s quoted or I read it, and the scan might not be normal unless I look at the images. As an example.",
                            "score": 12,
                            "created_utc": 1763205770.0,
                            "depth": 5,
                            "is_submitter": false,
                            "replies": []
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "author": "Positive-Log-1332",
        "body": "Sure.",
        "score": 26,
        "created_utc": 1763196402.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Phacoemulsifier",
        "body": "As others have said, I don't mind when pharmacists are acting in their role safeguarding patients from medication errors. I do have a problem when changes get made unilaterally on their end. This is a particular problem in Ophthalmology because so much of what we do as standard management is actually off-label use (ringing pharmacy to order cocaine eye drops for a 6 week old baby always provokes interesting responses).\n\nThe most egregious case was a patient who came in with a red irritated eye to the acute clinic back when I was a registrar. We had him on topical dexamethasone daily as a long-term med, and the pharmacist in the community decided that long-term topical steroids are dangerous so stopped them without calling anyone. Problem was this patient had a corneal transplant and developed rejection whenever he was weaned off steroid. Thankfully we were able to get him started again without losing the graft, but it took a lot of convincing because \"my chemist told me it was dangerous, I've had enough eye trouble, I don't want to take anything dangerous\".\n\nFor anyone interested, the major issues with long-term topical steroid are accelerated cataract formation and glaucoma (~30% of patients get a clinically significant rise in IOP on topical steroid). The patient in question had already had cataract surgery, and was proven to not be an IOP steroid-responder so absolutely safe to continue forever.",
        "score": 47,
        "created_utc": 1763198376.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "Peastoredintheballs",
            "body": "Which pharmacies stock cocaine? Asking for a friend ofcourse. I knew it was used tor fungating cancers and ENT stuff but opthal using cocaine is new to me. Is this a hospital pharmacy only thing, or are there certain select community pharmacies stocking medicinal nose beers (or eye beers in your case)?",
            "score": 9,
            "created_utc": 1763200229.0,
            "depth": 1,
            "is_submitter": false,
            "replies": [
              {
                "author": "Phacoemulsifier",
                "body": "Hospital only. It's very rarely needed, mainly as part of the workup for congenital Horner's syndrome. In adult Horner's we use apraclonidone to prove denervation hypersensitivity of the pupil and the levator muscle, but apraclonidine crosses the immature blood-brain barrier in children causing CNS toxicity. Cocaine is safe to use instead and is actually how they worked out what the physiology of Horner's is back in the day.\n\nThese days it's mainly a tool to torture registrars in exams, and an exercise in horrendous amounts of paperwork when needed in clinic. They have to deliver it to clinic with two pharmacy staff members. Two clinic staff members also have to be present to confirm it was used only on the patient and then discarded after.\n\nEdit: seems like a lot of trouble to go through when you could just go down the street to the local pub and pick some up without all the red tape",
                "score": 15,
                "created_utc": 1763206310.0,
                "depth": 2,
                "is_submitter": false,
                "replies": [
                  {
                    "author": "SpecialThen2890",
                    "body": "Ophthal is so fkn cool man. Our ophthal exposure this year was 3 half days in a unaccredited reg-led outpatient clinic.\n\nIt's a shame they don't even take a single trainee in my state some years.",
                    "score": 5,
                    "created_utc": 1763217245.0,
                    "depth": 3,
                    "is_submitter": false,
                    "replies": []
                  }
                ]
              },
              {
                "author": "SomeCommonSensePlse",
                "body": "We have it in our anaesthetic drug cupboards for topicalising the nasopharynx in awake fibreoptic intubation. A few of the older anaesthetists use it. I believe it's vastly more effective than the usual lignocaine/co-phenylcaine.",
                "score": 1,
                "created_utc": 1763206697.0,
                "depth": 2,
                "is_submitter": false,
                "replies": []
              }
            ]
          },
          {
            "author": "Dull-Initial-9275",
            "body": "What would you know? The pharmacist did a 4 hour online module on eye thingies and has dispensing software which flagged your inappropriate prescribing. They're more qualified than you.",
            "score": 12,
            "created_utc": 1763200049.0,
            "depth": 1,
            "is_submitter": false,
            "replies": [
              {
                "author": "Phacoemulsifier",
                "body": "Truly the Zen masters of medication. Able to prescribe and cease without such mundane things as a \"history\" or \"clinical examination\". Just open your mind and let the automated prescribing system speak its canned warnings through you.",
                "score": 8,
                "created_utc": 1763207074.0,
                "depth": 2,
                "is_submitter": false,
                "replies": []
              }
            ]
          },
          {
            "author": "smoha96",
            "body": "Did this ever get fed back to said pharmacist?",
            "score": 3,
            "created_utc": 1763202116.0,
            "depth": 1,
            "is_submitter": false,
            "replies": [
              {
                "author": "Phacoemulsifier",
                "body": "Shamefully no. In my defence this was in an afternoon clinic with 60 patients booked for 3 regs and a fellow, and every day's schedule looked like that. Unfortunately as we all know when the clinic is chronically a dumpster fire you tend to just shrug and pick up the next one in the hope that you'll get to go home before dying of old age.",
                "score": 12,
                "created_utc": 1763206957.0,
                "depth": 2,
                "is_submitter": false,
                "replies": [
                  {
                    "author": "InadmissibleHug",
                    "body": "I used to be an ophthal nurse, this tracks. The waiting list to be seen was still egregious even with an absolute shit show happening.",
                    "score": 1,
                    "created_utc": 1763231896.0,
                    "depth": 3,
                    "is_submitter": false,
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "author": "psycehe",
        "body": "Not a GP, but when I get called at the hospital, not something we worry about. More embarrassed about the mistake and time for the pharmacist. But yes, usually just busy so wanting to finish up the call before the next one!",
        "score": 19,
        "created_utc": 1763196536.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Dull-Initial-9275",
        "body": "I appreciate it, that's what pharmacists are for. To provide expertise on the checking of medications prescribed by doctors, amongst other things. I definitely didn't mean to prescribe 500mg of prednisolone.\n\nWhat I don't appreciate is pharmacists prescribing keflex for my patient that ends up with pelvic inflammatory disease, sepsis and infertility. Or giving topical steroids for \"dermatitis\" that took me 1 glance to recognise as a textbook melanoma.",
        "score": 53,
        "created_utc": 1763196485.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "Cryptographer_Away",
            "body": "Please tell me the topical steroids example is hypothetical and/or the patient survived the melanoma…",
            "score": 16,
            "created_utc": 1763197083.0,
            "depth": 1,
            "is_submitter": false,
            "replies": [
              {
                "author": "Dull-Initial-9275",
                "body": "Not hypothetical. Happened a few months ago. Fortunately survived but it was stage III.",
                "score": 25,
                "created_utc": 1763197683.0,
                "depth": 2,
                "is_submitter": false,
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "author": "Adorable-Condition83",
        "body": "Not a GP but I once had a pharmacist call me to confirm the dose of a steroid and I was so thankful. Reminds me of nurse Roberts on Scrubs: ‘I thought I’d check with you before I kill a man’ 🤣",
        "score": 15,
        "created_utc": 1763199894.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "MegaPint549",
        "body": "Just to add even if the Dr is an a-hole about the call, it’s in the patient’s best interest you do your job and exercise your professional responsibilities",
        "score": 15,
        "created_utc": 1763201857.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "fernflower5",
        "body": "Paeds reg - would definitely rather the pharmacist called. I've seen some pharmacists change scripts (eg high dose oral antibiotics for osteomyelitis changed to a standard dose) or dispense a regular med without a script (when the script had in fact been written and changed just lost by the family, calling 6 months later and asking for that chlonidine/ritalin/etc to be back dated for whatever was dispensed to help the pharmacy books is never a good thing).\n\nFortunately the family of the osteomyelitis kiddo gave the med as prescribed not as dispensed and called the hospital for advice when they ran out after 36 hours.",
        "score": 13,
        "created_utc": 1763202638.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Langenbeck_holder",
        "body": "Surg reg, happy to be called to confirm doses etc. But don’t like when they ask me to change the script to be PBS when the pt does not meet PBS criteria - a frequent request is for ondansetron which is only pbs for those on chemo",
        "score": 8,
        "created_utc": 1763206662.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "CommittedMeower",
        "body": "Not a GP but did a GP term and fielded some of these calls. Very happy to receive them. Less happy when management has been messed with and they didn't tell me.",
        "score": 7,
        "created_utc": 1763201992.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "azureleafe",
            "body": "You mean a pharmacist changing managment/dose/frequency/directions or changing something else without the GP's permission and without calling the GP? Pharmacists definitely aren't allowed to do that.",
            "score": 2,
            "created_utc": 1763203475.0,
            "depth": 1,
            "is_submitter": true,
            "replies": [
              {
                "author": "CommittedMeower",
                "body": "They shouldn't, but I have had experiences where they have, or have messed with my management in other ways. Their record keeping for these things is also awful.",
                "score": 4,
                "created_utc": 1763203688.0,
                "depth": 2,
                "is_submitter": false,
                "replies": []
              }
            ]
          }
        ]
      },
      {
        "author": "drmiaowmix",
        "body": "I don’t mind, would definitely rather know if I have made a mistake! The time I do feel mildly annoyed is if I have used the RCH paeds weight based calculations which usually end with slightly higher dose than etg paeds weight based calculations and then pharmacist wants to fight me over the phone for a small difference… very tiring.",
        "score": 7,
        "created_utc": 1763202470.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Fuzzy_Exit_2636",
        "body": "Any good GP won't mind. ",
        "score": 6,
        "created_utc": 1763200620.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Riproot",
        "body": "Isn’t that a key role of a pharmacist?\n\nIf anyone doesn’t like that then maybe they shouldn’t be prescribing, or should find some magic way to never make a mistake ever again…?",
        "score": 4,
        "created_utc": 1763205657.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "Puzzleheaded_Test544",
        "body": "The only time it ever happened I was driving on the freeway with screaming child in the back while this softly spoken person tried to say something about weight based drug dosing for a patient I didn't remember so I just yelled \"DO WHATEVER YOU WANT\" and hung up.",
        "score": 15,
        "created_utc": 1763197153.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "azureleafe",
            "body": "Oh my God lol, that's amazing.",
            "score": 4,
            "created_utc": 1763197727.0,
            "depth": 1,
            "is_submitter": true,
            "replies": []
          }
        ]
      },
      {
        "author": "Bubbly_Version_7158",
        "body": "When I was younger, dumber and more arrogant,  I used to get defensive and hit heads  especially with young pharmacists that suffered similar characteristics of being young.\n\nNow I appreciate them saving my ass, and or the patients multiple times over my career.\n\nMost the time it is the pharmacists checking changes are correct,  which is an essential part of the chain of safety in medical prescriptions and human error detection. \nAnd the occasional time a junior over enthusiast pharmacists with a chip on shoulder have rang inappropriately, is well worth the layer of safety and understanding of the patient in the community pharmacists provide.\n\nThe young anxious pharmacists is an opportunity for gentle education and colleagial relationship building, hust like the young arrogant registrars we one were!\n\nTeam work, with the patient as the captain of the team for the win!",
        "score": 3,
        "created_utc": 1763230148.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "sdfghtrwz",
        "body": "It’s usually stupid annoying shit - this medication we can only dispense in a tablet and not a capsule . You will have to resend the script again \n\nOr penicillin allergy and prescribed another agent as stated by ETG which is stated to have minimal interaction . The pharmacist scared the patient who subsequently never took the Abx and deteriorated . Sorry can’t remember exact details since it has been months . I got pissed off massively !!! The patient also had this baby allergy that she couldn’t remember . \n\nOr like the most minute calculation of paeds doses - I think I calculated 260 mg of amoxicillin . Turns out it was 240 mg . Asked me to send it again .",
        "score": 3,
        "created_utc": 1763200772.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "azureleafe",
            "body": "When I was taught in my internship year and working around pharmacists, we call the GP, but then we make a handwritten note on the prescription (e.g. we cross out the 260mg and then write 240mg above it, then we sign our name, date it, put the pharmacy number on it).\n\nI've never actually asked the GP to send another revised script.",
            "score": 3,
            "created_utc": 1763201214.0,
            "depth": 1,
            "is_submitter": true,
            "replies": [
              {
                "author": "sdfghtrwz",
                "body": "Your buddies at chemist warehouse say different things ",
                "score": 7,
                "created_utc": 1763201369.0,
                "depth": 2,
                "is_submitter": false,
                "replies": [
                  {
                    "author": "azureleafe",
                    "body": "That would be frustrating for the customer, since the customer would probably have to go home until the new script is sent to the chemist.",
                    "score": 2,
                    "created_utc": 1763203571.0,
                    "depth": 3,
                    "is_submitter": true,
                    "replies": [
                      {
                        "author": "Existing_Ad3299",
                        "body": "Yes but we don't blame the pharmacist, we don't usually even blame the doctor.",
                        "score": 2,
                        "created_utc": 1763212020.0,
                        "depth": 4,
                        "is_submitter": false,
                        "replies": []
                      }
                    ]
                  },
                  {
                    "author": "Riproot",
                    "body": "You can email them with the updated instructions from a work email/with your signature contacts. I do it not infrequently",
                    "score": 2,
                    "created_utc": 1763206149.0,
                    "depth": 3,
                    "is_submitter": false,
                    "replies": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "author": "AuntJobiska",
        "body": "As the patient, I've only had pharmacists make mistakes... dispensing the standard amount of meds when the dose is for an increased quantity (so I ran out early) or writing that the statin was to be taken in the evening and that it was for cholesterol management... No, it's an off label script and needs to be taken in the morning FFS (that particular statin was being used as an enzyme inhibitor to increase blood levels of another med)",
        "score": 3,
        "created_utc": 1763207599.0,
        "depth": 0,
        "is_submitter": false,
        "replies": [
          {
            "author": "SpecialThen2890",
            "body": "Idk I feel like you can cut them some slack in that situation. I don't think many pharmacists are on the ball to the extent that they understand why you're using it in the morning to influence another medication blood concentration",
            "score": 2,
            "created_utc": 1763217545.0,
            "depth": 1,
            "is_submitter": false,
            "replies": []
          }
        ]
      },
      {
        "author": "NoBid1829",
        "body": "I have all the time in the world for pharmacists",
        "score": 1,
        "created_utc": 1763233373.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      },
      {
        "author": "cravingpancakes",
        "body": "We definitely appreciate it! If we hang up quickly it’s just a reflection of how busy we are - every second is precious during consultations with patients. Most people unfortunately book a 15 minute appointment for multiple complaints and we end up running behind which annoys the next patient waiting",
        "score": 1,
        "created_utc": 1763241206.0,
        "depth": 0,
        "is_submitter": false,
        "replies": []
      }
    ]
  }
}